/////////////////////////////////////////////////////////////////////////////
// Unreal Engine MiniSDK Generator by uNrEaL
// Game: CrimeCraft
// File: ACCBaseController.h
// Date: 06/16/2011 @ 05:19:40.47
/////////////////////////////////////////////////////////////////////////////

#ifdef _MSC_VER
#pragma pack( push, 4 )
#endif

struct ACCBaseController_execclient_ShowLocalizedMessage_Parms
{
	struct FString msgId;
	unsigned char MsgType;
	float flLifetime;
};

struct ACCBaseController_execserver_ShowLocalizedMessage_Parms
{
	struct FString msgId;
	unsigned char MsgType;
	float flLifetime;
};

struct ACCBaseController_execClientHideGamePanel_Parms
{
};

struct ACCBaseController_execServerHideGamePanel_Parms
{
};

struct ACCBaseController_execClientQueueMessage_Parms
{
	struct FString Message;
	struct FString Caption;
};

struct ACCBaseController_execServerQueueMessage_Parms
{
	struct FString Value;
	struct FString Caption;
};

struct ACCBaseController_execClientSetLabelMissionValue_Parms
{
	struct FString Value;
	int iVal;
	int MaxVal;
};

struct ACCBaseController_execServerSetLabelMissionValue_Parms
{
	struct FString Value;
	int iVal;
	int MaxVal;
};

struct ACCBaseController_execClientToggleReminder_Parms
{
	struct FString Value;
};

struct ACCBaseController_execServerToggleReminder_Parms
{
	struct FString Value;
};

struct ACCBaseController_eventOnSwitchGame_Parms
{
};// FUNC_Event

struct ACCBaseController_execShowMyPawn_Parms
{
};// FUNC_Exec

struct ACCBaseController_execHideMyPawn_Parms
{
};// FUNC_Exec

struct ACCBaseController_execEnableCheats_Parms
{
};// FUNC_Exec

struct ACCBaseController_execTestTestTest_Parms
{
};// FUNC_Exec

struct ACCBaseController_execRetrieveAbilityInfoPersistent_Parms
{
	int AbilityId;
	void* _AbilityManager;
	struct FCCAbilityDesc ReturnValue; // CPF_ReturnParm
};

struct ACCBaseController_execIsAbilityPassive_Parms
{
	struct FCCAbilityDesc Desc; // CPF_OutParm
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCBaseController_execViewNextBot_Parms
{
	int Dir;
};

struct ACCBaseController_execEndSpectator_Parms
{
};

struct ACCBaseController_execStartSpectator_Parms
{
};

struct ACCBaseController_execDoToggleSpectator_Parms
{
};

struct ACCBaseController_execServerDoToggleSpectator_Parms
{
};

struct ACCBaseController_execToggleSpectator_Parms
{
};// FUNC_Exec

struct ACCBaseController_execclient_sleep_Parms
{
	int miliseconds;
};// FUNC_Exec

struct ACCBaseController_execMakeClientSleep_Parms
{
	int miliseconds;
};// FUNC_Native

struct ACCBaseController_execDoGod_Parms
{
};

struct ACCBaseController_execServerDoGod_Parms
{
};

struct ACCBaseController_execttGod_Parms
{
};// FUNC_Exec

struct ACCBaseController_eventDestroyed_Parms
{
};// FUNC_Event

struct ACCBaseController_execReceiveMailUpdate_Parms
{
	int NumberOfMessages;
};// FUNC_Exec FUNC_Native

struct ACCBaseController_execReceiveMailInit_Parms
{
	int NumberOfMessages;
};// FUNC_Exec FUNC_Native

struct ACCBaseController_execSetNewMap_Parms
{
};// FUNC_Exec

struct ACCBaseController_execServerSetNewMap_Parms
{
};

struct ACCBaseController_execReceiveChat_Parms
{
	int NumberOfMessages;
	int InSleep;
};// FUNC_Exec FUNC_Native

struct ACCBaseController_execPerformGC_Parms
{
};// FUNC_Exec FUNC_Native

struct ACCBaseController_execSendChatMessage_Parms
{
	struct FString ChatMessage;
};

struct ACCBaseController_execSendRemoteEvent_Parms
{
	struct FName EventName;
};// FUNC_Exec

struct ACCBaseController_execPreBeginPlay_Parms
{
};

struct ACCBaseController_execStartLoadingProcess_Parms
{
	unsigned long bStart : 1;
};

struct ACCBaseController_eventStartLoadingLevel_Parms
{
	struct FString MapName;
	int GameType;
	int InId;
	struct FString LoadingScreen;
	void* ReturnValue; // CPF_ReturnParm
};// FUNC_Event

struct ACCBaseController_execSetResolution_Parms
{
	int X;
	int Y;
};// FUNC_Exec

struct ACCBaseController_execSetGeneralQuality_Parms
{
	int QL;
};// FUNC_Exec

struct ACCBaseController_execSetDebugConditions_Parms
{
	int Value;
};// FUNC_Exec

struct ACCBaseController_execCloseOptionsMenu_Parms
{
};

struct ACCBaseController_execOpenOptionsMenu_Parms
{
};

struct ACCBaseController_eventReopenMenu_Parms
{
	void* MenuInstance;
	unsigned long bSkipAnimation : 1;
};// FUNC_Event

struct ACCBaseController_eventCloseMenu_Parms
{
	void* MenuInstance;
	unsigned long bSkipAnimation : 1;
};// FUNC_Event

struct ACCBaseController_eventOpenMenu_Parms
{
	void* MenuTemplate;
	unsigned long bSkipAnimation : 1;
	unsigned char ForcedPriority;
	void* ReturnValue; // CPF_ReturnParm
};// FUNC_Event

struct ACCBaseController_execOpenUIMenu_Parms
{
	struct FString MenuPath;
};// FUNC_Exec

struct ACCBaseController_execHideStandaloneMenu_Parms
{
	void* MenuTemplate;
};

struct ACCBaseController_execShowStandaloneMenu_Parms
{
	void* MenuTemplate;
};

struct ACCBaseController_execOnLogoutConfirmed_Parms
{
	unsigned char Result;
};

struct ACCBaseController_eventRequestLogout_Parms
{
};// FUNC_Event

struct ACCBaseController_execOnDisconnectConfirmed_Parms
{
	unsigned char Result;
};

struct ACCBaseController_eventRequestDisconnect_Parms
{
};// FUNC_Event

struct ACCBaseController_execOnSwitchConfirmed_Parms
{
	unsigned char Result;
};

struct ACCBaseController_eventRequestSwitchApplication_Parms
{
};// FUNC_Event

struct ACCBaseController_execOnExitConfirmed_Parms
{
	unsigned char Result;
};

struct ACCBaseController_eventRequestExitGame_Parms
{
};// FUNC_Event

struct ACCBaseController_execCloseMessageBox_Parms
{
};

struct ACCBaseController_execMessageBoxConfirm_Parms
{
	unsigned char Result;
};

struct ACCBaseController_eventShowMessageBoxSys_Parms
{
	struct FString Message;
	struct FString Title;
	unsigned char Type;
};// FUNC_Final FUNC_Event

struct ACCBaseController_execCloseAllNotifies_Parms
{
};

struct ACCBaseController_execShowMessageBox_Parms
{
	struct FString Message;
	struct FString Title;
	unsigned char Type;
	struct FScriptDelegate CloseMethod;
	unsigned char align;
	unsigned long bHideActiveMenus : 1;
	float AutoCloseTime;
};

struct ACCBaseController_execShowNotifyAtCoords_Parms
{
	struct FString Message;
	float X;
	float Y;
	unsigned long bForceFlip : 1;
	float DelayTime;
	void* ReturnValue; // CPF_ReturnParm
};

struct ACCBaseController_execExit_Parms
{
	unsigned char MsgResult;
};

struct ACCBaseController_execOpenEntryLevel_Parms
{
	unsigned char MsgResult;
};

struct ACCBaseController_eventOnDisconnectFromServer_Parms
{
};// FUNC_Event

struct ACCBaseController_execIsActiveInternetConnection_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Native

struct ACCBaseController_execLogoutToCharacterList_Parms
{
};// FUNC_Native

struct ACCBaseController_execDisconnectFromServer_Parms
{
};// FUNC_Native

struct ACCBaseController_execLoginToServer_Parms
{
	struct FString LoginName;
	struct FString Password;
	struct FString InServerAddressOverride;
	int InPortOverride;
};// FUNC_Native

// (0x5B4 - 0x64C)
class ACCBaseController : public APlayerController
{
public:
	void*                                              PersistentAbilityManager;                    // 0x05B4 (0x0004)
	void*                                              NetworkConfig;                               // 0x05B8 (0x0004)
	void*                                              UserNetworkConfig;                           // 0x05BC (0x0004)
	void*                                              UIConfig;                                    // 0x05C0 (0x0004)
	TArray< void* >                                    ActiveMessageBoxes;                          // 0x05C4 (0x000C)
	void*                                              MessageBoxOkTemplate;                        // 0x05D0 (0x0004)
	void*                                              MessageBoxYesNoTemplate;                     // 0x05D4 (0x0004)
	void*                                              MessageBoxYesNoCancelTemplate;               // 0x05D8 (0x0004)
	void*                                              Entry_MessageBoxOkTemplate;                  // 0x05DC (0x0004)
	void*                                              Entry_MessageBoxYesNoTemplate;               // 0x05E0 (0x0004)
	void*                                              Entry_MessageBoxYesNoCancelTemplate;         // 0x05E4 (0x0004)
	void*                                              MessageBoxNotify;                            // 0x05E8 (0x0004)
	void*                                              MessageBox_Handicap;                         // 0x05EC (0x0004)
	void*                                              LoadingScreenMenu;                           // 0x05F0 (0x0004)
	unsigned long                                      bLoadingProgress : 1;                        // 0x05F4 (0x0004) [0x00000001]
	unsigned long                                      bQueryExit : 1;                              // 0x05F4 (0x0004) [0x00000002]
	void*                                              ContextMenuInstance;                         // 0x05F8 (0x0004)
	void*                                              ContextMenuTemplate;                         // 0x05FC (0x0004)
	void*                                              OptionsSceneTemplate;                        // 0x0600 (0x0004)
	void*                                              OptionsScene;                                // 0x0604 (0x0004)
	struct FString                                     ServerNotRespondingMsg;                      // 0x0608 (0x000C)
	struct FString                                     ServerNotRespondingTitle;                    // 0x0614 (0x000C)
	struct FString                                     ConnectionLostMsg;                           // 0x0620 (0x000C)
	struct FString                                     ConnectionLostTitle;                         // 0x062C (0x000C)
	struct FName                                       LastState;                                   // 0x0638 (0x0008)
	class APawn*                                       LastPawn;                                    // 0x0640 (0x0004)
	void*                                              TutorialSystemInst;                          // 0x0644 (0x0004)
	void*                                              TutorialSystemTemplate;                      // 0x0648 (0x0004)

private:
	static UClass* ClassPointer;

public:
	static UClass* StaticClass ()
	{
		if ( !ClassPointer )
			ClassPointer = UObject::FindClass( "Class CrimeCraft.CCBaseController" );

		return ClassPointer;
	};

public:
	void client_ShowLocalizedMessage ( struct FString msgId, unsigned char MsgType, float flLifetime )
	{
		static UFunction* pfnclient_ShowLocalizedMessage = NULL;

		if ( !pfnclient_ShowLocalizedMessage )
			pfnclient_ShowLocalizedMessage = UObject::FindObject< UFunction >( "Function CrimeCraft.CCBaseController.client_ShowLocalizedMessage" );

		ACCBaseController_execclient_ShowLocalizedMessage_Parms client_ShowLocalizedMessage_Parms;
		memcpy( &client_ShowLocalizedMessage_Parms.msgId, &msgId, 0xC );
		client_ShowLocalizedMessage_Parms.MsgType = MsgType;
		client_ShowLocalizedMessage_Parms.flLifetime = flLifetime;

		this->ProcessEvent( pfnclient_ShowLocalizedMessage, &client_ShowLocalizedMessage_Parms, NULL );
	};

