/////////////////////////////////////////////////////////////////////////////
// Unreal Engine MiniSDK Generator by uNrEaL
// Game: CrimeCraft
// File: ACCController.h
// Date: 06/16/2011 @ 05:19:41.213
/////////////////////////////////////////////////////////////////////////////

#ifdef _MSC_VER
#pragma pack( push, 4 )
#endif

enum EABaseYStackType
{
	EABaseYStackType_Default = 0,
	EABaseYStackType_LRMB = 1,
	EABaseYStackType_TriggerAction = 2,
	EABaseYStackType_MAX = 3
};

enum EMoveDirection
{
	EMD_Stay = 0,
	EMD_Forward = 1,
	EMD_ForwardRight = 2,
	EMD_Right = 3,
	EMD_RightBackward = 4,
	EMD_Backward = 5,
	EMD_BackwardLeft = 6,
	EMD_Left = 7,
	EMD_LeftForward = 8,
	EMD_MAX = 9
};

struct ACCController_execTriggerAllSequenceEvents_Parms
{
	class UClass* SeqEventClass;
};

struct ACCController_execVipProgramDoFading_Parms
{
	float Dest;
	float Time;
};// FUNC_Exec

struct ACCController_execVipProgramNotifyGirlFarFromHead_Parms
{
};// FUNC_Exec

struct ACCController_execVipProgramNotifyGirlNearByHead_Parms
{
};// FUNC_Exec

struct ACCController_execVipProgramDisableCameraAnimation_Parms
{
};

struct ACCController_execVipProgramEnableCameraAnimation_Parms
{
};

struct ACCController_execVipProgramPlayCameraAnimation_Parms
{
	struct FName CameraTrackName;
	struct FMatrix OriginTM; // CPF_OutParm
};

struct ACCController_execVipProgramPlayFromHeadCameraAnimation_Parms
{
};

struct ACCController_execVipProgramPlayAnimation_Parms
{
	struct FName SittingActionName;
};

struct ACCController_execVipProgramMakePawnStandUp_Parms
{
};

struct ACCController_execVipProgramMakePawnSitOnTheChair_Parms
{
	void* SitableChair;
};

struct ACCController_execFinishVipStripGirlProgram_Parms
{
};

struct ACCController_execStartVipStripGirlProgram_Parms
{
};

struct ACCController_execOnSitableLogicStartedIdleState_Parms
{
};

struct ACCController_execFinishSittingImmediately_Parms
{
};

struct ACCController_execFinishSittingLatent_Parms
{
};

struct ACCController_execUserFinishSittingLatent_Parms
{
};// FUNC_Exec

struct ACCController_execStartSittingImmediately_Parms
{
	void* SitableActor;
	int SitdownType;
	int AnimIndex;
};

struct ACCController_execStartSittingLatent_Parms
{
	void* SitableActor;
	int SitdownType;
	int AnimIndex;
};

struct ACCController_execUserStartSittingLatent_Parms
{
	int AnimIndex;
};// FUNC_Exec

struct ACCController_execRemoveFromABaseYStack_Parms
{
	unsigned char Type;
};

struct ACCController_execUpdateRemoveABaseYStack_Parms
{
	unsigned char Type;
};

struct ACCController_execaStrafeImpl_Parms
{
	float Speed;
	unsigned long isDown : 1;
};// FUNC_Exec

struct ACCController_execaBaseYImpl_Parms
{
	float Speed;
	unsigned long isDown : 1;
	unsigned char Type;
};// FUNC_Exec

struct ACCController_execFindAllAndPrint_Parms
{
};// FUNC_Exec

struct ACCController_execGetAnimTreePoolInstance_Parms
{
	void* ReturnValue; // CPF_ReturnParm
};

struct ACCController_execGetStaticGibManagerStore_Parms
{
	void* ReturnValue; // CPF_ReturnParm
};

struct ACCController_execStopScriptProf_Parms
{
	int Client;
};// FUNC_Exec

struct ACCController_execStartScriptProf_Parms
{
	int Client;
};// FUNC_Exec

struct ACCController_execGetWeaponAttachmentPresetStore_Parms
{
	void* ReturnValue; // CPF_ReturnParm
};

struct ACCController_execBlockForChangeMat_Parms
{
};

struct ACCController_execCheckCameraDistance_Parms
{
};

struct ACCController_execGetBuildNumber_Parms
{
	struct FString ReturnValue; // CPF_ReturnParm
};// FUNC_Native

struct ACCController_execServerPingUDSManager_Parms
{
	int MessageSize;
	int Count;
};

struct ACCController_execPingUDSManager_Parms
{
	int MessageSize;
	int Count;
};// FUNC_Exec

struct ACCController_execPingAll_Parms
{
	int MessageSize;
	int Count;
};// FUNC_Exec

struct ACCController_execPing_Parms
{
	int MessageSize;
	int Count;
};// FUNC_Exec

struct ACCController_execOnMapReleased_Parms
{
};// FUNC_Exec

struct ACCController_execOnMapPressed_Parms
{
};// FUNC_Exec

struct ACCController_execGetPlayerNameTag_Parms
{
	class APlayerReplicationInfo* PRI;
	unsigned long bAssist : 1;
	struct FString ReturnValue; // CPF_ReturnParm
};

struct ACCController_execShowExp_Parms
{
};// FUNC_Exec

struct ACCController_execSetSimpleMeshDrawDistance_Parms
{
	float NewDistance;
};// FUNC_Exec FUNC_Native

struct ACCController_execSetDesignConstant_Parms
{
	struct FString ConstantName;
	struct FString ConstantValue;
};// FUNC_Exec

struct ACCController_execSetInstanceGameTime_Parms
{
	struct FString InstanceName;
	int GameTime;
};// FUNC_Exec

struct ACCController_execSetInstanceWarmupTime_Parms
{
	struct FString InstanceName;
	int WarmupTime;
};// FUNC_Exec

struct ACCController_execSetInstanceMinPlayers_Parms
{
	struct FString InstanceName;
	int MinPlayers;
};// FUNC_Exec

struct ACCController_execGoToLobby_Parms
{
	struct FString LobbyName;
};// FUNC_Exec

struct ACCController_execGainCounter_Parms
{
	int TypeId;
	int Value;
};// FUNC_Exec

struct ACCController_execCancelQuest_Parms
{
	struct FString QuestName;
};// FUNC_Exec

struct ACCController_execGainQuest_Parms
{
	struct FString QuestName;
};// FUNC_Exec

struct ACCController_execCompleteQuest_Parms
{
	struct FString QuestName;
	unsigned long OnlyMark : 1;
};// FUNC_Exec

struct ACCController_execSetPaperdollItemsDurability_Parms
{
	int Durability;
};// FUNC_Exec

struct ACCController_execGainItem_Parms
{
	struct FString ItemName;
};// FUNC_Exec

struct ACCController_execGainCraftAbility_Parms
{
	struct FString AbilityName;
};// FUNC_Exec

struct ACCController_execGainAbility_Parms
{
	struct FString AbilityName;
	int Level;
};// FUNC_Exec

struct ACCController_execGainProfession_Parms
{
	struct FString ProfessionName;
};// FUNC_Exec

struct ACCController_execStartNextTournamentRound_Parms
{
};// FUNC_Exec

struct ACCController_execStopClanWarPairTime_Parms
{
};// FUNC_Exec

struct ACCController_execStartTournament_Parms
{
};// FUNC_Exec

struct ACCController_execGainClanRate_Parms
{
	int Value;
};// FUNC_Exec

struct ACCController_execGainClass_Parms
{
	struct FString Value;
};// FUNC_Exec

struct ACCController_execGainExp_Parms
{
	int Value;
};// FUNC_Exec

struct ACCController_execGainMoney_Parms
{
	int Value;
};// FUNC_Exec

struct ACCController_execGainGold_Parms
{
	int Value;
};// FUNC_Exec

struct ACCController_execGainAP_Parms
{
	int APValue;
};// FUNC_Exec

struct ACCController_execGainProfessionLvl_Parms
{
	int NewLevel;
};// FUNC_Exec

struct ACCController_execGainLvl_Parms
{
	int NewRPGLevel;
};// FUNC_Exec

struct ACCController_execGainGangLvl_Parms
{
	int NewGangLevel;
};// FUNC_Exec

struct ACCController_execGainGang_Parms
{
	struct FString GangName;
	struct FString Description;
	int LogoId;
	int LogoColorId;
};// FUNC_Exec

struct ACCController_execOpenInstance_Parms
{
	struct FString InstanceName;
};// FUNC_Exec

struct ACCController_execSetHiddenEx_Parms
{
	int V;
};// FUNC_Exec

struct ACCController_eventNotifyControllerTakeDamage_Parms
{
	int Id;
};// FUNC_Event

struct ACCController_eventUpdateGroupPresentation_Parms
{
};// FUNC_Event

struct ACCController_execGetClanName_Parms
{
	struct FString ReturnValue; // CPF_ReturnParm
};

struct ACCController_eventGetName_Parms
{
	struct FString ReturnValue; // CPF_ReturnParm
};// FUNC_Event

struct ACCController_eventDestroyed_Parms
{
};// FUNC_Event

struct ACCController_execClientSetHUD_Parms
{
	class UClass* newHUDType;
	class UClass* newScoringType;
};

struct ACCController_execPlayAnnouncement_Parms
{
	class UClass* InMessageClass;
	unsigned char MessageIndex;
	class UObject* OptionalObject;
	int OptionalData;
};

struct ACCController_eventLimitViewRotation_Parms
{
	struct FRotator ViewRotation;
	float ViewPitchMin;
	float ViewPitchMax;
	struct FRotator ReturnValue; // CPF_ReturnParm
};// FUNC_Event

struct ACCController_execProcessViewRotation_Parms
{
	float DeltaTime;
	struct FRotator out_ViewRotation; // CPF_OutParm
	struct FRotator DeltaRot;
};

struct ACCController_execServerSetPlayerViewPoint_Parms
{
	struct FVector POVLocation;
	struct FVector POVRotation;
};

struct ACCController_execUpdateServerCameraView_Parms
{
};

struct ACCController_eventGetPlayerViewPoint_Parms
{
	struct FVector POVLocation; // CPF_OutParm
	struct FRotator POVRotation; // CPF_OutParm
};// FUNC_Event

struct ACCController_eventPossess_Parms
{
	class APawn* aPawn;
	unsigned long bVehicleTransition : 1;
};// FUNC_Event

struct ACCController_execClientPossess_Parms
{
};

struct ACCController_execSpawnCamera_Parms
{
};

struct ACCController_execSetViewTarget_Parms
{
	class AActor* NewViewTarget;
	struct FViewTargetTransitionParams TransitionParams;
};

struct ACCController_execGetAllPawnsInSector_Parms
{
	float Radius;
	float Angle;
	TArray< class ACCLobbyRemoteController* > out_Controllers; // CPF_OutParm
};// FUNC_Native

struct ACCController_execLockMovement_Parms
{
	unsigned long bLock : 1;
};

struct ACCController_execDetermineMoveDir_Parms
{
	float Forward;
	float Strafe;
	unsigned char ReturnValue; // CPF_ReturnParm
};

struct ACCController_execOnLBMouseRelease_Parms
{
};// FUNC_Exec

struct ACCController_execOnLBMousePress_Parms
{
};// FUNC_Exec

struct ACCController_execFpsMode_Parms
{
	int on;
};// FUNC_Exec

struct ACCController_execGetPoolDebugInfo_Parms
{
};// FUNC_Exec

struct ACCController_eventPlayerTick_Parms
{
	float DeltaTime;
};// FUNC_Event

struct ACCController_execNotifyConnectionError_Parms
{
	struct FString Message;
	struct FString Title;
};

struct ACCController_eventPostBeginPlay_Parms
{
};// FUNC_Event

struct ACCController_execSetActiveAbility_Parms
{
	struct FName AbilityName;
};// FUNC_Exec

struct ACCController_execLobbyLoadingFinished_Parms
{
};// FUNC_Exec

struct ACCController_execStripGirlTestFade_Parms
{
	unsigned long bEnable : 1;
};// FUNC_Exec

struct ACCController_execGetBaseDebugInfo_Parms
{
	TArray< struct FString > BaseDebugInfo; // CPF_OutParm
};

struct ACCController_execStripGirlDebug_Parms
{
	int GirlIndex;
};// FUNC_Exec

struct ACCController_execServerSetShowDebugInfo_Parms
{
	unsigned long bNewShowDebugInfo : 1;
};

struct ACCController_execShowDebugInfo_Parms
{
};// FUNC_Exec

struct ACCController_execdi_Parms
{
};// FUNC_Exec

struct ACCController_eventForceClientMessageSTControllerEx_Parms
{
	struct FString S;
	class AActor* SomeActor;
	unsigned long bOnlyToLocal : 1;
};// FUNC_Event

struct ACCController_eventForceClientMessageSTAllEx_Parms
{
	struct FString S;
};// FUNC_Event

struct ACCController_eventForceClientMessageSTEx_Parms
{
	struct FString S;
};// FUNC_Event

struct ACCController_execForceClientMessageSTAll_Parms
{
	struct FString S;
	class AActor* CalledFrom;
};

struct ACCController_execForceClientMessageST_Parms
{
	struct FString S;
	class AActor* CalledFrom;
};

struct ACCController_eventForceClientMessage_Parms
{
	struct FString S;
	struct FName Type;
	float MsgLifeTime;
};// FUNC_Event

struct ACCController_eventClientMessage_Parms
{
	struct FString S;
	struct FName Type;
	float MsgLifeTime;
};// FUNC_Event

struct ACCController_execTurnClientMessages_Parms
{
};// FUNC_Exec

struct ACCController_execTurnClientMessagesOff_Parms
{
};// FUNC_Exec

struct ACCController_execTurnClientMessagesOn_Parms
{
};// FUNC_Exec

struct ACCController_execSetVals_Parms
{
};

// (0x64C - 0x774)
class ACCController : public ACCBaseController
{
public:
	int                                                YakaNetworkID;                               // 0x064C (0x0004)
	unsigned long                                      bMovementLocked : 1;                         // 0x0650 (0x0004) [0x00000001]
	unsigned long                                      AllowClientMessages : 1;                     // 0x0650 (0x0004) [0x00000002]
	unsigned long                                      bBlockForChangeMat : 1;                      // 0x0650 (0x0004) [0x00000004]
	unsigned long                                      bShowDebugInfo : 1;                          // 0x0650 (0x0004) [0x00000008]
	unsigned long                                      VipProgramCameraAnimationEnabled : 1;        // 0x0650 (0x0004) [0x00000010]
	unsigned long                                      VipGirlNearByHead : 1;                       // 0x0650 (0x0004) [0x00000020]
	float                                              LastCameraTimeStamp;                         // 0x0654 (0x0004)
	class UClass*                                      MatineeCameraClass;                          // 0x0658 (0x0004)
	void*                                              EffectsManager;                              // 0x065C (0x0004)
	class AActor*                                      CalcViewActor;                               // 0x0660 (0x0004)
	struct FVector                                     CalcViewActorLocation;                       // 0x0664 (0x000C)
	struct FVector                                     CalcViewLocation;                            // 0x0670 (0x000C)
	struct FRotator                                    CalcViewRotation;                            // 0x067C (0x000C)
	void*                                              Announcer;                                   // 0x0688 (0x0004)
	unsigned char                                      bAim;                                        // 0x068C (0x0001)
	unsigned char                                      bSprint;                                     // 0x068D (0x0001)
	unsigned char                                      bWalk;                                       // 0x068E (0x0001)
	unsigned char                                      bCrouch;                                     // 0x068F (0x0001)
	unsigned char                                      bRolling;                                    // 0x0690 (0x0001)
	struct FName                                       ActiveAbilityName;                           // 0x0694 (0x0008)
	int                                                CamCheckCurrTicks;                           // 0x069C (0x0004)
	int                                                CamCheckNumOfTicks;                          // 0x06A0 (0x0004)
	float                                              CamCheckSelfCamDist;                         // 0x06A4 (0x0004)
	float                                              CamCheckOtherCamDist;                        // 0x06A8 (0x0004)
	struct FString                                     BuildNumber;                                 // 0x06AC (0x000C)
	float                                              aStrafe;                                     // 0x06B8 (0x0004)
	TArray< float >                                    aStrafeStack;                                // 0x06BC (0x000C)
	float                                              aBaseY;                                      // 0x06C8 (0x0004)
	TArray< struct FaBaseYStackData >                  aBaseYStack;                                 // 0x06CC (0x000C)
	void*                                              WeaponAttachmentPresetStore;                 // 0x06D8 (0x0004)
	void*                                              StaticGibManagerStore;                       // 0x06DC (0x0004)
	void*                                              AnimTreePool;                                // 0x06E0 (0x0004)
	struct FScriptDelegate                             SetGlobalVals;                               // 0x06E4 (0x000C)
	struct FScriptDelegate                             SetHPVals;                                   // 0x06F0 (0x000C)
	struct FScriptDelegate                             SetStmVals;                                  // 0x06FC (0x000C)
	struct FScriptDelegate                             SetSpdVals;                                  // 0x0708 (0x000C)
	struct FScriptDelegate                             SetSttVals;                                  // 0x0714 (0x000C)
	struct FScriptDelegate                             SetWpnVals;                                  // 0x0720 (0x000C)
	struct FScriptDelegate                             SetBsbVals;                                  // 0x072C (0x000C)
	struct FScriptDelegate                             SetWdtVals;                                  // 0x0738 (0x000C)
	struct FScriptDelegate                             SetAbeVals;                                  // 0x0744 (0x000C)
	struct FScriptDelegate                             SetCamRecVals;                               // 0x0750 (0x000C)
	struct FScriptDelegate                             SetDamModifVals;                             // 0x075C (0x000C)
	struct FScriptDelegate                             __SetVals__Delegate;                         // 0x0768 (0x000C)

	// VIPSittingLogic
	// SittingLogic

private:
	static UClass* ClassPointer;

public:
	static UClass* StaticClass ()
	{
		if ( !ClassPointer )
			ClassPointer = UObject::FindClass( "Class CrimeCraft.CCController" );

		return ClassPointer;
	};

public:
	void TriggerAllSequenceEvents ( class UClass* SeqEventClass )
	{
		static UFunction* pfnTriggerAllSequenceEvents = NULL;

		if ( !pfnTriggerAllSequenceEvents )
			pfnTriggerAllSequenceEvents = UObject::FindObject< UFunction >( "Function CrimeCraft.CCController.TriggerAllSequenceEvents" );

		ACCController_execTriggerAllSequenceEvents_Parms TriggerAllSequenceEvents_Parms;
		TriggerAllSequenceEvents_Parms.SeqEventClass = SeqEventClass;

		this->ProcessEvent( pfnTriggerAllSequenceEvents, &TriggerAllSequenceEvents_Parms, NULL );
	};

	void VipProgramDoFading ( float Dest, float Time )
	{
		static UFunction* pfnVipProgramDoFading = NULL;

		if ( !pfnVipProgramDoFading )
