/////////////////////////////////////////////////////////////////////////////
// Unreal Engine MiniSDK Generator by uNrEaL
// Game: CrimeCraft
// File: ACCEntryController.h
// Date: 06/16/2011 @ 05:19:41.494
/////////////////////////////////////////////////////////////////////////////

#ifdef _MSC_VER
#pragma pack( push, 4 )
#endif

enum EEntryLoginStage
{
	ELS_Login = 0,
	ELS_RealmList = 1,
	ELS_CharacterList = 2,
	ELS_CharacterCreation = 3,
	ELS_CharacterCustomization = 4,
	ELS_WaitingRealmList = 5,
	ELS_WaitingCharacterList = 6,
	ELS_MAX = 7
};

struct ACCEntryController_execOnRealmSelected_Parms
{
};

struct ACCEntryController_execSetLMenuMode_Parms
{
	int Mode;
};

struct ACCEntryController_execHideLMenu_Parms
{
	unsigned long bHide : 1;
};

struct ACCEntryController_execGetLoginMenuMode_Parms
{
	unsigned char stg;
	int ReturnValue; // CPF_ReturnParm
};

struct ACCEntryController_execSetLoginStage_Parms
{
	unsigned char stg;
};

struct ACCEntryController_execScheduleStage_Parms
{
	unsigned char stg;
};

struct ACCEntryController_execUpdateSceneCaptureCameraPosition_Parms
{
};

struct ACCEntryController_execCreateCharacter_Parms
{
	struct FString CharName;
	unsigned char CharClass;
	struct FCharacterVisualDescription Appearance;
};

struct ACCEntryController_execDeleteCharacter_Parms
{
	int InCharacterId;
};

struct ACCEntryController_execDeleteCharacterByName_Parms
{
	struct FString CharacterName;
};

struct ACCEntryController_execOnConnectionRequested_Parms
{
};

struct ACCEntryController_execSelectCharacter_Parms
{
	int InCharacterId;
};

struct ACCEntryController_execSelectCharacterByName_Parms
{
	struct FString CharacterName;
};

struct ACCEntryController_execOnLoginRequested_Parms
{
};

struct ACCEntryController_execLoginToServer_Parms
{
	struct FString LoginName;
	struct FString Password;
	struct FString InServerAddressOverride;
	int InPortOverride;
};

struct ACCEntryController_eventPlayerTick_Parms
{
	float DeltaTime;
};// FUNC_Event

struct ACCEntryController_execTV_SwitchAnimation_Parms
{
	void* TV_Material;
	struct FName DelegateName;
};

struct ACCEntryController_execSetBillboardSequence_Parms
{
	void* MaterialInst;
};

struct ACCEntryController_execGoTo_FromClassSelectToStart_Parms
{
};

struct ACCEntryController_execGoTo_FromStartToClassSelect_Parms
{
};

struct ACCEntryController_execCloseTimeoutMenu_Parms
{
};

struct ACCEntryController_execOpenTimeoutMenu_Parms
{
	struct FString Title;
};

struct ACCEntryController_execEntryMessageBoxConfirm_Parms
{
	unsigned char MsgResult;
};

struct ACCEntryController_execCloseCharacterCustomizationMenu_Parms
{
};

struct ACCEntryController_execOpenCharacterCustomizationMenu_Parms
{
};

struct ACCEntryController_execCloseCharacterCreationMenu_Parms
{
};

struct ACCEntryController_execOpenCharacterCreationMenu_Special_Parms
{
};

struct ACCEntryController_execOpenNewCharacterCreationMenu_Animated_Parms
{
};

struct ACCEntryController_execOpenCharacterCreationMenu_Animated_Parms
{
};

struct ACCEntryController_execOpenCharacterCreationMenu_Parms
{
};

struct ACCEntryController_execCloseCharacterListMenu_Animated_Parms
{
};

struct ACCEntryController_execCloseCharacterListMenu_Parms
{
};

struct ACCEntryController_execOpenCharacterListMenu_Animated_Parms
{
};

struct ACCEntryController_execonLoginMenuCreated_Parms
{
	void* loginM;
};

struct ACCEntryController_execOpenCharacterListMenu_Parms
{
};

struct ACCEntryController_execCloseESRBMenu_Parms
{
};

struct ACCEntryController_execOpenESRBMenu_Parms
{
};

struct ACCEntryController_execOpenLoginMenu_Parms
{
};

struct ACCEntryController_execEnsureLoginMenu_Parms
{
};

struct ACCEntryController_execLoginToRealmSelector_Parms
{
	struct FString strAccountName;
	struct FString strAccountPassword;
};

struct ACCEntryController_execDisconnectFromGameServer_Parms
{
};

struct ACCEntryController_execBackFromCharacterCustomizationMenu_Parms
{
};

struct ACCEntryController_execBackFromCharacterCreationMenu_Parms
{
};

struct ACCEntryController_execBackFromCharacterListMenu_Parms
{
};

struct ACCEntryController_execBackToLoginMenu_Parms
{
};

struct ACCEntryController_execAbortTimeOut_Parms
{
};

struct ACCEntryController_execonTimeOut_Parms
{
};

struct ACCEntryController_eventOnCharacterSelectionError_Parms
{
};// FUNC_Event

struct ACCEntryController_eventOnCharacterSelectionConfirm_Parms
{
};// FUNC_Event

struct ACCEntryController_eventOnIncorrectVersion_Parms
{
};// FUNC_Event

struct ACCEntryController_eventOnAlreadyInGame_Parms
{
};// FUNC_Event

struct ACCEntryController_eventOnLoginRefusedUnknownReason_Parms
{
};// FUNC_Event

struct ACCEntryController_eventOnLoginRefusedAccessDenied_Parms
{
};// FUNC_Event

struct ACCEntryController_eventOnLoginRefusedIncorrectEMail_Parms
{
};// FUNC_Event

struct ACCEntryController_eventOnLoginRefusedGAServiceNotAvailable_Parms
{
};// FUNC_Event

struct ACCEntryController_eventOnLoginRefusedIncorrectPassword_Parms
{
};// FUNC_Event

struct ACCEntryController_eventOnNoFreeConnections_Parms
{
};// FUNC_Event

struct ACCEntryController_execOnLoginRefusedReason_Parms
{
	struct FString ErrorMessage;
};

struct ACCEntryController_eventOnConnectionErrorResponse_Parms
{
	int Result;
	int pSwitch;
};// FUNC_Event

struct ACCEntryController_eventOnRealmListReceived_Parms
{
};// FUNC_Event

struct ACCEntryController_eventOnCharacterListReceived_Parms
{
};// FUNC_Event

struct ACCEntryController_execPlayAmbientSound_Parms
{
};

struct ACCEntryController_execStopAmbientSound_Parms
{
};

struct ACCEntryController_eventPostBeginPlay_Parms
{
};// FUNC_Event

struct ACCEntryController_eventInitInputSystem_Parms
{
};// FUNC_Event

struct ACCEntryController_execValidateCharacterName_Parms
{
	struct FString InCharacterName;
	struct FString OutValidatedName; // CPF_OutParm
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Native

struct ACCEntryController_execToggleCharacterCreationMenu_Parms
{
};// FUNC_Exec

// (0x64C - 0x6DC)
class ACCEntryController : public ACCBaseController
{
public:
	void*                                              LoginMenuTemplate;                           // 0x064C (0x0004)
	void*                                              LoginMenu;                                   // 0x0650 (0x0004)
	void*                                              ConnectionMenuTemplate;                      // 0x0654 (0x0004)
	void*                                              ConnectionMenu;                              // 0x0658 (0x0004)
	void*                                              CharacterListMenuTemplate;                   // 0x065C (0x0004)
	void*                                              CharacterListMenu;                           // 0x0660 (0x0004)
	void*                                              NewCharacterCreationMenuTemplate;            // 0x0664 (0x0004)
	void*                                              CharacterCreationMenuTemplate;               // 0x0668 (0x0004)
	void*                                              CharacterCreationMenu;                       // 0x066C (0x0004)
	void*                                              CharacterCustomizationMenuTemplate;          // 0x0670 (0x0004)
	void*                                              CharacterCustomizationMenu;                  // 0x0674 (0x0004)
	void*                                              RealmChooserTemplate;                        // 0x0678 (0x0004)
	void*                                              RealmChooserMenu;                            // 0x067C (0x0004)
	void*                                              BillboardMesh;                               // 0x0680 (0x0004)
	void*                                              MainCamera;                                  // 0x0684 (0x0004)
	void*                                              PositionPreset0;                             // 0x0688 (0x0004)
	void*                                              PositionPreset1;                             // 0x068C (0x0004)
	void*                                              CaptureActor;                                // 0x0690 (0x0004)
	void*                                              AmbientActor;                                // 0x0694 (0x0004)
	void*                                              TV_Splash_Seq;                               // 0x0698 (0x0004)
	void*                                              TV_Connection_Seq;                           // 0x069C (0x0004)
	void*                                              TV_CharacterCreation_Seq;                    // 0x06A0 (0x0004)
	void*                                              TV_CharacterList_Seq;                        // 0x06A4 (0x0004)
	void*                                              TV_Interference;                             // 0x06A8 (0x0004)
	void*                                              TV_Target_Material;                          // 0x06AC (0x0004)
	struct FName                                       TV_Target_Delegate;                          // 0x06B0 (0x0008)
	float                                              TV_DeltaAnim;                                // 0x06B8 (0x0004)
	float                                              TV_AnimDirection;                            // 0x06BC (0x0004)
	void*                                              ESRBMenuTemplate;                            // 0x06C0 (0x0004)
	void*                                              ESRBMenu;                                    // 0x06C4 (0x0004)
	unsigned char                                      CurrentStage;                                // 0x06C8 (0x0001)
	TArray< unsigned char >                            SheduledStages;                              // 0x06CC (0x000C)
	unsigned long                                      bUseNewCharacterCreationMenu : 1;            // 0x06D8 (0x0004) [0x00000001]

private:
	static UClass* ClassPointer;

public:
	static UClass* StaticClass ()
	{
		if ( !ClassPointer )
			ClassPointer = UObject::FindClass( "Class CrimeCraft.CCEntryController" );

		return ClassPointer;
	};

public:
	void OnRealmSelected ()
	{
		static UFunction* pfnOnRealmSelected = NULL;

		if ( !pfnOnRealmSelected )
			pfnOnRealmSelected = UObject::FindObject< UFunction >( "Function CrimeCraft.CCEntryController.OnRealmSelected" );

		ACCEntryController_execOnRealmSelected_Parms OnRealmSelected_Parms;

		this->ProcessEvent( pfnOnRealmSelected, &OnRealmSelected_Parms, NULL );
	};

	void SetLMenuMode ( int Mode )
	{
		static UFunction* pfnSetLMenuMode = NULL;

		if ( !pfnSetLMenuMode )
			pfnSetLMenuMode = UObject::FindObject< UFunction >( "Function CrimeCraft.CCEntryController.SetLMenuMode" );

		ACCEntryController_execSetLMenuMode_Parms SetLMenuMode_Parms;
		SetLMenuMode_Parms.Mode = Mode;

