/////////////////////////////////////////////////////////////////////////////
// Unreal Engine MiniSDK Generator by uNrEaL
// Game: CrimeCraft
// File: ACCInstancePawn.h
// Date: 06/16/2011 @ 05:19:40.109
/////////////////////////////////////////////////////////////////////////////

#ifdef _MSC_VER
#pragma pack( push, 4 )
#endif

#define Const_PawnBurning_MaxBones                 100
#define Const_MaxCoverGuessDist                    256.f
#define Const_MAX_PAWNLASTHITINFO_RELEVANCY_TIME   2.0f
#define Const_MAX_DEBUG_BONES                      128

enum PlacingItemInfo_State
{
	PlacingItemInfo_State_BeginSearching = 0,
	PlacingItemInfo_State_EndSearching = 1,
	PlacingItemInfo_State_BeginPlacing = 2,
	PlacingItemInfo_State_EndPlacing = 3,
	PlacingItemInfo_State_MAX = 4
};

enum EBodyStance
{
	BS_FullBody = 0,
	BS_Head = 1,
	BS_Std_Up = 2,
	BS_Std_Upper_Harsh = 3,
	BS_Std_Upper_NoAim = 4,
	BS_Std_Idle_Lower = 5,
	BS_Std_Idle_Upper = 6,
	BS_Std_Trans_Upper = 7,
	BS_Std_Walk_Upper = 8,
	BS_Std_Run_Upper = 9,
	BS_CovStdIdle_Up = 10,
	BS_CovStdBlind_Up = 11,
	BS_CovStdLean_Up = 12,
	BS_CovStd_360_Upper = 13,
	BS_CovMidIdle_Up = 14,
	BS_CovMidBlindSd_Up = 15,
	BS_CovMidBlindUp_Up = 16,
	BS_CovMidLean_Up = 17,
	BS_CovMid_360_Upper = 18,
	BS_MAX = 19
};

enum EDeathState
{
	EDS_Alive = 0,
	EDS_FeigningDeath = 1,
	EDS_FakeDeath = 2,
	EDS_Dying = 3,
	EDS_MAX = 4
};

enum ETakeHitLocation
{
	THL_TorsoForward = 0,
	THL_TorsoBackward = 1,
	THL_HeadForward = 2,
	THL_HeadBackward = 3,
	THL_Leagth = 4,
	THL_MAX = 5
};

struct ACCInstancePawn_eventGetDemoPlayCameraLocationAndRotationAndUpdate_Parms
{
	struct FVector out_CamLoc; // CPF_OutParm
	struct FRotator out_CamRot; // CPF_OutParm
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Event

struct ACCInstancePawn_execPlayerChangedTeam_Parms
{
};

struct ACCInstancePawn_execSetInvulnerabilityTime_Parms
{
	float NewInvulnerability;
};

struct ACCInstancePawn_execchange_physics_weight_Parms
{
	float W;
};// FUNC_Exec

struct ACCInstancePawn_execTestGibs_Parms
{
	struct FString GibPresetName;
	float Momentum;
};// FUNC_Exec

struct ACCInstancePawn_execCustomTestGibs_Parms
{
	float Momentum;
};// FUNC_Exec

struct ACCInstancePawn_execSpawnGibsForEntireBody_Parms
{
	void* GibPreset;
	struct FVector ExplosionMomentum;
	float GibsTearOffMomentum;
	float GibsTearOffMinPitch;
};

struct ACCInstancePawn_execSpawnShotOffGib_Parms
{
	void* GibPreset;
	struct FVector ExplosionMomentum;
};

struct ACCInstancePawn_execFindBestShotOffGibPreset_Parms
{
	class AController* InstigatedBy;
	struct FVector HitLocation;
	class UClass* DamageType;
	struct FTraceHitInfo HitInfo;
	void* ReturnValue; // CPF_ReturnParm
};

struct ACCInstancePawn_execFindOptimalExtremityShotOffGibPreset_Parms
{
	class AController* InstigatedBy;
	struct FVector HitLocation;
	void* ReturnValue; // CPF_ReturnParm
};

struct ACCInstancePawn_execGetExtremityShotOffBaseBones_Parms
{
	TArray< struct FName > BoneNames; // CPF_OutParm
};

struct ACCInstancePawn_execGetExtremityShotOffBaseGibClasses_Parms
{
	TArray< class UClass* > GibClasses; // CPF_OutParm
};

struct ACCInstancePawn_execGetGibPresetForGibClass_Parms
{
	class UClass* GibClass;
	void* ReturnValue; // CPF_ReturnParm
};

struct ACCInstancePawn_execFindBestExplosionGibPreset_Parms
{
	void* ReturnValue; // CPF_ReturnParm
};

struct ACCInstancePawn_execServerPerformGibsSpawningLogic_Parms
{
	unsigned long bForceShotOffGibs : 1;
	int Damage;
	class AController* InstigatedBy;
	struct FVector HitLocation;
	struct FVector Momentum;
	class UClass* DamageType;
	struct FTraceHitInfo HitInfo;
	class AActor* DamageCauser;
	struct FAdditionalHitInfo AddInfo;
};

struct ACCInstancePawn_execInitializeGibManager_Parms
{
};

struct ACCInstancePawn_eventOnAnimEnd_Parms
{
	void* SeqNode;
	float PlayedTime;
	float ExcessTime;
};// FUNC_Event

struct ACCInstancePawn_execSetLocationInterpolationSpeed_Parms
{
	float V;
};// FUNC_Exec

struct ACCInstancePawn_execPlaySound_AbilityReady_Parms
{
};

struct ACCInstancePawn_execWeaponStoppedFiring_Parms
{
	unsigned long bViaReplication : 1;
};

struct ACCInstancePawn_execWeaponFired_Parms
{
	unsigned long bViaReplication : 1;
	struct FVector StartTraceLocation;
	struct FVector EndTraceLocation;
	struct FAdditionalHitInfo AddInfo;
};

struct ACCInstancePawn_execSniperVision_Parms
{
};

struct ACCInstancePawn_execSetSniperVision_Parms
{
	unsigned long S : 1;
};

struct ACCInstancePawn_eventLanded_Parms
{
	struct FVector HitNormal;
	class AActor* FloorActor;
};// FUNC_Event

struct ACCInstancePawn_execTestGetStartAndFinishDelay_Parms
{
	float StartDelay; // CPF_OutParm
	float FinishDelay; // CPF_OutParm
};

struct ACCInstancePawn_execAdditionalAnimationFinished_Parms
{
};

struct ACCInstancePawn_execAdditionalAnimationStarted_Parms
{
};

struct ACCInstancePawn_execPlayWeaponVisualGetting_Parms
{
};

struct ACCInstancePawn_execPlayWeaponVisualHiding_Parms
{
};

struct ACCInstancePawn_execSetMuzzleFlashAbilityName_Parms
{
	struct FName AbilityName;
};

struct ACCInstancePawn_execGetMuzzleFlashAbilityName_Parms
{
	struct FName ReturnValue; // CPF_ReturnParm
};

struct ACCInstancePawn_execChatMessage_Parms
{
	struct FString MsgText;
};// FUNC_Native

struct ACCInstancePawn_execGetClientActionManager_Parms
{
	void* ReturnValue; // CPF_ReturnParm
};

struct ACCInstancePawn_execGetServerActionManager_Parms
{
	void* ReturnValue; // CPF_ReturnParm
};

struct ACCInstancePawn_execGetMainActionManager_Parms
{
	void* ReturnValue; // CPF_ReturnParm
};

struct ACCInstancePawn_execAddDamageCauser_Parms
{
	class ACCPlayerReplicationInfo* DamagerPRI;
	int Damage;
};

struct ACCInstancePawn_execFindOldestDamageCauser_Parms
{
	int ReturnValue; // CPF_ReturnParm
};

struct ACCInstancePawn_execFindDamageCauserByPRI_Parms
{
	class ACCPlayerReplicationInfo* DamagerPRI;
	int ReturnValue; // CPF_ReturnParm
};

struct ACCInstancePawn_execClearDamageCausersList_Parms
{
};

struct ACCInstancePawn_execUpdateLastStartFireCounter_Parms
{
};

struct ACCInstancePawn_execUpdateLastFireTime_Parms
{
};

struct ACCInstancePawn_execServerSetShowServerSkeleton_Parms
{
	unsigned long bShow : 1;
};

struct ACCInstancePawn_execShowServerSkeleton_Parms
{
};// FUNC_Exec

struct ACCInstancePawn_execGetIsValidTHAnimBone_Parms
{
	struct FName BoneName;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Native

struct ACCInstancePawn_execDrawDebugServerSkeletonData_Parms
{
};// FUNC_Native

struct ACCInstancePawn_execUpdateDebugServerSkeletonData_Parms
{
};// FUNC_Native

struct ACCInstancePawn_execGetIsFiringToCrosshair_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCInstancePawn_eventGetWeaponTargetPawn_Parms
{
	class ACCInstancePawn* ReturnValue; // CPF_ReturnParm
};// FUNC_Event

struct ACCInstancePawn_execdebugForceUpdateCarrySlots_Parms
{
};// FUNC_Exec

struct ACCInstancePawn_execServerSpawnTurret_Parms
{
};

struct ACCInstancePawn_execSpawnTurret_Parms
{
};// FUNC_Exec

struct ACCInstancePawn_execHighlightCrosshair_Parms
{
	class ACCPawn* Pawn;
};

struct ACCInstancePawn_execSetHudWeapon_Parms
{
	unsigned char Slot;
};

struct ACCInstancePawn_execFillHudWeapons_Parms
{
	unsigned char slot0;
	unsigned char Slot1;
	unsigned char Slot2;
};

struct ACCInstancePawn_execDied_Parms
{
	class AController* Killer;
	class UClass* DamageType;
	struct FVector HitLocation;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCInstancePawn_execBroadcastCombatMessage_Parms
{
	class ACCPlayerReplicationInfo* PRIKilled;
	class ACCPlayerReplicationInfo* PRIKiller;
	unsigned char DamageType;
	unsigned char WeaponSlot;
	unsigned long bHeadShot : 1;
	unsigned long bMine : 1;
	struct FAdditionalParam OptionalInitParam; // CPF_OutParm
};

struct ACCInstancePawn_execPlayDeathSound_Parms
{
	struct FVector HitLocation;
	struct FAdditionalHitInfo AddInfo;
	struct FTakeHitInfo DeathImpulseInfo;
	struct FAdditionalParam OptionalInitParam;
};

struct ACCInstancePawn_eventHealthBelowZero_Parms
{
	int Damage;
	class AController* InstigatedBy;
	struct FVector HitLocation;
	struct FVector Momentum;
	class UClass* DamageType;
	struct FTraceHitInfo HitInfo;
	class AActor* DamageCauser;
	struct FAdditionalHitInfo AddInfo;
};// FUNC_Event

struct ACCInstancePawn_execNotifyDeathHUD_Parms
{
	class AActor* LastDamageCauser;
};

struct ACCInstancePawn_execGetControllerFromDamageCauser_Parms
{
	class AActor* LastDamageCauser;
	class ACCInstanceController* ReturnValue; // CPF_ReturnParm
};

struct ACCInstancePawn_execFillKillerInfoFrom_Parms
{
	class ACCInstanceController* C;
	struct FKillerInfo Info; // CPF_OutParm
	float DamageDone;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCInstancePawn_execdual_deathbug_print_debug_controller_info_Parms
{
	class AController* C;
	struct FString Prefix;
};

struct ACCInstancePawn_execAddAssistScore_Parms
{
	class ACCPlayerReplicationInfo* KillerPRI;
};

struct ACCInstancePawn_execGetShouldPlayDeathAnimation_Parms
{
	int Damage;
	class AController* InstigatedBy;
	struct FVector HitLocation;
	struct FVector Momentum;
	class UClass* DamageType;
	struct FTraceHitInfo HitInfo;
	class AActor* DamageCauser;
	struct FAdditionalHitInfo AddInfo;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCInstancePawn_execFindWeaponByDamageType_Parms
{
	class UClass* DamageType;
	unsigned char ReturnValue; // CPF_ReturnParm
};

struct ACCInstancePawn_execCalcWeaponSlot_Parms
{
	class UClass* DamageType;
	unsigned char ReturnValue; // CPF_ReturnParm
};

struct ACCInstancePawn_execdebugUpdateWeaponAttaches_Parms
{
};// FUNC_Exec

struct ACCInstancePawn_execSetAvatarMaterial_Parms
{
	class UMaterialInterface* Material;
};

struct ACCInstancePawn_execinvisibility_Parms
{
};

struct ACCInstancePawn_execVisibility_Parms
{
};

struct ACCInstancePawn_execUpdateVisibility_Parms
{
};

struct ACCInstancePawn_execSetVisibilityDetected_Parms
{
	unsigned long Value : 1;
};

struct ACCInstancePawn_execDestroyed_Parms
{
};

struct ACCInstancePawn_execClearAnimNodes_Parms
{
};

struct ACCInstancePawn_execCacheAnimNodes_Parms
{
};

struct ACCInstancePawn_execBodyStanceAnimEndNotification_Parms
{
	void* SeqNode;
	float PlayedTime;
	float ExcessTime;
};

struct ACCInstancePawn_execSetBodyStanceAnimEndNotification_Parms
{
	struct FBodyStance Stance;
	unsigned long bNewStatus : 1;
};// FUNC_Final

struct ACCInstancePawn_execBS_AddToSynchGroup_Parms
{
	struct FBodyStance Stance;
	struct FName GroupName;
};// FUNC_Final

struct ACCInstancePawn_execBS_SetMirrorOptions_Parms
{
	struct FBodyStance Stance;
	unsigned long bTransitionToMirrored : 1;
	unsigned long bBeginTransition : 1;
	unsigned long bMirrorAnimation : 1;
};// FUNC_Final

struct ACCInstancePawn_execSetBodyStanceRootBoneAxisOption_Parms
{
	struct FBodyStance Stance;
	unsigned char AxisX;
	unsigned char AxisY;
	unsigned char AxisZ;
};// FUNC_Final

struct ACCInstancePawn_execScaleBodyStancePlayRate_Parms
{
	struct FBodyStance Stance;
	float RateScale;
};// FUNC_Final

struct ACCInstancePawn_execBS_AccelerateBlend_Parms
{
	struct FBodyStance Stance;
	float BlendAmount;
};// FUNC_Final

struct ACCInstancePawn_execBS_SetPlayRate_Parms
{
	struct FBodyStance Stance;
	float NewRate;
};// FUNC_Final

struct ACCInstancePawn_execBS_GetPlayRate_Parms
{
	struct FBodyStance Stance;
	float ReturnValue; // CPF_ReturnParm
};// FUNC_Final

struct ACCInstancePawn_execBS_GetTimeLeft_Parms
{
	struct FBodyStance Stance;
	float ReturnValue; // CPF_ReturnParm
};// FUNC_Final

struct ACCInstancePawn_execBS_SetPosition_Parms
{
	struct FBodyStance Stance;
	float Position;
};// FUNC_Final

struct ACCInstancePawn_execSetBodyStance_Parms
{
	struct FBodyStance Stance;
};// FUNC_Final

struct ACCInstancePawn_execStopAllBodyStances_Parms
{
	float BlendOutTime;
};// FUNC_Final

struct ACCInstancePawn_execStopBodyStance_Parms
{
	struct FBodyStance Stance;
	float BlendOutTime;
};// FUNC_Final

struct ACCInstancePawn_execIsPlayingBodyStance_Parms
{
	struct FBodyStance Stance;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final

struct ACCInstancePawn_execPlayBodyStanceByDuration_Parms
{
	struct FBodyStance Stance;
	float Duration;
	float BlendInTime;
	float BlendOutTime;
	unsigned long bLooping : 1;
	unsigned long bOverride : 1;
};// FUNC_Final

struct ACCInstancePawn_execPlayBodyStance_Parms
{
	struct FBodyStance Stance;
	float Rate;
	float BlendInTime;
	float BlendOutTime;
	unsigned long bLooping : 1;
	unsigned long bOverride : 1;
	unsigned long bKeepRBASettings : 1;
	float ReturnValue; // CPF_ReturnParm
};// FUNC_Final

struct ACCInstancePawn_execSetFireSound_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCInstancePawn_execPlayActualHitEffect_Parms
{
	unsigned char EffectType;
	struct FTakeHitInfo HitInfo;
	unsigned char HitLocationType;
};

struct ACCInstancePawn_execCheckIsHit_Parms
{
	struct FVector HitLocation;
	struct FVector StartPoint;
	struct FVector EndPoint;
	unsigned long DrawDebugHit : 1;
	struct FName ReturnValue; // CPF_ReturnParm
};

struct ACCInstancePawn_execSpawnDecals_Parms
{
	struct FDecalParams DParams;
	class AActor* HitActor;
	struct FVector HitLocation;
	struct FVector HitNormal;
	struct FTraceHitInfo HitInfo;
	unsigned long bProjectOnTerrain : 1;
	unsigned long bProjectOnSkeletalMeshes : 1;
};

struct ACCInstancePawn_execRagdollDueAnimationEnterTimer_Parms
{
};

struct ACCInstancePawn_execCheckDeathAnimationCollision_Parms
{
};

struct ACCInstancePawn_execCalculateRagdollEnterTimerFromEndPerc_Parms
{
	struct FTakeHitInfo HitInfo;
	float ReturnValue; // CPF_ReturnParm
};

struct ACCInstancePawn_execCalculateRagdollEnterTimerTime_Parms
{
	float DeathAnimationLength;
	float Perc;
	float ReturnValue; // CPF_ReturnParm
};

struct ACCInstancePawn_execCalculateDeathAnimationToRagdollBlendTime_Parms
{
	float DeathAnimationLength;
	float RagdollEnterTimerTime;
	float ReturnValue; // CPF_ReturnParm
};

struct ACCInstancePawn_execClearDeathAnimation_Parms
{
};

struct ACCInstancePawn_execDeathAnimationPlayed_Parms
{
};

struct ACCInstancePawn_execPlayDeathAnimation_Parms
{
	struct FTakeHitInfo THInfo;
};

struct ACCInstancePawn_execProcessDeathAnimationInfoStructReplicated_Parms
{
};

struct ACCInstancePawn_execServerPlayDeathAnimation_Parms
{
	struct FTakeHitInfo ImpulseInfo;
};

struct ACCInstancePawn_execServerPlayDeathAnimationViaRpc_Parms
{
	struct FTakeHitInfo ImpulseInfo;
};

struct ACCInstancePawn_execTestPlayTakeHitAnimation_Parms
{
	struct FName BoneName;
	float DirX;
	float DirY;
	float DirZ;
	unsigned long bFromGrenade : 1;
};// FUNC_Exec

struct ACCInstancePawn_execLeaveRDTimeOut_Parms
{
};

struct ACCInstancePawn_execTestPlayDeathAnimation_Parms
{
	struct FName BoneName;
	float DirX;
	float DirY;
	float DirZ;
};// FUNC_Exec

struct ACCInstancePawn_execClearHitAnimation_Parms
{
};

struct ACCInstancePawn_execHitAnimationPlayed_Parms
{
};

struct ACCInstancePawn_execPlayTakeHitAnimation_Parms
{
	struct FTakeHitInfo HitInfo;
};

struct ACCInstancePawn_execGetAllTakeHitNodes_Parms
{
	TArray< void* > Nodes; // CPF_OutParm
};

struct ACCInstancePawn_execSelectActualTakeHitNode_Parms
{
	void* ReturnValue; // CPF_ReturnParm
};

struct ACCInstancePawn_execPlayReplicatedOnlyTakeHitEffects_Parms
{
	struct FTakeHitInfo HitInfo;
};

struct ACCInstancePawn_execPlayTakeHitEffects_Parms
{
	struct FTakeHitInfo HitInfo;
};

struct ACCInstancePawn_execPlayHitEffectsLocally_Parms
{
	float Damage;
	class ACCInstancePawn* shooter;
	struct FVector HitLocation;
	class UClass* DamageType;
	struct FVector Momentum;
	struct FTraceHitInfo HitInfo;
	struct FAdditionalHitInfo AddInfo;
};

struct ACCInstancePawn_execGetReplicatedHitEffectsShouldBePlayed_Parms
{
	struct FTakeHitInfo HitInfo; // CPF_OutParm
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCInstancePawn_eventIsLastTakeHitInfoRelevant_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Event

struct ACCInstancePawn_execLastTakeHitInfoStructReplicated_Parms
{
};

struct ACCInstancePawn_execSetLastHitInfo_Parms
{
	int Damage;
	struct FVector HitLocation;
	struct FVector Momentum;
	class UClass* DamageType;
	struct FName HitBone;
	class AController* shooter;
	struct FAdditionalHitInfo AddInfo;
};

struct ACCInstancePawn_execPlayHit_Parms
{
	float Damage;
	class AController* InstigatedBy;
	struct FVector HitLocation;
	class UClass* DamageType;
	struct FVector Momentum;
	struct FTraceHitInfo HitInfo;
	struct FAdditionalHitInfo AddInfo;
};

struct ACCInstancePawn_execFindCharacterAttachmentBone_Parms
{
	class UActorComponent* Comp;
	struct FName ReturnValue; // CPF_ReturnParm
};

struct ACCInstancePawn_execDetermineHitLocationType_Parms
{
	struct FTakeHitInfo HitInfo;
	unsigned char ReturnValue; // CPF_ReturnParm
};

struct ACCInstancePawn_execIsBlindFiring_Parms
{
	unsigned char PawnCA;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final

struct ACCInstancePawn_execSetCoverAction_Parms
{
	unsigned char NewCoverAction;
};// FUNC_Final

struct ACCInstancePawn_execFakeEquipItems_Parms
{
};

struct ACCInstancePawn_execFakeEquipItemsClient_Parms
{
	class ACCInstancePawn* Pawn;
};

struct ACCInstancePawn_execDoFakeEquipItems_Parms
{
};

struct ACCInstancePawn_execPlayExitCover_Parms
{
};// FUNC_Final

struct ACCInstancePawn_execPlayEnterCover_Parms
{
};

struct ACCInstancePawn_execSetCoverType_Parms
{
	unsigned char NewCoverType;
};// FUNC_Final

struct ACCInstancePawn_eventOnMirrorBlendOutNotify_Parms
{
};// FUNC_Event

struct ACCInstancePawn_eventOnMirroredNotify_Parms
{
};// FUNC_Event

struct ACCInstancePawn_eventSetMirroredSide_Parms
{
	unsigned long bDesiredMirrored : 1;
};// FUNC_Final FUNC_Event

struct ACCInstancePawn_execNotifyPlayerReplicationInfoReplicated_Parms
{
};// FUNC_Exec

struct ACCInstancePawn_execPlayDying_Parms
{
	class UClass* DamageType;
	struct FVector HitLoc;
};

struct ACCInstancePawn_execGetMaxHealth_Parms
{
	float ReturnValue; // CPF_ReturnParm
};

struct ACCInstancePawn_execGetHealth_Parms
{
	float ReturnValue; // CPF_ReturnParm
};

struct ACCInstancePawn_execForceDyingDestroy_Parms
{
};

struct ACCInstancePawn_execTimeForceDyingDestroy_Parms
{
	float Time;
};

struct ACCInstancePawn_execEnableBulletTwists_Parms
{
	unsigned long Value : 1;
	float DamageScale;
};

struct ACCInstancePawn_execProcessRigidBodyCollision_Parms
{
	class UPrimitiveComponent* HitComponent;
	class UPrimitiveComponent* OtherComponent;
	struct FCollisionImpactData RigidCollisionData; // CPF_OutParm
	int ContactIndex;
};

struct ACCInstancePawn_eventRigidBodyCollision_Parms
{
	class UPrimitiveComponent* HitComponent;
	class UPrimitiveComponent* OtherComponent;
	struct FCollisionImpactData RigidCollisionData; // CPF_OutParm
	int ContactIndex;
};// FUNC_Event

struct ACCInstancePawn_execDoFatality_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCInstancePawn_execCompleteRessurection_Parms
{
};

struct ACCInstancePawn_execGetRessurectionParameters_Parms
{
	struct FVector RessurectionLocation; // CPF_OutParm
};

struct ACCInstancePawn_execDoRessurect_Parms
{
	struct FVector RessurectionLocation;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCInstancePawn_execProcessCurrDeathStateReplicated_Parms
{
};

struct ACCInstancePawn_execCallSuperHealthBelowZero_Parms
{
};

struct ACCInstancePawn_execPrintOutsideWorldBoundsDisabledInfo_Parms
{
};

struct ACCInstancePawn_execPawnServerNotifyTargetDamaged_Parms
{
};

struct ACCInstancePawn_execNotifyTakeDamage_Parms
{
	int Damage;
	class ACCPawn* Attacker;
	class UClass* DamageType;
	class AActor* DamageCauser;
};

struct ACCInstancePawn_execHealDamage_Parms
{
	int Amount;
	class AController* Healer;
	class UClass* DamageType;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCInstancePawn_execAddVelocity_Parms
{
	struct FVector NewVelocity;
	struct FVector HitLocation;
	class UClass* DamageType;
	struct FTraceHitInfo HitInfo;
};

struct ACCInstancePawn_execClientTakeFlashDamage_Parms
{
	float BlindPower;
	float BlindTime;
};

struct ACCInstancePawn_execTakeFlashDamage_Parms
{
	float BlindPower;
	float BlindTime;
};

struct ACCInstancePawn_execTest_TH_SMS_Parms
{
	float X;
	float Y;
	float Z;
};// FUNC_Exec

struct ACCInstancePawn_execDoAddHitSpeedModifierEntry_Parms
{
	struct FTakeHitSpeedModifierInfo Info;
	struct FVector ToCauser;
};

struct ACCInstancePawn_execClientAddHitSpeedModifierEntry_Parms
{
	struct FTakeHitSpeedModifierInfo Info;
	struct FVector ToCauser;
};

struct ACCInstancePawn_execAddHitSpeedModifierEntry_Parms
{
	struct FTakeHitSpeedModifierInfo Info;
	struct FVector ToCauser;
};

struct ACCInstancePawn_eventTakeDamage_Parms
{
	int Damage;
	class AController* InstigatedBy;
	struct FVector HitLocation;
	struct FVector Momentum;
	class UClass* DamageType;
	struct FTraceHitInfo HitInfo;
	class AActor* DamageCauser;
	struct FAdditionalHitInfo AddInfo;
};// FUNC_Event

struct ACCInstancePawn_execCalculateDamagePercent_Parms
{
	float Damage;
	float ReturnValue; // CPF_ReturnParm
};

struct ACCInstancePawn_execNotifyWeaponStats_Parms
{
	class APlayerReplicationInfo* PRI;
	int WeaponID;
	int Damage;
};

struct ACCInstancePawn_execPrintTakenDamage_Parms
{
	class ACCPlayerReplicationInfo* pInstigator;
	int Damage;
};

struct ACCInstancePawn_execPrintGivenDamage_Parms
{
	class ACCPlayerReplicationInfo* Target;
	int Damage;
};

struct ACCInstancePawn_execUpdateLastBlockedAimingTime_Parms
{
	float DeltaTime;
};

struct ACCInstancePawn_execServerSetSolvedAimProblems_Parms
{
	unsigned long NewReplicatedBlockedWeapon : 1;
	unsigned long NewReplicatedBlockedAiming : 1;
};

struct ACCInstancePawn_execSimpleSolveAimProblems_Parms
{
	float DeltaTime;
};

struct ACCInstancePawn_execPerformTraceNoPawn_Parms
{
	struct FVector HitLocation; // CPF_OutParm
	struct FVector HitNormal; // CPF_OutParm
	struct FVector TraceEnd;
	struct FVector TraceStart;
	unsigned long bTraceActors : 1;
	struct FVector Extent;
	struct FTraceHitInfo HitInfo; // CPF_OutParm
	class AActor* ReturnValue; // CPF_ReturnParm
};// FUNC_Native

struct ACCInstancePawn_execDrawMeshDebug_Parms
{
	class USkeletalMeshComponent* TheMesh;
};

struct ACCInstancePawn_execDrawDebugMeshData_Parms
{
};

struct ACCInstancePawn_execdo_break_Parms
{
};

struct ACCInstancePawn_execInterpolatePawnLocation_Parms
{
	float DeltaTime;
};

struct ACCInstancePawn_execCalcLocationDebugPointLoc_Parms
{
	struct FVector Loc;
	struct FVector ReturnValue; // CPF_ReturnParm
};

struct ACCInstancePawn_execTickLocationDebug2_Parms
{
	float DeltaTime;
};

struct ACCInstancePawn_execDrawDiagramDebugLocation_Parms
{
	struct FVector WorldLocationDelta;
	struct FVector Origin;
	struct FVector AxisDir;
};

struct ACCInstancePawn_eventTickLocationDebug_Parms
{
	float DeltaTime;
};// FUNC_Event

struct ACCInstancePawn_execCheckForRolling_Parms
{
};

struct ACCInstancePawn_execGrenadeDetecting_Parms
{
	float DeltaTime;
};

struct ACCInstancePawn_eventTick_Parms
{
	float DeltaTime;
};// FUNC_Event

struct ACCInstancePawn_execServerUpdateDemoLoc_Parms
{
	struct FVector _Demo_CachedCamLoc;
	struct FRotator _Demo_CachedCamRot;
};

struct ACCInstancePawn_execResetPriFire_Parms
{
};

struct ACCInstancePawn_execUpdateStartedBlockedFire_Parms
{
};

struct ACCInstancePawn_execPreprocessAttack_Parms
{
	float Value;
	int Type;
	float ReturnValue; // CPF_ReturnParm
};

struct ACCInstancePawn_execCheckWeaponChangeNodeForRecharge_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCInstancePawn_execFindRelevantWeaponChangeNode_Parms
{
	void* ReturnValue; // CPF_ReturnParm
};

struct ACCInstancePawn_execFindRelevantTargetingNode_Parms
{
	void* ReturnValue; // CPF_ReturnParm
};

struct ACCInstancePawn_execCheckWeaponChangeNodesForReadyToFire_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCInstancePawn_execIsInFireOrAimingAnimation_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCInstancePawn_execCheckAnimNodesForReadyToFire_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCInstancePawn_eventGetShootSpotLocation_Parms
{
	struct FRotator StartFireRot; // CPF_OutParm
	struct FVector ReturnValue; // CPF_ReturnParm
};// FUNC_Event

struct ACCInstancePawn_execGetAimPoseShootSpotLocationCached_Parms
{
	struct FRotator StartFireRot; // CPF_OutParm
	struct FVector ReturnValue; // CPF_ReturnParm
};

struct ACCInstancePawn_execGetFirePoseShootSpotLocationCached_Parms
{
	struct FRotator StartFireRot; // CPF_OutParm
	struct FVector ReturnValue; // CPF_ReturnParm
};

struct ACCInstancePawn_execGetIdlePoseShootSpotLocationCached_Parms
{
	struct FRotator StartFireRot; // CPF_OutParm
	struct FVector ReturnValue; // CPF_ReturnParm
};

struct ACCInstancePawn_execCalcWeaponFireFromCustomSpot_Parms
{
	TArray< struct FImpactInfo > ImpactList; // CPF_OutParm
	struct FVector ShootSpotLocation;
	struct FImpactInfo ReturnValue; // CPF_ReturnParm
};

struct ACCInstancePawn_execCalcWeaponFireFromIdlePose_Parms
{
	TArray< struct FImpactInfo > ImpactList; // CPF_OutParm
	struct FVector ShootSpotLocationFromIdlePose; // CPF_OutParm
	struct FImpactInfo ReturnValue; // CPF_ReturnParm
};

struct ACCInstancePawn_execCalcWeaponFireFromAimPose_Parms
{
	TArray< struct FImpactInfo > ImpactList; // CPF_OutParm
	struct FVector ShootSpotLocationFromAimPose; // CPF_OutParm
	int bWeaponInWall; // CPF_OutParm
	struct FImpactInfo ReturnValue; // CPF_ReturnParm
};

struct ACCInstancePawn_execGetHeadLocationForCWF_Parms
{
	struct FVector ReturnValue; // CPF_ReturnParm
};

struct ACCInstancePawn_execCalcWeaponFireCached_Parms
{
	TArray< struct FImpactInfo > ImpactList; // CPF_OutParm
	struct FImpactInfo ReturnValue; // CPF_ReturnParm
};

struct ACCInstancePawn_execGetDebugAngleString_Parms
{
	struct FString ReturnValue; // CPF_ReturnParm
};

struct ACCInstancePawn_execDrawWeaponDebugLines_Parms
{
};

struct ACCInstancePawn_execCheckIsSmallWall1_Parms
{
	struct FVector StartFireLoc;
	struct FVector HitLoc;
	float CheckAngle;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCInstancePawn_execCheckIsSmallWall_Parms
{
	struct FVector StartFireLoc;
	struct FVector HitLoc;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCInstancePawn_execCheckWeaponInWallAuto_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCInstancePawn_execCheckWeaponInWall_Parms
{
	struct FVector StrartFireLoc;
	struct FRotator StartFireRot;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCInstancePawn_execGetResultViewRotation_Parms
{
	struct FRotator BaseAimRotation;
	struct FVector RealAimRay;
	class AActor* RealAimTarget;
	struct FRotator ReturnValue; // CPF_ReturnParm
};

struct ACCInstancePawn_execCalculateAimOffsetTarget_Parms
{
	class AWeapon* Weap;
	struct FVector WeaponLocation;
	struct FRotator BaseAimRotation;
	class AActor* TargetActor; // CPF_OutParm
	struct FVector ReturnValue; // CPF_ReturnParm
};

struct ACCInstancePawn_execGetAimOffsetRotation_Parms
{
	struct FRotator ReturnValue; // CPF_ReturnParm
};

struct ACCInstancePawn_execServerSetCalculatedAimOffset_Parms
{
	int NewAimOffset;
};

struct ACCInstancePawn_execForceUpdateAimOffsetData_Parms
{
};

struct ACCInstancePawn_execGetShouldCalculateAimOffset_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCInstancePawn_execUpdateAimOffsetData_Parms
{
	float DeltaTime;
};

struct ACCInstancePawn_execUpdateMeshBoneControllers_Parms
{
	float DeltaTime;
};

struct ACCInstancePawn_execGetWeaponPPControllerForSocket_Parms
{
	struct FName SocketName;
	void* ReturnValue; // CPF_ReturnParm
};

struct ACCInstancePawn_execGetCCSPPControllerForSocket_Parms
{
	struct FName SocketName;
	void* ReturnValue; // CPF_ReturnParm
};

struct ACCInstancePawn_execUpdateWeapon2CarrySlotIK_Parms
{
	unsigned long bForceUpdate : 1;
};

struct ACCInstancePawn_execDisableWeapon2CarrySlotIKController_Parms
{
	void* SkelController;
};

struct ACCInstancePawn_execUpdateWeapon2CarrySlotIKController_Parms
{
	void* SkelController;
	struct FName WeaponSocketName;
	struct FName CarrySlotSocketName;
};

struct ACCInstancePawn_execUpdateWeapon2CarrySlotIKControllerTransform_Parms
{
	void* SkelController;
	struct FName WeaponSocketName;
	struct FName CarrySlotSocketName;
	float Alpha;
};

struct ACCInstancePawn_execUpdateCrosshair_Parms
{
	class AActor* HitActor;
};

struct ACCInstancePawn_execPostRenderFor_Parms
{
	class APlayerController* PC;
	class UCanvas* Canvas;
	struct FVector CameraPosition;
	struct FVector CameraDir;
};

struct ACCInstancePawn_execGetPlayerName_Parms
{
	struct FString ReturnValue; // CPF_ReturnParm
};

struct ACCInstancePawn_execBeginStopAiming_Parms
{
};

struct ACCInstancePawn_execStopAiming_Parms
{
};

struct ACCInstancePawn_execBeginAiming_Parms
{
};

struct ACCInstancePawn_execStartAiming_Parms
{
};

struct ACCInstancePawn_execExecConsoleCommand_Parms
{
	struct FString Command;
};// FUNC_Native

struct ACCInstancePawn_execEndAiming_Default_Parms
{
};// FUNC_Exec

struct ACCInstancePawn_execBeginAiming_Default_Parms
{
};// FUNC_Exec

struct ACCInstancePawn_execEndAiming_Grenade_Parms
{
};// FUNC_Exec

struct ACCInstancePawn_execBeginAiming_Grenade_Parms
{
};// FUNC_Exec

struct ACCInstancePawn_execEndAiming_GrenadeLauncher_Parms
{
};// FUNC_Exec

struct ACCInstancePawn_execBeginAiming_GrenadeLauncher_Parms
{
};// FUNC_Exec

struct ACCInstancePawn_execEndAiming_None_Parms
{
};// FUNC_Exec

struct ACCInstancePawn_execBeginAiming_None_Parms
{
};// FUNC_Exec

struct ACCInstancePawn_execSetDepthPriorityGroup_Parms
{
	unsigned char NewDepthPriorityGroup;
};

struct ACCInstancePawn_execCleanDroppedWeapons_Parms
{
};// FUNC_Exec

struct ACCInstancePawn_execRestoreDroppedWeapons_Parms
{
};// FUNC_Exec

struct ACCInstancePawn_execDropWeaponsByPhysics_Parms
{
};// FUNC_Exec

struct ACCInstancePawn_execGetIsInRagdollState_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCInstancePawn_execRecoveringFromRagdollFinished_Parms
{
};

struct ACCInstancePawn_eventPlayingRecoveryFromRagdollFinished_Parms
{
};// FUNC_Event

struct ACCInstancePawn_execLeaveRagdollState_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCInstancePawn_execServerLeaveRagdollState_Parms
{
};

struct ACCInstancePawn_execServerReplicateAllowRecoveryFromRagdoll_Parms
{
};

struct ACCInstancePawn_execRagdollDelayTimer_Parms
{
};

struct ACCInstancePawn_execForceFinishEnteringRagdollState_Parms
{
};

struct ACCInstancePawn_execEnteringRagdollStateFinished_Parms
{
};

struct ACCInstancePawn_execEnterRagdollState_Parms
{
	float BlendInTime;
	struct FTakeHitInfo ImpulseInfo;
	int Id;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCInstancePawn_execProcessRagdollStateInfoStructReplicated_Parms
{
};

struct ACCInstancePawn_execServerSpawnShotOffGibViaRpc_Parms
{
	void* GibPreset;
	struct FVector ShotOffMomentum;
};

struct ACCInstancePawn_execServerSpawnGibsForEntireBodyViaRpc_Parms
{
	void* GibPreset;
	struct FVector ExplosionMomentum;
	float GibsTearOffMomentum;
	float GibsTearOffMinPitch;
};

struct ACCInstancePawn_execServerEnterRagdollState_Parms
{
	float BlendInTime;
	struct FTakeHitInfo ImpulseInfo;
};

struct ACCInstancePawn_execServerEnterRagdollStateViaRpc_Parms
{
	float BlendInTime;
	struct FTakeHitInfo ImpulseInfo;
};

struct ACCInstancePawn_execSetRagdollBlendTargetWeight_Parms
{
	float DestWeight;
	float BlendSpeed;
};// FUNC_Exec

struct ACCInstancePawn_execSpawnDeadBlood_Parms
{
};

struct ACCInstancePawn_execInitializeAnimationNodes_Parms
{
};

struct ACCInstancePawn_execAddDefaultInventory_Parms
{
};

struct ACCInstancePawn_execZeroVelocity_Parms
{
};

struct ACCInstancePawn_execMovementModeChanged_Parms
{
	unsigned char OldMovementMode;
};

struct ACCInstancePawn_eventGetManualVelocityModeSPDModifier_Parms
{
	struct FVector ManualVelocityValue;
	float ReturnValue; // CPF_ReturnParm
};// FUNC_Event

struct ACCInstancePawn_execUpdateMove_Parms
{
};

struct ACCInstancePawn_eventBump_Parms
{
	class AActor* Other;
	class UPrimitiveComponent* OtherComp;
	struct FVector HitNormal;
};// FUNC_Event

struct ACCInstancePawn_eventTouch_Parms
{
	class AActor* Other;
	class UPrimitiveComponent* OtherComp;
	struct FVector HitLocation;
	struct FVector HitNormal;
};// FUNC_Event

struct ACCInstancePawn_execBreakFromCover_Parms
{
};// FUNC_Final

struct ACCInstancePawn_eventMove2IdleTransitionFinished_Parms
{
};// FUNC_Event

struct ACCInstancePawn_eventConditionalMove2IdleTransition_Parms
{
};// FUNC_Event

struct ACCInstancePawn_execIsDoingMove2IdleTransition_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct ACCInstancePawn_execIsAtRightEdgeSlot_Parms
{
	float InLimit;
	unsigned long bMustLean : 1;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final

struct ACCInstancePawn_execIsAtLeftEdgeSlot_Parms
{
	float InLimit;
	unsigned long bMustLean : 1;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final

struct ACCInstancePawn_execCanPrepareRun2Cover_Parms
{
	float CheckDist;
	struct FCovPosInfo OutFoundCovInfo; // CPF_OutParm
	struct FVector CheckDir;
	float AcquireCoverFOV;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final

struct ACCInstancePawn_eventEvadeAnimationFinished_Parms
{
};// FUNC_Event

struct ACCInstancePawn_execPlayEvadeParticleEffect_Parms
{
	struct FRotator SpawnRotation;
};

struct ACCInstancePawn_execPlayEvadeAnimLandedNotify_Parms
{
};

struct ACCInstancePawn_execCanEvade_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final

struct ACCInstancePawn_execIsEvading_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct ACCInstancePawn_execGetCoverNormal_Parms
{
	unsigned long bSmoothed : 1;
	struct FVector ReturnValue; // CPF_ReturnParm
};// FUNC_Final

struct ACCInstancePawn_execFaceRotation_Parms
{
	struct FRotator NewRotation;
	float DeltaTime;
};

struct ACCInstancePawn_execCanPerformMantleDown_Parms
{
	float MinMantleHeight;
	float MaxMantleHeight;
	struct FRotator TestRotation;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct ACCInstancePawn_execFitCollision_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct ACCInstancePawn_execGetSlotIdxByPct_Parms
{
	int ReturnValue; // CPF_ReturnParm
};// FUNC_Final

struct ACCInstancePawn_eventReplicatedEventEx_Parms
{
	struct FName VarName;
	int ArrayIndex;
};// FUNC_Event

struct ACCInstancePawn_eventReplicatedEvent_Parms
{
	struct FName VarName;
};// FUNC_Event

struct ACCInstancePawn_execLeaveCover_Parms
{
};// FUNC_Exec

struct ACCInstancePawn_execPlayCoverExitTransition_Parms
{
};

struct ACCInstancePawn_execPlayCoverEnterTransition_Parms
{
};

struct ACCInstancePawn_execSetCoverInfoFromSlotInfo_Parms
{
	struct FCovPosInfo OutCovInfo; // CPF_OutParm
	struct FCoverInfo SlotInfo;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Native

struct ACCInstancePawn_execSetCoverInfo_Parms
{
	void* Link;
	int SlotIdx;
	int LeftIdx;
	int RightIdx;
	float SlotPct;
	unsigned long bReplicate : 1;
};

struct ACCInstancePawn_execSetCovPosInfo_Parms
{
	struct FCovPosInfo CovInfo;
	unsigned long bReplicate : 1;
};

struct ACCInstancePawn_execSetIsCoverMirrored_Parms
{
	unsigned long bValue : 1;
};

struct ACCInstancePawn_execPlayCoverActionSound_Parms
{
};

struct ACCInstancePawn_execGetCoverActionSound_Parms
{
	void* PMaterial;
	void* ReturnValue; // CPF_ReturnParm
};

struct ACCInstancePawn_execCoverAcquired_Parms
{
	struct FCovPosInfo CovInfo;
};

struct ACCInstancePawn_execCoverInfoToCovPosInfo_Parms
{
	struct FCoverInfo CovInfo;
	struct FCovPosInfo ReturnValue; // CPF_ReturnParm
};

struct ACCInstancePawn_execDumpCoverInfo_Parms
{
	struct FCovPosInfo CovInfo;
};

struct ACCInstancePawn_execIsOnACoverSlot_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final

struct ACCInstancePawn_eventReachedCoverSlot_Parms
{
	int SlotIdx;
};// FUNC_Event

struct ACCInstancePawn_execFindBestCoverSideFor_Parms
{
	struct FCovPosInfo CovInfo;
	unsigned char ReturnValue; // CPF_ReturnParm
};// FUNC_Final

struct ACCInstancePawn_execGetCoverTypeFor_Parms
{
	struct FCovPosInfo Cover;
	unsigned char ReturnValue; // CPF_ReturnParm
};// FUNC_Final

struct ACCInstancePawn_execFindCoverType_Parms
{
	unsigned char ReturnValue; // CPF_ReturnParm
};// FUNC_Final

struct ACCInstancePawn_execSetCurrentCoverType_Parms
{
	unsigned long bClear : 1;
};// FUNC_Final

struct ACCInstancePawn_execCanPawnGetInToCover_Parms
{
};// FUNC_Exec

struct ACCInstancePawn_execMovePawnIntoCover_Parms
{
};// FUNC_Exec

struct ACCInstancePawn_execNotifyPlaceableItems_Parms
{
};

struct ACCInstancePawn_execResetAllStuff_Parms
{
};

struct ACCInstancePawn_execRestart_Parms
{
};

struct ACCInstancePawn_execUpdateWeaponAttachmentIds_Parms
{
};

struct ACCInstancePawn_execClientSpawnSpeedModifierSystem_Parms
{
};

struct ACCInstancePawn_execSpawnSpeedModifierSystem_Parms
{
};

struct ACCInstancePawn_execPossessedBy_Parms
{
	class AController* C;
	unsigned long bVehicleTransition : 1;
};

struct ACCInstancePawn_execClientReInitEM_Parms
{
	class AController* C;
};

struct ACCInstancePawn_execClientUpdateHUD_Parms
{
};

struct ACCInstancePawn_execWeaponTypeToID_Parms
{
	unsigned char WeaponType;
	int ReturnValue; // CPF_ReturnParm
};

struct ACCInstancePawn_execSetDuplicatedWeaponAttachmentState_Parms
{
	unsigned char NewState;
};

struct ACCInstancePawn_eventGetWeaponAttachmentHideTime_Parms
{
	float ReturnValue; // CPF_ReturnParm
};// FUNC_Event

struct ACCInstancePawn_eventGetWeaponAttachmentEquipTime_Parms
{
	float ReturnValue; // CPF_ReturnParm
};// FUNC_Event

struct ACCInstancePawn_eventGetWeaponAttachmentState_Parms
{
	unsigned char ReturnValue; // CPF_ReturnParm
};// FUNC_Event

struct ACCInstancePawn_execUpdateAttachedWeapons_Parms
{
};

struct ACCInstancePawn_execReceiveReplicatedReplicatedVisualCarrySlotInfoStruct_Parms
{
	unsigned long bForceApply : 1;
};

struct ACCInstancePawn_execSetActiveVisualCarrySlot_Parms
{
	unsigned char Slot;
};

struct ACCInstancePawn_execUpdateReplicatedVisualCarrySlotInfoStruct_Parms
{
};

struct ACCInstancePawn_execGetActiveVisualCarrySlot_Parms
{
	unsigned char ReturnValue; // CPF_ReturnParm
};// FUNC_Native

struct ACCInstancePawn_execShowAllWeaponCarrySlots_Parms
{
};

struct ACCInstancePawn_execHideAllWeaponCarrySlots_Parms
{
};

struct ACCInstancePawn_execGetWeaponCarrySlotRBDescIndexFor_Parms
{
	int CarrySlotIndex;
	int WeaponIdx;
	int ReturnValue; // CPF_ReturnParm
};

struct ACCInstancePawn_execUpdateWeaponCarrySlotsRB_Parms
{
	int CarrySlotIndex;
	int WeaponIdx;
	unsigned long bSlotEmpty : 1;
};

struct ACCInstancePawn_execInitializeWeaponCarrySlotsRB_Parms
{
	int CarrySlotIndex;
	int WeaponIdx;
};

struct ACCInstancePawn_execAttachWeaponToCarrySlotSocket_Parms
{
	class USkeletalMeshComponent* WpnMesh;
	struct FName SocketName;
};

struct ACCInstancePawn_execUpdateWeaponCarrySlots_Parms
{
};

struct ACCInstancePawn_execInitializeWeaponCarrySlots_Parms
{
};

struct ACCInstancePawn_execCleanUpWeaponCarrySlots_Parms
{
};

struct ACCInstancePawn_execGetWAAttachesFor_Parms
{
	int CarrySlotIndex;
	struct FWeaponAttachesArray ReturnValue; // CPF_ReturnParm
};

struct ACCInstancePawn_execGetWAPresetFor_Parms
{
	int CarrySlotIndex;
	int WeaponIndex;
	void* ReturnValue; // CPF_ReturnParm
};

struct ACCInstancePawn_execGetWAIDFor_Parms
{
	int CarrySlotIndex;
	int WeaponIndex;
	struct FString ReturnValue; // CPF_ReturnParm
};

struct ACCInstancePawn_execPlayItemPacksSound_Parms
{
	void* Sound;
};

struct ACCInstancePawn_execPlaceItem_ToggleDrawSphere_Parms
{
};

struct ACCInstancePawn_execPlaceItem_EndPlacing_Parms
{
	void* Ability;
};

struct ACCInstancePawn_execPlaceItem_BeginPlacing_Parms
{
};

struct ACCInstancePawn_execClient_PlaceItem_EndSearch_Parms
{
};

struct ACCInstancePawn_execPlaceItem_EndSearch_Parms
{
};

struct ACCInstancePawn_execPlaceItem_Searching_EndDrawing_Parms
{
};

struct ACCInstancePawn_execPlaceItem_Searching_Draw_Parms
{
};

struct ACCInstancePawn_execPlaceItem_Searching_BeginDrawing_Parms
{
};

struct ACCInstancePawn_execClient_PlaceItem_BeginSearch_Parms
{
};

struct ACCInstancePawn_execPlaceItem_BeginSearch_Parms
{
	struct FPlacingItemInfo Info;
};

struct ACCInstancePawn_execCanPlaceItem_Parms
{
	class ACCPlaceableItem* ItemArchetype;
	struct FVector PlaceLoc; // CPF_OutParm
	struct FRotator PlaceRot; // CPF_OutParm
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Native

struct ACCInstancePawn_eventOnCreateCharacterComponent_Parms
{
};// FUNC_Event

struct ACCInstancePawn_execUpdateServerHeadPos_Parms
{
};

struct ACCInstancePawn_execServerUpdateServerHeadPos_Parms
{
	struct FVector HeadPos;
};

struct ACCInstancePawn_eventPostBeginPlay_Parms
{
};// FUNC_Event

struct ACCInstancePawn_execDestroyWeaponAttachment_Parms
{
};

struct ACCInstancePawn_execCreateWeaponAttachment_Parms
{
};

struct ACCInstancePawn_execDisableReplication_Parms
{
};

struct ACCInstancePawn_execUpdateCollisionModeAuto_Parms
{
};

struct ACCInstancePawn_execPlayRollingSound_Parms
{
};

struct ACCInstancePawn_eventCalculateRollingTime_Parms
{
	int DirectionIndex;
	float ReturnValue; // CPF_ReturnParm
};// FUNC_Event

struct ACCInstancePawn_execCalcTBBOFinishAngleDifference_Parms
{
	float ReturnValue; // CPF_ReturnParm
};

struct ACCInstancePawn_execGetShouldFinishTBBO_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCInstancePawn_execTurnBasedBlendOutFinishTimer_Parms
{
};

struct ACCInstancePawn_execTurnBasedBlendOutTimer_Parms
{
};

struct ACCInstancePawn_execPerformTurnBasedBlendOut_Parms
{
	struct FRotator TheOldPawnRotation;
	struct FRotator NewControllerRotation;
	float NormalSmoothBlendTime;
	float TurnSmoothBlendTime;
};

struct ACCInstancePawn_execFinishMeleeAnim_Parms
{
	struct FRotator ControllerPostMeleeRotation;
};

struct ACCInstancePawn_execStartMeleeAnim_Parms
{
};

struct ACCInstancePawn_execFinishEmoteAnim_Parms
{
	struct FRotator PawnEmoteRotation;
	struct FRotator ControllerPostEmoteRotation;
};

struct ACCInstancePawn_execFinishRollingAnim_Parms
{
	struct FRotator PawnRollingRotation;
	struct FRotator ControllerPostRollingRotation;
};

struct ACCInstancePawn_execPlayRollingAnim_Parms
{
};// FUNC_Native

struct ACCInstancePawn_execResetTurnNodes_Parms
{
	struct FRotator ResetRot;
};

struct ACCInstancePawn_execInitializeOtherAnimationNodes_Parms
{
};

struct ACCInstancePawn_execGetStreamingInfo_Parms
{
	struct FString levelStatus;
};// FUNC_Exec FUNC_Native

struct ACCInstancePawn_execGetCoverInfo_Parms
{
};// FUNC_Exec FUNC_Native

struct ACCInstancePawn_execFillCoverPosInfo_Parms
{
	void* Link;
	int SlotIdx;
	struct FVector FromLoc;
	struct FVector Direction;
	float MaxDistance;
	struct FCovPosInfo out_CovPosInfo; // CPF_OutParm
};// FUNC_Final FUNC_Native

struct ACCInstancePawn_execValidatePotentialCover_Parms
{
	struct FVector FromLoc;
	struct FVector Direction;
	float OutMinDotFOV; // CPF_OutParm
	float OutMaxDistanceSquared; // CPF_OutParm
	struct FCovPosInfo OutCovPosInfo; // CPF_OutParm
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct ACCInstancePawn_execFindCoverFromLocAndDir_Parms
{
	struct FVector FromLoc;
	struct FVector Direction;
	float FOV;
	float MaxDistance;
	struct FCovPosInfo OutCovPosInfo; // CPF_OutParm
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct ACCInstancePawn_execGuessAtCover_Parms
{
	struct FCoverInfo out_Cover; // CPF_OutParm
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct ACCInstancePawn_execIsInCover_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct ACCInstancePawn_execGetCurrentSlotPct_Parms
{
	void* Link;
	int InLeftSlotIdx;
	int InRightSlotIdx;
	float ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct ACCInstancePawn_execGetRBVelocity_Parms
{
	float ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct ACCInstancePawn_execGetVirtualShootSpotLocation_Parms
{
	struct FRotator VirtualStartFireRot; // CPF_OutParm
	struct FVector ReturnValue; // CPF_ReturnParm
};// FUNC_Native

struct ACCInstancePawn_execCheckSkeletonEnroachment_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Native

struct ACCInstancePawn_execFillArrayOfSequenceByWeaponNameNodes_Parms
{
};// FUNC_Native

struct ACCInstancePawn_execFillArrayOfWeaponChangeNodes_Parms
{
};// FUNC_Native

struct ACCInstancePawn_execFillArrayOfTargetingNodes_Parms
{
};// FUNC_Native

struct ACCInstancePawn_execGetWeaponParameters_Parms
{
	struct FPawnWeaponParams ReturnValue; // CPF_ReturnParm
};

struct ACCInstancePawn_execPawnBurning_FindAbilityInfo_Parms
{
	struct FString AbilityName;
	struct FPawnBurning_AbilityInfo AbilityInfo; // CPF_OutParm
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final

struct ACCInstancePawn_execIsBoneAvailableToBurn_Parms
{
	struct FName BoneName;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCInstancePawn_execIsAlreadyBurn_Parms
{
	struct FName BoneName;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCInstancePawn_execBurnPawnBones_Parms
{
};

struct ACCInstancePawn_execPawnBurning_Burn_Parms
{
	struct FVector Origin;
	float Radius;
	struct FName AbilityName;
};

struct ACCInstancePawn_execPawnBurning_BoneInfoReplicatedEvent_Parms
{
	int BoneIndex;
};

struct ACCInstancePawn_execGetClientClockValue_Parms
{
	float ServerClockValue;
	float ReturnValue; // CPF_ReturnParm
};// FUNC_Final

// (0x6BC - 0x1AC0)
class ACCInstancePawn : public ACCPawn
{
public:
	class UClass*                                      CCDamageType;                                // 0x06BC (0x0004)
	unsigned long                                      bReplicatedPlayerReplicationInfo : 1;        // 0x06C0 (0x0004) [0x00000001]
	unsigned long                                      bIsInNoMovementMode : 1;                     // 0x06C0 (0x0004) [0x00000002]
	unsigned long                                      bRealAimingEnabled : 1;                      // 0x06C0 (0x0004) [0x00000004]
	unsigned long                                      bForceAimOnTargetingNode : 1;                // 0x06C0 (0x0004) [0x00000008]
	unsigned long                                      bForceFireOnTargetingNode : 1;               // 0x06C0 (0x0004) [0x00000010]
	unsigned long                                      bForceIdleOnTargetingNode : 1;               // 0x06C0 (0x0004) [0x00000020]
	unsigned long                                      bWeaponIdleTrace : 1;                        // 0x06C0 (0x0004) [0x00000040]
	unsigned long                                      bWeaponAimTrace : 1;                         // 0x06C0 (0x0004) [0x00000080]
	unsigned long                                      bChangedTeamDied : 1;                        // 0x06C0 (0x0004) [0x00000100]
	unsigned long                                      NeedToDetectProjectiles : 1;                 // 0x06C0 (0x0004) [0x00000200]
	unsigned long                                      bShowDebugServerSkeleton : 1;                // 0x06C0 (0x0004) [0x00000400]
	unsigned long                                      bSpyMode : 1;                                // 0x06C0 (0x0004) [0x00000800]
	unsigned long                                      bEnableLocationInterpolation : 1;            // 0x06C0 (0x0004) [0x00001000]
	unsigned long                                      bUseJustTeleportedInLocationInterpolation : 1; // 0x06C0 (0x0004) [0x00002000]
	unsigned long                                      LI_bInitialized : 1;                         // 0x06C0 (0x0004) [0x00004000]
	unsigned long                                      bEnableRotationInterpolation : 1;            // 0x06C0 (0x0004) [0x00008000]
	unsigned long                                      bUseJustTeleportedInRotationInterpolation : 1; // 0x06C0 (0x0004) [0x00010000]
	unsigned long                                      RI_bInitialized : 1;                         // 0x06C0 (0x0004) [0x00020000]
	unsigned long                                      ReplicatedAiming : 1;                        // 0x06C0 (0x0004) [0x00040000]
	unsigned long                                      ReplicatedBlockedAiming : 1;                 // 0x06C0 (0x0004) [0x00080000]
	unsigned long                                      ReplicatedBlockedWeapon : 1;                 // 0x06C0 (0x0004) [0x00100000]
	unsigned long                                      StartedBlockedFire : 1;                      // 0x06C0 (0x0004) [0x00200000]
	unsigned long                                      bUseSpecialFireMode : 1;                     // 0x06C0 (0x0004) [0x00400000]
	unsigned long                                      bDoingFire : 1;                              // 0x06C0 (0x0004) [0x00800000]
	unsigned long                                      bDoingAltFire : 1;                           // 0x06C0 (0x0004) [0x01000000]
	unsigned long                                      bCanDo360AimingInCover : 1;                  // 0x06C0 (0x0004) [0x02000000]
	unsigned long                                      bNoWeaponIdleAnim : 1;                       // 0x06C0 (0x0004) [0x04000000]
	unsigned long                                      bReplicatedWeaponDown : 1;                   // 0x06C0 (0x0004) [0x08000000]
	unsigned long                                      bSniperVision : 1;                           // 0x06C0 (0x0004) [0x10000000]
	unsigned long                                      ShowSensitivity : 1;                         // 0x06C0 (0x0004) [0x20000000]
	unsigned long                                      ShowFov : 1;                                 // 0x06C0 (0x0004) [0x40000000]
	unsigned long                                      InVisible : 1;                               // 0x06C0 (0x0004) [0x80000000]
	unsigned long                                      bDoingTurnBasedBlendOut : 1;                 // 0x06C4 (0x0004) [0x00000001]
	unsigned long                                      bInRagdollState : 1;                         // 0x06C4 (0x0004) [0x00000002]
	unsigned long                                      bBlockRigidBodyPhysics : 1;                  // 0x06C4 (0x0004) [0x00000004]
	unsigned long                                      bPlayingRagdollBlend : 1;                    // 0x06C4 (0x0004) [0x00000008]
	unsigned long                                      bDrawRagdollDebug : 1;                       // 0x06C4 (0x0004) [0x00000010]
	unsigned long                                      bPlayingRecoveryFromRagdoll : 1;             // 0x06C4 (0x0004) [0x00000020]
	unsigned long                                      bAllowPlayRecoveryFromRagdoll : 1;           // 0x06C4 (0x0004) [0x00000040]
	unsigned long                                      bPlayingDeathAnimation : 1;                  // 0x06C4 (0x0004) [0x00000080]
	unsigned long                                      bForceDisableDeathAnimation : 1;             // 0x06C4 (0x0004) [0x00000100]
	unsigned long                                      bReplicatedWeaponAttachment : 1;             // 0x06C4 (0x0004) [0x00000200]
	unsigned long                                      bInitedWeaponCarrySlots : 1;                 // 0x06C4 (0x0004) [0x00000400]
	unsigned long                                      bFirstWeaponInited : 1;                      // 0x06C4 (0x0004) [0x00000800]
	unsigned long                                      bDoingCoverActionAnimTransition : 1;         // 0x06C4 (0x0004) [0x00001000]
	unsigned long                                      bUsesBodyStances : 1;                        // 0x06C4 (0x0004) [0x00002000]
	unsigned long                                      bCannotRoadieRun : 1;                        // 0x06C4 (0x0004) [0x00004000]
	unsigned long                                      bIsMirrored : 1;                             // 0x06C4 (0x0004) [0x00008000]
	unsigned long                                      bWantsToBeMirrored : 1;                      // 0x06C4 (0x0004) [0x00010000]
	unsigned long                                      bDoingMirrorTransition : 1;                  // 0x06C4 (0x0004) [0x00020000]
	unsigned long                                      bCanDoRun2Cover : 1;                         // 0x06C4 (0x0004) [0x00040000]
	unsigned long                                      bCoverDebug_PlayerFOV : 1;                   // 0x06C4 (0x0004) [0x00080000]
	unsigned long                                      bCoverDebug_CoverFOV : 1;                    // 0x06C4 (0x0004) [0x00100000]
	unsigned long                                      bCoverDebug_CoverVolume : 1;                 // 0x06C4 (0x0004) [0x00200000]
	unsigned long                                      bCoverDebug_ConsideredLinks : 1;             // 0x06C4 (0x0004) [0x00400000]
	unsigned long                                      bCoverDebug_FoundCover : 1;                  // 0x06C4 (0x0004) [0x00800000]
	unsigned long                                      bCoverDebug_ValidatedCover : 1;              // 0x06C4 (0x0004) [0x01000000]
	unsigned long                                      bWasInCover : 1;                             // 0x06C4 (0x0004) [0x02000000]
	unsigned long                                      bIsCoverMirrored : 1;                        // 0x06C4 (0x0004) [0x04000000]
	unsigned long                                      bIsInStationaryCover : 1;                    // 0x06C4 (0x0004) [0x08000000]
	unsigned long                                      bDoing360Aiming : 1;                         // 0x06C4 (0x0004) [0x10000000]
	unsigned long                                      bDoWalk2IdleTransitions : 1;                 // 0x06C4 (0x0004) [0x20000000]
	unsigned long                                      bReplicatedVisualCarrySlotInfoStructChanged : 1; // 0x06C4 (0x0004) [0x40000000]
	unsigned long                                      PlacingItem_DrawSphere : 1;                  // 0x06C4 (0x0004) [0x80000000]
	unsigned long                                      bCanVacuumRocket : 1;                        // 0x06C8 (0x0004) [0x00000001]
	void*                                              WpnTracer;                                   // 0x06CC (0x0004)
	float                                              WpnTracerActivationTime;                     // 0x06D0 (0x0004)
	float                                              MaxUnBlockedWeaponDist;                      // 0x06D4 (0x0004)
	float                                              MinUnBlockedWeaponDist;                      // 0x06D8 (0x0004)
	float                                              MinRealAimDistance;                          // 0x06DC (0x0004)
	float                                              MaxRealAimRotDiff;                           // 0x06E0 (0x0004)
	float                                              SmallWallCheckAngle;                         // 0x06E4 (0x0004)
	float                                              WeaponAimTraceTrueTime;                      // 0x06E8 (0x0004)
	float                                              WeaponAimTraceFalseTime;                     // 0x06EC (0x0004)
	float                                              LastReplicatedBlockedWeaponTRUETime;         // 0x06F0 (0x0004)
	struct FImpactInfo                                 LastCWFRealImpact;                           // 0x06F4 (0x0060)
	TArray< struct FImpactInfo >                       LastCWFImpactList;                           // 0x0754 (0x000C)
	float                                              LastCalcWeaponFireTime;                      // 0x0760 (0x0004)
	struct FCachedFirePosition                         CachedIdlePoseShootSpot;                     // 0x0764 (0x001C)
	struct FCachedFirePosition                         CachedFirePoseShootSpot;                     // 0x0780 (0x001C)
	struct FCachedFirePosition                         CachedAimPoseShootSpot;                      // 0x079C (0x001C)
	TArray< struct FProjectileDetectingInfo >          DetectedProjectiles;                         // 0x07B8 (0x000C)
	int                                                NumOfDetectedProjectiles;                    // 0x07C4 (0x0004)
	int                                                DebugBonesDepth;                             // 0x07C8 (0x0004)
	struct FVector                                     DebugBones[ 128 ];                           // 0x07CC (0x0600)
	struct FVector                                     DebugLastLocation;                           // 0x0DCC (0x000C)
	int                                                LastStartFireCounter;                        // 0x0DD8 (0x0004)
	float                                              PickupProgress;                              // 0x0DDC (0x0004)
	int                                                PickupText;                                  // 0x0DE0 (0x0004)
	float                                              LocationInterpolationSpeed;                  // 0x0DE4 (0x0004)
	struct FVector                                     LI_TargetLocation;                           // 0x0DE8 (0x000C)
	float                                              RotationInterpolationSpeed;                  // 0x0DF4 (0x0004)
	struct FRotator                                    RI_TargetRotation;                           // 0x0DF8 (0x000C)
	float                                              Last_ServerSetCalculatedAimOffset_CallTime;  // 0x0E04 (0x0004)
	float                                              ServerSetCalculatedAimOffset_CallInterval;   // 0x0E08 (0x0004)
