/////////////////////////////////////////////////////////////////////////////
// Unreal Engine MiniSDK Generator by uNrEaL
// Game: CrimeCraft
// File: ACCInstanceGameInfo.h
// Date: 06/16/2011 @ 05:19:40.815
/////////////////////////////////////////////////////////////////////////////

#ifdef _MSC_VER
#pragma pack( push, 4 )
#endif

struct ACCInstanceGameInfo_execCheckNPCIndicators_Parms
{
};

struct ACCInstanceGameInfo_execPatchLootTable_Parms
{
	TArray< struct FLootTableEntry > table; // CPF_OutParm
	class UClass* Item;
	float Prob;
	int Count;
};

struct ACCInstanceGameInfo_execPatchLootTables_Parms
{
	class UClass* Item;
	float Prob;
	int Count;
};

struct ACCInstanceGameInfo_execGetLootItem_Parms
{
	TArray< struct FLootTableEntry > lt;
	class UClass* ReturnValue; // CPF_ReturnParm
};

struct ACCInstanceGameInfo_execCheckLootTable_Parms
{
	TArray< struct FLootTableEntry > lt;
};

struct ACCInstanceGameInfo_execGetZInPoint_Parms
{
	struct FVector pt;
	struct FVector ReturnValue; // CPF_ReturnParm
};

struct ACCInstanceGameInfo_execIsPlayerUsingInvisibility_Parms
{
	class APlayerController* C;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCInstanceGameInfo_execevtPlayerTouchedTheItem_Parms
{
	void* Item;
	class APlayerController* Player;
};

struct ACCInstanceGameInfo_execNotifyKismetAboutCratePickup_Parms
{
	class AController* C;
	void* I;
};

struct ACCInstanceGameInfo_eventScoreCarryObjectEnemy_Parms
{
	TArray< class ACCInstancePawn* > ScorersList;
	void* TheObject;
};// FUNC_Event

struct ACCInstanceGameInfo_eventScoreCarryObject_Parms
{
	TArray< class ACCInstancePawn* > ScorersList;
	void* TheObject;
};// FUNC_Event

struct ACCInstanceGameInfo_execClearPickupProgressAll_Parms
{
};// FUNC_Native

struct ACCInstanceGameInfo_execTick_Parms
{
	float DeltaTime;
};

struct ACCInstanceGameInfo_eventAvatarReady_Parms
{
	class APlayerController* PC;
};// FUNC_Event

struct ACCInstanceGameInfo_execFindInactivePRI_Parms
{
	class APlayerController* PC;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCInstanceGameInfo_execAddInactivePRI_Parms
{
	class APlayerReplicationInfo* PRI;
	class APlayerController* PC;
};

struct ACCInstanceGameInfo_execBroadcastCombatLogMessageParam_Parms
{
	class AActor* Sender;
	class UClass* Message;
	int Switch;
	struct FAdditionalParam Param;
};

struct ACCInstanceGameInfo_execNotifyMineExplode_Parms
{
	class ACCInstanceController* CController;
	class ACCMine* CMine;
};

struct ACCInstanceGameInfo_execIsDead_Parms
{
	class APlayerReplicationInfo* PRI;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCInstanceGameInfo_execAddPlayerScore_Parms
{
	class APlayerReplicationInfo* PRI;
	int ScoreToAdd;
	unsigned char PST;
	int ExtraData;
};

struct ACCInstanceGameInfo_execAddPlayerScoreNotify_Parms
{
	class APlayerReplicationInfo* PRI;
	int ScoreToAdd;
	unsigned char PST;
	int ExtraData;
};

struct ACCInstanceGameInfo_execGetWeaponAttachmentPresetStore_Parms
{
	void* ReturnValue; // CPF_ReturnParm
};

struct ACCInstanceGameInfo_execSetGameSpeed_Parms
{
	float T;
};

struct ACCInstanceGameInfo_execRestartPlayers_Parms
{
};

struct ACCInstanceGameInfo_execNotifyTakenDamage_Parms
{
	float Damage;
	class APawn* injured;
	class AController* InstigatedBy;
};

struct ACCInstanceGameInfo_execGetDefaultPlayerClass_Parms
{
	class AController* C;
	class UClass* ReturnValue; // CPF_ReturnParm
};

struct ACCInstanceGameInfo_execSpawnDefaultPawnFor_Parms
{
	class AController* NewPlayer;
	class ANavigationPoint* StartSpot;
	class APawn* ReturnValue; // CPF_ReturnParm
};

struct ACCInstanceGameInfo_execChoosePlayerStart_Parms
{
	class AController* Player;
	unsigned char InTeam;
	void* ReturnValue; // CPF_ReturnParm
};

struct ACCInstanceGameInfo_eventLogin_Parms
{
	struct FString Portal;
	struct FString Options;
	struct FString ErrorMessage; // CPF_OutParm
	class APlayerController* ReturnValue; // CPF_ReturnParm
};// FUNC_Event

struct ACCInstanceGameInfo_execRestartPlayer_Parms
{
	class AController* NewPlayer;
};

struct ACCInstanceGameInfo_execCheckQuestZones_Parms
{
	class AController* NewPlayer;
};

struct ACCInstanceGameInfo_execSetPlayerDefaults_Parms
{
	class APawn* PlayerPawn;
};

struct ACCInstanceGameInfo_execRespawnPlayer_Parms
{
	class AController* Player;
};

struct ACCInstanceGameInfo_execPlayerCanRestart_Parms
{
	class APlayerController* aPlayer;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCInstanceGameInfo_execKilled_Parms
{
	class AController* Killer;
	class AController* KilledPlayer;
	class APawn* KilledPawn;
	class UClass* DamageType;
};

struct ACCInstanceGameInfo_execReset_Parms
{
};

struct ACCInstanceGameInfo_execCheckEndGame_Parms
{
	class APlayerReplicationInfo* Winner;
	struct FString Reason;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCInstanceGameInfo_execRestartGame_Parms
{
};

struct ACCInstanceGameInfo_execInitGameReplicationInfo_Parms
{
};

struct ACCInstanceGameInfo_execAddDefaultInventory_Parms
{
	class APawn* PlayerPawn;
};

struct ACCInstanceGameInfo_execLogout_Parms
{
	class AController* Exiting;
};

struct ACCInstanceGameInfo_eventPostLogin_Parms
{
	class APlayerController* NewPlayer;
};// FUNC_Event

struct ACCInstanceGameInfo_execAFKEvent_Parms
{
	class APlayerReplicationInfo* InstigatorPRI;
	float Time;
};

struct ACCInstanceGameInfo_execWeaponFireEvent_Parms
{
	class APlayerReplicationInfo* InstigatorPRI;
	int WeaponSlot;
	int FireMode;
	int NumFired;
};

struct ACCInstanceGameInfo_execFeatEvent_Parms
{
	class APlayerReplicationInfo* PRI;
	unsigned char FeatType;
	int Value;
};

struct ACCInstanceGameInfo_execPickUpEvent_Parms
{
	class APlayerReplicationInfo* PRI;
	unsigned char PickUpType;
	int PickupNum;
};

struct ACCInstanceGameInfo_execBonusEvent_Parms
{
	unsigned char BonusType;
	class APlayerReplicationInfo* BonusPlayer;
};

struct ACCInstanceGameInfo_execObjectiveEvent_Parms
{
	unsigned char StatType;
	int TeamNo;
	class APlayerReplicationInfo* InstigatorPRI;
	int ObjectiveIndex;
};

struct ACCInstanceGameInfo_execKillEvent_Parms
{
	unsigned char Killtype;
	class APlayerReplicationInfo* Killer;
	class APlayerReplicationInfo* Victim;
	int KillerWeaponID;
	int VictimWeaponID;
};

struct ACCInstanceGameInfo_execGameEvent_Parms
{
	unsigned char EventType;
	int Team;
	class APlayerReplicationInfo* InstigatorPRI;
	int AddData;
};

struct ACCInstanceGameInfo_execCheckScore_Parms
{
	class APlayerReplicationInfo* Scorer;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCInstanceGameInfo_execCheckMaxLives_Parms
{
	class APlayerReplicationInfo* Scorer;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCInstanceGameInfo_execSpawnBotController_Parms
{
	class UClass* BotClass;
	struct FBotRosterEntry Entry;
	int TeamIndex;
	void* ReturnValue; // CPF_ReturnParm
};

struct ACCInstanceGameInfo_execAddBot_Parms
{
	struct FString BotName;
	int TeamIndex;
	class UClass* BotClass;
	void* ReturnValue; // CPF_ReturnParm
};

struct ACCInstanceGameInfo_execNeedPlayers_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCInstanceGameInfo_execStopAllMovement_Parms
{
};

struct ACCInstanceGameInfo_execKismetGameEndedEvent_Parms
{
};

struct ACCInstanceGameInfo_execSortPlayersByScore_Parms
{
};

struct ACCInstanceGameInfo_execNativeSortPlayers_Parms
{
};// FUNC_Native

struct ACCInstanceGameInfo_execSuddenDeathNotify_Parms
{
};

struct ACCInstanceGameInfo_execScoreFFAKill_Parms
{
	class ACCPlayerReplicationInfo* PRI;
	int ReturnValue; // CPF_ReturnParm
};

struct ACCInstanceGameInfo_execScoreMultiKill_Parms
{
	class ACCPlayerReplicationInfo* PRI;
	int ReturnValue; // CPF_ReturnParm
};

struct ACCInstanceGameInfo_execNeedSuddenDeath_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCInstanceGameInfo_execGoToPendingMatch_Parms
{
};

struct ACCInstanceGameInfo_execYakaRequestInit_Parms
{
};

struct ACCInstanceGameInfo_execMatchIsInProgress_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCInstanceGameInfo_execEndRound_Parms
{
	class AActor* EndRoundFocus;
};

struct ACCInstanceGameInfo_execResetLevel_Parms
{
};

struct ACCInstanceGameInfo_execJustStarted_Parms
{
	float MaxElapsedTime;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCInstanceGameInfo_execPlayStartupMessage_Parms
{
};

struct ACCInstanceGameInfo_execPlayRegularEndOfMatchMessage_Parms
{
};

struct ACCInstanceGameInfo_execPlayEndOfMatchMessage_Parms
{
};

struct ACCInstanceGameInfo_execIsAWinner_Parms
{
	class APlayerController* C;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCInstanceGameInfo_execDominatingVictory_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCInstanceGameInfo_execRatePlayerStart_Parms
{
	void* P;
	unsigned char Team;
	class AController* Player;
	float ReturnValue; // CPF_ReturnParm
};

struct ACCInstanceGameInfo_execNativeRatePlayerStart_Parms
{
	void* P;
	unsigned char Team;
	class AController* Player;
	float ReturnValue; // CPF_ReturnParm
};// FUNC_Native

struct ACCInstanceGameInfo_execNativeScoreActors_Parms
{
	void* P;
	unsigned char Team;
	class AController* Player;
	unsigned long TeamGame : 1;
	float ReturnValue; // CPF_ReturnParm
};// FUNC_Native

struct ACCInstanceGameInfo_execFindPlayerStart_Parms
{
	class AController* Player;
	unsigned char InTeam;
	struct FString IncomingName;
	class ANavigationPoint* ReturnValue; // CPF_ReturnParm
};

struct ACCInstanceGameInfo_execEndGame_Parms
{
	class APlayerReplicationInfo* Winner;
	struct FString Reason;
};

struct ACCInstanceGameInfo_execStartMatch_Parms
{
};

struct ACCInstanceGameInfo_execdebugRemoveDeadPawns_Parms
{
};

struct ACCInstanceGameInfo_execRestart_Parms
{
};// FUNC_Exec

struct ACCInstanceGameInfo_execForceRespawn_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCInstanceGameInfo_execDecodeEvent_Parms
{
	struct FName EventType;
	int TeamNo;
	struct FString InstigatorName;
	struct FString AdditionalName;
	class UClass* AdditionalObj;
	struct FString ReturnValue; // CPF_ReturnParm
};

struct ACCInstanceGameInfo_execEndLogging_Parms
{
	struct FString Reason;
};

struct ACCInstanceGameInfo_execInitLogging_Parms
{
};

struct ACCInstanceGameInfo_eventPostBeginPlay_Parms
{
};// FUNC_Event

struct ACCInstanceGameInfo_execPreBeginPlay_Parms
{
};

struct ACCInstanceGameInfo_eventInitGame_Parms
{
	struct FString Options;
	struct FString ErrorMessage; // CPF_OutParm
};// FUNC_Event

struct ACCInstanceGameInfo_execCCGetLocalPlayerController_Parms
{
	class APlayerController* ReturnValue; // CPF_ReturnParm
};

struct ACCInstanceGameInfo_execSetGCPendingTime_Parms
{
	float NewTime;
};// FUNC_Native

struct ACCInstanceGameInfo_execEndWarmup_Parms
{
};// FUNC_Native

struct ACCInstanceGameInfo_execStartWarmup_Parms
{
};// FUNC_Native

struct ACCInstanceGameInfo_execSendStat_Parms
{
};// FUNC_Native

struct ACCInstanceGameInfo_execInstanceFinished_Parms
{
};// FUNC_Native

// (0x394 - 0x528)
class ACCInstanceGameInfo : public ACCGameInfo
{
public:
	void*                                              GameStats;                                   // 0x0394 (0x0004)
	struct FString                                     GameStatsClass;                              // 0x0398 (0x000C)
	int                                                SendGameStatsIndex;                          // 0x03A4 (0x0004)
	int                                                RemainingTime;                               // 0x03A8 (0x0004)
	int                                                ElapsedTime;                                 // 0x03AC (0x0004)
	class AActor*                                      EndGameFocus;                                // 0x03B0 (0x0004)
	float                                              EndTime;                                     // 0x03B4 (0x0004)
	int                                                EndMessageWait;                              // 0x03B8 (0x0004)
	int                                                EndMessageCounter;                           // 0x03BC (0x0004)
	int                                                RestartWait;                                 // 0x03C0 (0x0004)
	int                                                ResetCountDown;                              // 0x03C4 (0x0004)
	int                                                CountDown;                                   // 0x03C8 (0x0004)
	unsigned long                                      bStartedCountDown : 1;                       // 0x03CC (0x0004) [0x00000001]
	unsigned long                                      bFinalStartup : 1;                           // 0x03CC (0x0004) [0x00000002]
	unsigned long                                      bOverTimeBroadcast : 1;                      // 0x03CC (0x0004) [0x00000004]
	unsigned long                                      bPlayersMustBeReady : 1;                     // 0x03CC (0x0004) [0x00000008]
	unsigned long                                      bForceRespawn : 1;                           // 0x03CC (0x0004) [0x00000010]
	unsigned long                                      bTempForceRespawn : 1;                       // 0x03CC (0x0004) [0x00000020]
	unsigned long                                      bWaitForNetPlayers : 1;                      // 0x03CC (0x0004) [0x00000040]
	unsigned long                                      bMustJoinBeforeStart : 1;                    // 0x03CC (0x0004) [0x00000080]
	unsigned long                                      bPlayersVsBots : 1;                          // 0x03CC (0x0004) [0x00000100]
	unsigned long                                      bWarmupRound : 1;                            // 0x03CC (0x0004) [0x00000200]
	unsigned long                                      bTournament : 1;                             // 0x03CC (0x0004) [0x00000400]
	unsigned long                                      bQuickStart : 1;                             // 0x03CC (0x0004) [0x00000800]
	unsigned long                                      bConsoleServer : 1;                          // 0x03CC (0x0004) [0x00001000]
	unsigned long                                      bWaitingYaka : 1;                            // 0x03CC (0x0004) [0x00002000]
	unsigned long                                      bSuddenDeath : 1;                            // 0x03CC (0x0004) [0x00004000]
	unsigned long                                      FirstBlood : 1;                              // 0x03CC (0x0004) [0x00008000]
	unsigned long                                      TriggeredMinLeft5 : 1;                       // 0x03CC (0x0004) [0x00010000]
	unsigned long                                      TriggeredMinLeft3 : 1;                       // 0x03CC (0x0004) [0x00020000]
	unsigned long                                      TriggeredMinLeft1 : 1;                       // 0x03CC (0x0004) [0x00040000]
	unsigned long                                      TriggeredWarmLeft60 : 1;                     // 0x03CC (0x0004) [0x00080000]
	unsigned long                                      TriggeredWarmLeft30 : 1;                     // 0x03CC (0x0004) [0x00100000]
	unsigned long                                      TriggeredWarmLeft15 : 1;                     // 0x03CC (0x0004) [0x00200000]
	unsigned long                                      EnableGameStatsLog : 1;                      // 0x03CC (0x0004) [0x00400000]
	unsigned long                                      DemoRecording_Enabled : 1;                   // 0x03CC (0x0004) [0x00800000]
	float                                              EndTimeDelay;                                // 0x03D0 (0x0004)
	int                                                ResetTimeDelay;                              // 0x03D4 (0x0004)
	int                                                NetWait;                                     // 0x03D8 (0x0004)
	int                                                WarmupTime;                                  // 0x03DC (0x0004)
	int                                                WarmupRemaining;                             // 0x03E0 (0x0004)
	float                                              DeadActionCamControlDamage;                  // 0x03E4 (0x0004)
	int                                                MinWaitRespawnTime;                          // 0x03E8 (0x0004)
	int                                                MaxWaitRespawnTime;                          // 0x03EC (0x0004)
	int                                                NormalPlayerLiveTime;                        // 0x03F0 (0x0004)
	int                                                ForceRespawnTime;                            // 0x03F4 (0x0004)
	int                                                ProgressiveRespawn;                          // 0x03F8 (0x0004)
	unsigned char                                      StartUpStage;                                // 0x03FC (0x0001)
	int                                                DesiredPlayerCount;                          // 0x0400 (0x0004)
	float                                              BotRatio;                                    // 0x0404 (0x0004)
	int                                                MinNetPlayers;                               // 0x0408 (0x0004)
	class ANavigationPoint*                            LastPlayerStartSpot;                         // 0x040C (0x0004)
	class ANavigationPoint*                            LastStartSpot;                               // 0x0410 (0x0004)
	int                                                DefaultMaxLives;                             // 0x0414 (0x0004)
	class UClass*                                      ConsolePlayerControllerClass;                // 0x0418 (0x0004)
	void*                                              BotRoster;                                   // 0x041C (0x0004)
	class AController*                                 LastSpawnedPawnController;                   // 0x0420 (0x0004)
	void*                                              WeaponAttachmentPresetStore;                 // 0x0424 (0x0004)
	void*                                              GlobalInstanceParamsInstance;                // 0x0428 (0x0004)
	TArray< void* >                                    StoreInstances;                              // 0x042C (0x000C)
	class UClass*                                      DefaultBotPawnClass;                         // 0x0438 (0x0004)
	class UClass*                                      DefaultBotPawnIllusionClass;                 // 0x043C (0x0004)
	float                                              LastLoginTime;                               // 0x0440 (0x0004)
	float                                              FriendSpawnPriority;                         // 0x0444 (0x0004)
	float                                              EnemySpawnPriority;                          // 0x0448 (0x0004)
	float                                              MineSpawnPriority;                           // 0x044C (0x0004)
	float                                              FriendControlDistance;                       // 0x0450 (0x0004)
	float                                              EnemyControlDistance;                        // 0x0454 (0x0004)
	float                                              MineControlDistance;                         // 0x0458 (0x0004)
	float                                              FriendRejectDistance;                        // 0x045C (0x0004)
	int                                                FriendRejectFriendsLimit;                    // 0x0460 (0x0004)
	float                                              PStartRandomScore;                           // 0x0464 (0x0004)
	float                                              PStartNormalScore;                           // 0x0468 (0x0004)
	float                                              PStartBaseScore;                             // 0x046C (0x0004)
	float                                              PStartAvoidLastScore;                        // 0x0470 (0x0004)
	int                                                SuddenDeathTime;                             // 0x0474 (0x0004)
	float                                              MultiKillDeltaTime;                          // 0x0478 (0x0004)
	int                                                MultiKillScoreIncrement;                     // 0x047C (0x0004)
	int                                                MultiKillScoreStart;                         // 0x0480 (0x0004)
	int                                                FFAKillScoreIncrement;                       // 0x0484 (0x0004)
	int                                                HeadShotScore;                               // 0x0488 (0x0004)
	int                                                GranadeKillScore;                            // 0x048C (0x0004)
	int                                                LastBulletKillScore;                         // 0x0490 (0x0004)
	int                                                FirstBloodScore;                             // 0x0494 (0x0004)
	int                                                OneKillScore;                                // 0x0498 (0x0004)
	int                                                AssistScore;                                 // 0x049C (0x0004)
	int                                                MineKillScore;                               // 0x04A0 (0x0004)
	int                                                PenetrationScore;                            // 0x04A4 (0x0004)
	int                                                MeleeKillScore;                              // 0x04A8 (0x0004)
	int                                                DeathScore;                                  // 0x04AC (0x0004)
	int                                                MineDestroyScore;                            // 0x04B0 (0x0004)
	int                                                SuicideScore;                                // 0x04B4 (0x0004)
	int                                                MultiKillTeamScoreStart;                     // 0x04B8 (0x0004)
	int                                                MultiKillTeamScoreIncrement;                 // 0x04BC (0x0004)
	int                                                FFAKillTeamScoreIncrement;                   // 0x04C0 (0x0004)
	int                                                HeadShotTeamScore;                           // 0x04C4 (0x0004)
	int                                                GranadeKillTeamScore;                        // 0x04C8 (0x0004)
	int                                                LastBulletKillTeamScore;                     // 0x04CC (0x0004)
	int                                                FirstBloodTeamScore;                         // 0x04D0 (0x0004)
	int                                                OneKillTeamScore;                            // 0x04D4 (0x0004)
	int                                                AssistTeamScore;                             // 0x04D8 (0x0004)
	int                                                MineKillTeamScore;                           // 0x04DC (0x0004)
	int                                                MeleeKillTeamScore;                          // 0x04E0 (0x0004)
	int                                                PenetrationTeamScore;                        // 0x04E4 (0x0004)
	int                                                DeathTeamScore;                              // 0x04E8 (0x0004)
	int                                                MineDestroyTeamScore;                        // 0x04EC (0x0004)
	int                                                SuicideTeamScore;                            // 0x04F0 (0x0004)
	float                                              PickupTime;                                  // 0x04F4 (0x0004)
	float                                              PickupAssist;                                // 0x04F8 (0x0004)
	struct FString                                     DemoRecording_DemoName;                      // 0x04FC (0x000C)
	float                                              AssistDeltaTime;                             // 0x0508 (0x0004)
	int                                                BotKillCount;                                // 0x050C (0x0004)
	TArray< class ACCPlayerReplicationInfo* >          SortedPRIArray0;                             // 0x0510 (0x000C)
	TArray< class ACCPlayerReplicationInfo* >          SortedPRIArray1;                             // 0x051C (0x000C)

	// RoundOver
	// MatchOver
	// MatchInProgress
	// PendingMatch
	// WaitingYaka

private:
	static UClass* ClassPointer;

public:
	static UClass* StaticClass ()
	{
		if ( !ClassPointer )
			ClassPointer = UObject::FindClass( "Class CrimeCraft.CCInstanceGameInfo" );

		return ClassPointer;
	};

public:
	void CheckNPCIndicators ()
	{
		static UFunction* pfnCheckNPCIndicators = NULL;

		if ( !pfnCheckNPCIndicators )
			pfnCheckNPCIndicators = UObject::FindObject< UFunction >( "Function CrimeCraft.CCInstanceGameInfo.CheckNPCIndicators" );

		ACCInstanceGameInfo_execCheckNPCIndicators_Parms CheckNPCIndicators_Parms;

		this->ProcessEvent( pfnCheckNPCIndicators, &CheckNPCIndicators_Parms, NULL );
	};

	void PatchLootTable ( class UClass* Item, float Prob/*CPF_OptionalParm*/, int Count/*CPF_OptionalParm*/, TArray< struct FLootTableEntry >* table )
	{
		static UFunction* pfnPatchLootTable = NULL;

		if ( !pfnPatchLootTable )
