/////////////////////////////////////////////////////////////////////////////
// Unreal Engine MiniSDK Generator by uNrEaL
// Game: CrimeCraft
// File: ACCLobbyController.h
// Date: 06/16/2011 @ 05:19:41.783
/////////////////////////////////////////////////////////////////////////////

#ifdef _MSC_VER
#pragma pack( push, 4 )
#endif

struct ACCLobbyController_execTriggerAllSequenceEvents_Parms
{
	class UClass* SeqEventClass;
};

struct ACCLobbyController_execTestShowGame_Parms
{
};// FUNC_Exec

struct ACCLobbyController_execSetTutorialStep_Parms
{
	int Step;
};// FUNC_Exec

struct ACCLobbyController_execFinishTutorial_Parms
{
};// FUNC_Exec

struct ACCLobbyController_execTEST_ClearAllPrefabs_Parms
{
};// FUNC_Exec

struct ACCLobbyController_execTEST_SpawnPrefab_Parms
{
};// FUNC_Exec

struct ACCLobbyController_eventGetClubPrefabManager_Parms
{
	void* ReturnValue; // CPF_ReturnParm
};// FUNC_Event

struct ACCLobbyController_execDestroyPrefabDataNative_Parms
{
	void* PrefabInst;
	class AActor* ReturnValue; // CPF_ReturnParm
};// FUNC_Native

struct ACCLobbyController_execCreatePrefabDataFromPrefabNative_Parms
{
	struct FVector Loc;
	struct FRotator Rot;
	void* P;
	class AActor* ReturnValue; // CPF_ReturnParm
};// FUNC_Native

struct ACCLobbyController_execTEST_EquipItems_Parms
{
};// FUNC_Exec

struct ACCLobbyController_execFindNextStep_Parms
{
	void* T;
	int Id;
};

struct ACCLobbyController_execAnalizeTutorial_Parms
{
};// FUNC_Exec

struct ACCLobbyController_execPrintAlloc_Parms
{
};// FUNC_Exec

struct ACCLobbyController_execPrintAllocatedObjsCount_Parms
{
};// FUNC_Native

struct ACCLobbyController_execSprintLobby_Parms
{
	unsigned long SprintOn : 1;
};// FUNC_Exec

struct ACCLobbyController_execRemoveFromABaseYStack_Parms
{
	unsigned char Type;
};

struct ACCLobbyController_execTriggerEternalRunning_Parms
{
};// FUNC_Exec

struct ACCLobbyController_execaStrafeLobby_Parms
{
	float Speed;
	unsigned long isDown : 1;
};// FUNC_Exec

struct ACCLobbyController_execaBaseYLobby_Parms
{
	float Speed;
	unsigned long isDown : 1;
	unsigned char Type;
};// FUNC_Exec

struct ACCLobbyController_execToggleCharacterMarking_Parms
{
	unsigned long isDown : 1;
};// FUNC_Exec

struct ACCLobbyController_execUpdateMovementInputEntry_Parms
{
	struct FMovementInputInfoEntry Entry; // CPF_OutParm
	float Value;
	float ReturnValue; // CPF_ReturnParm
};

struct ACCLobbyController_execStaticSgn_Parms
{
	float A;
	int ReturnValue; // CPF_ReturnParm
};

struct ACCLobbyController_execUpdateMovementInput_Parms
{
	float Forward;
	float Strafe;
	float ProcessedForward; // CPF_OutParm
	float ProcessedStrafe; // CPF_OutParm
};

struct ACCLobbyController_execResetMovementInputEntry_Parms
{
	struct FMovementInputInfoEntry Entry; // CPF_OutParm
};

struct ACCLobbyController_execResetMovementInput_Parms
{
};

struct ACCLobbyController_execRemoveHighlight_Parms
{
};

struct ACCLobbyController_execHighlightWithColor_Parms
{
	struct FLinearColor clr;
};

struct ACCLobbyController_eventDestroyed_Parms
{
};// FUNC_Event

struct ACCLobbyController_exectutorial_init_Parms
{
};

struct ACCLobbyController_execonTutorialStatusChanged_Parms
{
	unsigned char EventId;
	void* InExtendedParams;
};

struct ACCLobbyController_execonTournamentUpdated_Parms
{
	unsigned char EventId;
	void* InExtendedParams;
};

struct ACCLobbyController_execStartLoadingProcess_Parms
{
	unsigned long bStart : 1;
};

struct ACCLobbyController_execOnRequestBuyItem_Parms
{
	int TemplateId;
	int stackId;
};

struct ACCLobbyController_eventPlayerTick_Parms
{
	float DeltaTime;
};// FUNC_Event

struct ACCLobbyController_execSetNewSpeed_Parms
{
	float NewSpeed;
};// FUNC_Exec

struct ACCLobbyController_eventPossess_Parms
{
	class APawn* aPawn;
	unsigned long bVehicleTransition : 1;
};// FUNC_Event

struct ACCLobbyController_execSetCHPublicAccess_Parms
{
	unsigned long InDoAllow : 1;
};// FUNC_Exec

struct ACCLobbyController_execCmdCraftRoomLeft_Parms
{
};// FUNC_Exec FUNC_Native

struct ACCLobbyController_execCmdCraftRoomEntered_Parms
{
};// FUNC_Exec FUNC_Native

struct ACCLobbyController_execLeaveClanHall_Parms
{
};// FUNC_Exec FUNC_Native

struct ACCLobbyController_execGoToClanHall_Parms
{
	struct FString InClanName;
};// FUNC_Exec FUNC_Native

struct ACCLobbyController_execGoToMyClanHall_Parms
{
};// FUNC_Exec FUNC_Native

struct ACCLobbyController_execGoToInstance_Parms
{
};// FUNC_Exec FUNC_Native

struct ACCLobbyController_execChangeWeapon_Parms
{
	int WeaponNum;
};// FUNC_Exec

struct ACCLobbyController_execAddSimulatedPlayer_Parms
{
	int Count;
};// FUNC_Exec

struct ACCLobbyController_execOnRBMousePress_Parms
{
};// FUNC_Exec

struct ACCLobbyController_execRestoreMtl_Parms
{
	struct FString MtlName;
};// FUNC_Exec

struct ACCLobbyController_execSetMtl_Parms
{
	struct FString MtlName;
};// FUNC_Exec

struct ACCLobbyController_execSpawnTutorial_Parms
{
	struct FString InTitle;
	struct FString InText;
};// FUNC_Exec

struct ACCLobbyController_execOnLBMousePress_Parms
{
};// FUNC_Exec

struct ACCLobbyController_execRessurect_Parms
{
};// FUNC_Exec

struct ACCLobbyController_execFatality_Parms
{
};// FUNC_Exec

struct ACCLobbyController_execSuicide_Parms
{
};// FUNC_Exec

struct ACCLobbyController_execZoomIn_Parms
{
};// FUNC_Exec

struct ACCLobbyController_execZoomOut_Parms
{
};// FUNC_Exec

struct ACCLobbyController_execOnRollingRelease_Parms
{
};// FUNC_Exec

struct ACCLobbyController_execCheckForAdmireFinish_Parms
{
};// FUNC_Exec

struct ACCLobbyController_execOnRollingPress_Parms
{
};// FUNC_Exec

struct ACCLobbyController_execOnTabReleased_Parms
{
};// FUNC_Exec

struct ACCLobbyController_execOnTabPressed_Parms
{
};// FUNC_Exec

struct ACCLobbyController_execZoomCamera_Parms
{
	float ZoomDir;
};

struct ACCLobbyController_execApplyRotation_Parms
{
	struct FRotator DeltaRotation;
	float DeltaTime;
};

struct ACCLobbyController_execApplyAcceleration_Parms
{
	struct FVector NewAcceleration;
	float DeltaTime;
};

struct ACCLobbyController_execReplicateMovement_Parms
{
};// FUNC_Native

struct ACCLobbyController_execDetermineAcceleration_Parms
{
	unsigned char MoveDir;
	struct FVector out_NewAcceleration; // CPF_OutParm
};// FUNC_Native

struct ACCLobbyController_execAbortSprint_Parms
{
};

struct ACCLobbyController_execGoToSprintState_Parms
{
};

struct ACCLobbyController_execstartsprint_Parms
{
};

struct ACCLobbyController_execSittingProcessMove_Parms
{
	float DeltaTime;
};

struct ACCLobbyController_execFacePawnRotation_Parms
{
	struct FRotator NewRotation;
	float DeltaTime;
};

struct ACCLobbyController_execPopulationTesterToggleMovement_Parms
{
};// FUNC_Exec

struct ACCLobbyController_execPopulateLobby_Parms
{
	int Count;
	float Density;
};// FUNC_Exec

struct ACCLobbyController_eventPostBeginPlay_Parms
{
};// FUNC_Event

struct ACCLobbyController_execnative_AddSimulatedPlayer_Parms
{
	int Count;
};// FUNC_Native

struct ACCLobbyController_execTeleportToInstance_Parms
{
};// FUNC_Native

// (0x774 - 0x7F4)
class ACCLobbyController : public ACCController
{
public:
	int                                                SelectedInstance;                            // 0x0774 (0x0004)
	struct FRotator                                    LockedRotation;                              // 0x0778 (0x000C)
	float                                              FirstInstanceTime;                           // 0x0784 (0x0004)
	float                                              FirstInstanceDelay;                          // 0x0788 (0x0004)
	void*                                              LobbyAvatar;                                 // 0x078C (0x0004)
	int                                                TriggerActiveLobbyExitId;                    // 0x0790 (0x0004)
	int                                                LobbyExitHintIndex;                          // 0x0794 (0x0004)
	struct FVector                                     LastReplicatedLocation;                      // 0x0798 (0x000C)
	struct FVector                                     LastReplicatedVelocity;                      // 0x07A4 (0x000C)
	float                                              AccumulatedTime;                             // 0x07B0 (0x0004)
	int                                                LastReplicatedYaw;                           // 0x07B4 (0x0004)
	unsigned long                                      bLastReplicatedVelocityIs0 : 1;              // 0x07B8 (0x0004) [0x00000001]
	unsigned long                                      bIsSprintEnabledByKey : 1;                   // 0x07B8 (0x0004) [0x00000002]
	void*                                              PopulationTester;                            // 0x07BC (0x0004)
	void*                                              TutorialInst;                                // 0x07C0 (0x0004)
	void*                                              TutorialTemplate1;                           // 0x07C4 (0x0004)
	void*                                              TutorialTemplate2;                           // 0x07C8 (0x0004)
	void*                                              TutorialTemplate3;                           // 0x07CC (0x0004)
	void*                                              ClubPrefabManager;                           // 0x07D0 (0x0004)
	struct FMovementInputInfo                          MovementInputInfoStruct;                     // 0x07D4 (0x0018)
	float                                              MovementInputCooldownTime;                   // 0x07EC (0x0004)
	float                                              SprintTopSpeed;                              // 0x07F0 (0x0004)

	// CCDebugSpectating
	// CCAIDebugSpectating
	// Sprint
	// PlayerWalking
	// VIPSittingLogic
	// SittingLogic
	// PlayerWaiting

private:
	static UClass* ClassPointer;

public:
	static UClass* StaticClass ()
	{
		if ( !ClassPointer )
			ClassPointer = UObject::FindClass( "Class CrimeCraft.CCLobbyController" );

		return ClassPointer;
	};

public:
	void TriggerAllSequenceEvents ( class UClass* SeqEventClass )
	{
		static UFunction* pfnTriggerAllSequenceEvents = NULL;

		if ( !pfnTriggerAllSequenceEvents )
			pfnTriggerAllSequenceEvents = UObject::FindObject< UFunction >( "Function CrimeCraft.CCLobbyController.TriggerAllSequenceEvents" );

		ACCLobbyController_execTriggerAllSequenceEvents_Parms TriggerAllSequenceEvents_Parms;
		TriggerAllSequenceEvents_Parms.SeqEventClass = SeqEventClass;

		this->ProcessEvent( pfnTriggerAllSequenceEvents, &TriggerAllSequenceEvents_Parms, NULL );
	};

	void TestShowGame ()
	{
