/////////////////////////////////////////////////////////////////////////////
// Unreal Engine MiniSDK Generator by uNrEaL
// Game: CrimeCraft
// File: ACCProj_SpiralRocketAI_Homing.h
// Date: 06/16/2011 @ 05:19:42.83
/////////////////////////////////////////////////////////////////////////////

#ifdef _MSC_VER
#pragma pack( push, 4 )
#endif

struct ACCProj_SpiralRocketAI_Homing_execIsSameTeamWith_Parms
{
	class AActor* A;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCProj_SpiralRocketAI_Homing_execCalcHuntingEnemySplineCollision_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final

struct ACCProj_SpiralRocketAI_Homing_execCalcHuntingEnemySplineTime_Parms
{
	float ReturnValue; // CPF_ReturnParm
};// FUNC_Final

struct ACCProj_SpiralRocketAI_Homing_execCalcHuntingEnemySplineFinishVelocity_Parms
{
	struct FVector ReturnValue; // CPF_ReturnParm
};// FUNC_Final

struct ACCProj_SpiralRocketAI_Homing_execCalcHuntingEnemySpline_Parms
{
	unsigned long bForceRecalculation : 1;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final

struct ACCProj_SpiralRocketAI_Homing_execSendEnemyInfo_Parms
{
};// FUNC_Final

struct ACCProj_SpiralRocketAI_Homing_execStartedNewEnemyHunting_Parms
{
};// FUNC_Final

struct ACCProj_SpiralRocketAI_Homing_execReStartHunting_Parms
{
	struct FEnemyInfo newEnemy;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final

struct ACCProj_SpiralRocketAI_Homing_execStartHunting_Parms
{
	struct FEnemyInfo newEnemy;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final

struct ACCProj_SpiralRocketAI_Homing_execTryRePeekEnemy_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCProj_SpiralRocketAI_Homing_execTryPeekEnemy_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCProj_SpiralRocketAI_Homing_execCanBeMyEnemyByAngle_Parms
{
	struct FEnemyInfo P;
	float UsedMaxEnemyAngleHor;
	float UsedMaxEnemyAngleVer;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final

struct ACCProj_SpiralRocketAI_Homing_execCanBeMyEnemyByLocation_Parms
{
	struct FEnemyInfo P;
	float UsedMaxEnemyDist;
	float UsedMaxEnemyAngleHor;
	float UsedMaxEnemyAngleVer;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final

struct ACCProj_SpiralRocketAI_Homing_execCanBeMyEnemyByPawnState_Parms
{
	struct FEnemyInfo P;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final

struct ACCProj_SpiralRocketAI_Homing_execCanBeMyEnemyByTeam_Parms
{
	struct FEnemyInfo P;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final

struct ACCProj_SpiralRocketAI_Homing_execCanBeMyEnemyByTrace_Parms
{
	struct FEnemyInfo P;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final

struct ACCProj_SpiralRocketAI_Homing_execSelectNearestEnemy_Parms
{
	TArray< struct FEnemyInfo > Enemies; // CPF_OutParm
	struct FEnemyInfo ReturnValue; // CPF_ReturnParm
};// FUNC_Final

struct ACCProj_SpiralRocketAI_Homing_execFindBestEnemies_Parms
{
	TArray< struct FEnemyInfo > BestEnemies; // CPF_OutParm
};// FUNC_Final

struct ACCProj_SpiralRocketAI_Homing_execAppendEnemyCandidates_Parms
{
	TArray< struct FEnemyInfo > candidates; // CPF_OutParm
	TArray< struct FEnemyInfo > Candidates2; // CPF_OutParm
};// FUNC_Final

struct ACCProj_SpiralRocketAI_Homing_execSelectEnemyCandidatesInRadius_Parms
{
	float MaxDistance;
	TArray< struct FEnemyInfo > IgnoredCandidates; // CPF_OutParm
	TArray< struct FEnemyInfo > candidates; // CPF_OutParm
};// FUNC_Final

struct ACCProj_SpiralRocketAI_Homing_execSelectBestEnemies_Parms
{
	TArray< struct FEnemyInfo > candidates; // CPF_OutParm
	TArray< struct FEnemyInfo > BestCandidates; // CPF_OutParm
};// FUNC_Final

struct ACCProj_SpiralRocketAI_Homing_execIsMainGoalCandidate_Parms
{
	struct FEnemyInfo Candidate; // CPF_OutParm
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final

struct ACCProj_SpiralRocketAI_Homing_execCalcAllMainGoalRequeiredRockets_Parms
{
	int ReturnValue; // CPF_ReturnParm
};// FUNC_Final

struct ACCProj_SpiralRocketAI_Homing_execCalcHowManyFriendsHasHadNoTarget_Parms
{
	int ReturnValue; // CPF_ReturnParm
};

struct ACCProj_SpiralRocketAI_Homing_execCalcHowManyFriendsHasThisEnemy_Parms
{
	struct FEnemyInfo ThisEnemy;
	int ReturnValue; // CPF_ReturnParm
};// FUNC_Final

struct ACCProj_SpiralRocketAI_Homing_execSyncMainGoalInfoStructToAll_Parms
{
};// FUNC_Final

struct ACCProj_SpiralRocketAI_Homing_execDecreaseMainGoalInfoStructRocketsFor_Parms
{
	struct FEnemyInfo Candidate; // CPF_OutParm
};// FUNC_Final

struct ACCProj_SpiralRocketAI_Homing_execStaticDrawMainGoalInfoDebug2_Parms
{
	struct FMainGoalInfo TheMainGoalInfoStruct; // CPF_OutParm
};// FUNC_Final

struct ACCProj_SpiralRocketAI_Homing_execStaticDrawMainGoalInfoDebug_Parms
{
	class ACCInstancePawn* TraceOwner;
	struct FMainGoalInfo TheMainGoalInfoStruct; // CPF_OutParm
};// FUNC_Final

struct ACCProj_SpiralRocketAI_Homing_execStaticSortMainGoalEntries_Parms
{
	struct FMainGoalInfo TheMainGoalInfoStruct; // CPF_OutParm
};// FUNC_Final

struct ACCProj_SpiralRocketAI_Homing_execStaticCalcMainGoalInfo_Parms
{
	class ACCInstancePawn* TraceOwner;
	struct FVector TheLocation;
	struct FVector Direction;
	float MaxRange;
	float MaxAngle;
	float MaxDistanceToRay;
	int MainGoalRockets;
	int MaxRocketsPerGoal;
	struct FMainGoalInfo ResultMainGoalInfoStruct; // CPF_OutParm
};// FUNC_Final

struct ACCProj_SpiralRocketAI_Homing_execStaticComputeRocketsMainGoalInfo_Parms
{
	TArray< class ACCProj_SpiralRocket* > Rockets; // CPF_OutParm
	class ACCInstancePawn* TraceOwner;
	struct FVector TheLocation;
	struct FVector Direction;
	float MaxRange;
	float MaxAngle;
	float MaxDistanceToRay;
	int MainGoalRockets;
	int MaxRocketsPerGoal;
};

struct ACCProj_SpiralRocketAI_Homing_execSetPropsFromWeapon_Parms
{
	class ACCWeapon* Wpn;
};

// (0x1C8 - 0x254)
class ACCProj_SpiralRocketAI_Homing : public ACCProj_SpiralRocketAI
{
public:
	struct FMainGoalInfo                               MainGoalInfoStruct;                          // 0x01C8 (0x000C)
	unsigned long                                      bOneRocketPerEnemy : 1;                      // 0x01D4 (0x0004) [0x00000001]
	unsigned long                                      bHadNoTarget : 1;                            // 0x01D4 (0x0004) [0x00000002]
	unsigned long                                      bEnemyHuntNeedsExplosion : 1;                // 0x01D4 (0x0004) [0x00000004]
	float                                              MaxEnemyDist1;                               // 0x01D8 (0x0004)
	float                                              MaxEnemyDist2;                               // 0x01DC (0x0004)
	float                                              MaxEnemyDetectAngleHorizontal;               // 0x01E0 (0x0004)
	float                                              MaxEnemyDetectAngleVertical;                 // 0x01E4 (0x0004)
	float                                              MaxEnemyAngle;                               // 0x01E8 (0x0004)
	float                                              MinRotationRadius;                           // 0x01EC (0x0004)
	float                                              OptimalRotationRadius;                       // 0x01F0 (0x0004)
	float                                              Hunting_CollisionCheckLength;                // 0x01F4 (0x0004)
	float                                              Hunting_CollisionCheckTimeDelta;             // 0x01F8 (0x0004)
	float                                              Hunting_CollisionCheckTimeStep;              // 0x01FC (0x0004)
	float                                              LastHuntingEnemyTime;                        // 0x0200 (0x0004)
	struct FEnemyInfo                                  MyEnemy;                                     // 0x0204 (0x000C)
	struct FInterpolationSpline                        HuntingEnemySpline;                          // 0x0210 (0x0038)
	struct FVector                                     MyEnemyBaseLocation;                         // 0x0248 (0x000C)

	// HuntingEnemy
	// Idle

private:
	static UClass* ClassPointer;

public:
	static UClass* StaticClass ()
	{
		if ( !ClassPointer )
			ClassPointer = UObject::FindClass( "Class CrimeCraft.CCProj_SpiralRocketAI_Homing" );

		return ClassPointer;
	};

public:
	bool IsSameTeamWith ( class AActor* A )
	{
		static UFunction* pfnIsSameTeamWith = NULL;

		if ( !pfnIsSameTeamWith )
			pfnIsSameTeamWith = UObject::FindObject< UFunction >( "Function CrimeCraft.CCProj_SpiralRocketAI_Homing.IsSameTeamWith" );

		ACCProj_SpiralRocketAI_Homing_execIsSameTeamWith_Parms IsSameTeamWith_Parms;
		IsSameTeamWith_Parms.A = A;

		this->ProcessEvent( pfnIsSameTeamWith, &IsSameTeamWith_Parms, NULL );

		return IsSameTeamWith_Parms.ReturnValue;
	};

	bool CalcHuntingEnemySplineCollision ()
	{
		static UFunction* pfnCalcHuntingEnemySplineCollision = NULL;

		if ( !pfnCalcHuntingEnemySplineCollision )
