/////////////////////////////////////////////////////////////////////////////
// Unreal Engine MiniSDK Generator by uNrEaL
// Game: CrimeCraft
// File: ACCProjectile.h
// Date: 06/16/2011 @ 05:19:41.579
/////////////////////////////////////////////////////////////////////////////

#ifdef _MSC_VER
#pragma pack( push, 4 )
#endif

struct ACCProjectile_eventGetShouldTracePawn_Parms
{
	class ACCInstancePawn* P;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Event

struct ACCProjectile_execSplash_Parms
{
	struct FVector HurtOrigin;
	float Radius;
	float BlindeTime;
	struct FName EffectName;
};

struct ACCProjectile_eventCreateProjectileLight_Parms
{
	void* AttachmentPreset;
};// FUNC_Event

struct ACCProjectile_execDestroyFlightEffects_Parms
{
};

struct ACCProjectile_execSpawnFlightEffects_Parms
{
	void* AttachmentPreset;
};

struct ACCProjectile_execInitVisualPart_Parms
{
	void* AttachmentPreset;
};

struct ACCProjectile_execMergeEffectsInfo_Parms
{
	struct FWeaponTypeEffect efCur;
	struct FWeaponTypeEffect efParent;
	struct FWeaponTypeEffect ReturnValue; // CPF_ReturnParm
};

struct ACCProjectile_execIsConsistent_Parms
{
	struct FWeaponTypeEffect wef;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCProjectile_execGetSpecificHitEffect_Parms
{
	void* WeaponEffInfo;
	unsigned char EffectType;
	struct FWeaponTypeEffect ReturnValue; // CPF_ReturnParm
};

struct ACCProjectile_execGetHitEffect_Parms
{
	void* PMaterial;
	struct FWeaponTypeEffect prevVal;
	unsigned char EffectType;
	struct FWeaponTypeEffect ReturnValue; // CPF_ReturnParm
};

struct ACCProjectile_execCalcRotationForEffectEmitter_Parms
{
	struct FVector EffectHitNormal;
	struct FRotator ReturnValue; // CPF_ReturnParm
};

struct ACCProjectile_execSpawnHitEffectEmitter_Parms
{
	class AActor* CalledFrom;
	struct FVector EffectHitLocation;
	struct FVector EffectHitNormal;
	void* NewPS;
	float NewPSLifeTime;
};

struct ACCProjectile_execPlayActualHitEffect_Parms
{
	class AActor* CalledFrom;
	class AActor* HitActor;
	struct FVector HitLocation;
	struct FVector EffectHitLocation;
	struct FVector EffectHitNormal;
	struct FTraceHitInfo HitInfo;
	unsigned char EffectType;
	void* TheDefaultExplosionPS;
	float TheDefaultExplosionPSLifeTime;
	void* TheDefaultExplosionSound;
	unsigned long bTheForceDefaultHitEffects : 1;
	void* EffectPS2;
	float EffectPS2LifeTime;
};

struct ACCProjectile_execSpawnMissExplosionEffects_Parms
{
	struct FVector HitLocation;
	struct FVector HitNormal;
};

struct ACCProjectile_execSpawnExplosionEffects_Parms
{
	struct FVector HitLocation;
	struct FVector HitNormal;
};

struct ACCProjectile_execComputeDamageScaleFor_Parms
{
	float HurtDistance;
	float ReturnValue; // CPF_ReturnParm
};

struct ACCProjectile_execProcessRadiusDamage_Parms
{
	class AActor* Victim;
	class AController* InstigatedBy;
	struct FVector HurtOrigin;
	unsigned long bHit : 1;
};

struct ACCProjectile_execProjectileHurtRadius_Parms
{
	struct FVector HurtOrigin;
	struct FVector HitNormal;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCProjectile_execDoShutDown_Parms
{
};

struct ACCProjectile_execDestroyed_Parms
{
};

struct ACCProjectile_execPerformExplosion_Parms
{
	struct FVector HitLocation;
	struct FVector HitNormal;
};

struct ACCProjectile_execExplodeInternal_Parms
{
	struct FVector HitLocation;
	struct FVector HitNormal;
};

struct ACCProjectile_execProjectileExplosionTimer_Parms
{
};

struct ACCProjectile_eventLanded_Parms
{
	struct FVector HitNormal;
	class AActor* FloorActor;
};// FUNC_Event

struct ACCProjectile_eventHitWall_Parms
{
	struct FVector HitNormal;
	class AActor* Wall;
	class UPrimitiveComponent* WallComp;
};// FUNC_Event

struct ACCProjectile_execDoProcessTouch_Parms
{
	class AActor* Other;
	struct FVector HitLocation;
	struct FVector HitNormal;
};

struct ACCProjectile_execConditionalProcessPendingTouch_Parms
{
};

struct ACCProjectile_execSetPendingTouch_Parms
{
	class AActor* Other;
	struct FVector HitLocation;
	struct FVector HitNormal;
};

struct ACCProjectile_execTouchesActor_Parms
{
	class AActor* Other;
	class UPrimitiveComponent* OtherComp;
	struct FVector HitLocation;
	struct FVector HitNormal;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCProjectile_eventTouch_Parms
{
	class AActor* Other;
	class UPrimitiveComponent* OtherComp;
	struct FVector HitLocation;
	struct FVector HitNormal;
};// FUNC_Event

struct ACCProjectile_execInitReplicatedVars_Parms
{
};

struct ACCProjectile_execPostInit_Parms
{
};

struct ACCProjectile_execFallProj_Parms
{
};

struct ACCProjectile_execCustomInit_Parms
{
	struct FVector Direction;
	struct FCustomProjectileFire SourceInfo;
};

struct ACCProjectile_execInitByWeapon_Parms
{
	class ACCWeapon* Wpn;
};

struct ACCProjectile_execInit_Parms
{
	struct FVector Direction;
	class AWeapon* SourceWeapon;
};

struct ACCProjectile_execStaticCustomInitProjectile_Parms
{
	class ACCProjectile* NewProjectile;
	struct FVector Direction;
	struct FCustomProjectileFire SourceInfo;
};

struct ACCProjectile_eventReplicatedEvent_Parms
{
	struct FName VarName;
};// FUNC_Event

struct ACCProjectile_execTickLocationDebugInternal_Parms
{
	float Delta;
};

struct ACCProjectile_execTickLocationDebug_Parms
{
	float Delta;
};

struct ACCProjectile_eventTick_Parms
{
	float Delta;
};// FUNC_Event

struct ACCProjectile_eventPostBeginPlay_Parms
{
};// FUNC_Event

// (0x254 - 0x358)
class ACCProjectile : public ACCProjectileBase
{
public:
	float                                              MaxEffectDistance;                           // 0x0254 (0x0004)
	void*                                              ProjectileStaticMesh;                        // 0x0258 (0x0004)
	class USkeletalMeshComponent*                      ProjectileSkeletalMesh;                      // 0x025C (0x0004)
	void*                                              FlightPSC;                                   // 0x0260 (0x0004)
	class UClass*                                      ProjectileLightClass;                        // 0x0264 (0x0004)
	void*                                              ProjectileLight;                             // 0x0268 (0x0004)
	float                                              SplashRadius;                                // 0x026C (0x0004)
	float                                              SplashPSLifeTime;                            // 0x0270 (0x0004)
	struct FString                                     SplashPSName;                                // 0x0274 (0x000C)
	void*                                              SplashPS;                                    // 0x0280 (0x0004)
	unsigned long                                      bSplashDirection : 1;                        // 0x0284 (0x0004) [0x00000001]
	unsigned long                                      bForceDefaultHitEffects : 1;                 // 0x0284 (0x0004) [0x00000002]
	unsigned long                                      bDoZeroDamage : 1;                           // 0x0284 (0x0004) [0x00000004]
	unsigned long                                      bDoSelfDamage : 1;                           // 0x0284 (0x0004) [0x00000008]
	unsigned long                                      bReplicateDebugLocation : 1;                 // 0x0284 (0x0004) [0x00000010]
	unsigned long                                      bExplodeOnFirstTouch : 1;                    // 0x0284 (0x0004) [0x00000020]
	unsigned long                                      ExplodeOnEnemy : 1;                          // 0x0284 (0x0004) [0x00000040]
	unsigned long                                      bInConditonalProcessPendingTouch : 1;        // 0x0284 (0x0004) [0x00000080]
	struct FName                                       SplashPostProcess;                           // 0x0288 (0x0008)
	float                                              SplashCoef;                                  // 0x0290 (0x0004)
	unsigned char                                      WeaponEffectType;                            // 0x0294 (0x0001)
	unsigned char                                      PrevLocationDebugR;                          // 0x0295 (0x0001)
	unsigned char                                      PrevLocationDebugG;                          // 0x0296 (0x0001)
	unsigned char                                      PrevLocationDebugB;                          // 0x0297 (0x0001)
	unsigned char                                      ReflectionDamageEffectorType;                // 0x0298 (0x0001)
	void*                                              DefaultExplosionPS;                          // 0x029C (0x0004)
	float                                              DefaultExplosionPSLifeTime;                  // 0x02A0 (0x0004)
	void*                                              DefaultExplosionSound;                       // 0x02A4 (0x0004)
	struct FString                                     DefaultExplosionSoundString;                 // 0x02A8 (0x000C)
	void*                                              MissExplosionPS;                             // 0x02B4 (0x0004)
	void*                                              MissExplosionSound;                          // 0x02B8 (0x0004)
	struct FString                                     MissExplosionSoundString;                    // 0x02BC (0x000C)
	float                                              MissExplosionPSLifeTime;                     // 0x02C8 (0x0004)
	float                                              ImpulseKoef;                                 // 0x02CC (0x0004)
	float                                              AirFrictionPower;                            // 0x02D0 (0x0004)
	float                                              AirFrictionDelay;                            // 0x02D4 (0x0004)
	float                                              DamageRadiusKoef;                            // 0x02D8 (0x0004)
	float                                              ReplicatedDamageRadius;                      // 0x02DC (0x0004)
	float                                              ReplicatedDamageRadiusMin;                   // 0x02E0 (0x0004)
	struct FVector                                     PrevLocation;                                // 0x02E4 (0x000C)
	float                                              AltProjFireDist;                             // 0x02F0 (0x0004)
	float                                              ReflectionMomentum;                          // 0x02F4 (0x0004)
	float                                              ReflectionDamage;                            // 0x02F8 (0x0004)
	struct FVector                                     DebugLocation;                               // 0x02FC (0x000C)
	void*                                              FlightEmitter;                               // 0x0308 (0x0004)
	float                                              LifePoints;                                  // 0x030C (0x0004)
	float                                              DamageRadiusMin;                             // 0x0310 (0x0004)
	float                                              WeaponPenetrationModifier_FROM_PROJECTILE;   // 0x0314 (0x0004)
	struct FVector                                     ProjDirection;                               // 0x0318 (0x000C)
	float                                              AccelerationTime;                            // 0x0324 (0x0004)
	float                                              ProjMaxSpeed;                                // 0x0328 (0x0004)
	struct FTakeHitSpeedModifierInfo                   TheTakeHitSpeedModifierInfo;                 // 0x032C (0x000C)
	struct FPendingTouchInfo                           PendingTouchInfoStruct;                      // 0x0338 (0x0020)

private:
	static UClass* ClassPointer;

public:
	static UClass* StaticClass ()
	{
		if ( !ClassPointer )
			ClassPointer = UObject::FindClass( "Class CrimeCraft.CCProjectile" );

		return ClassPointer;
	};

public:
	bool eventGetShouldTracePawn ( class ACCInstancePawn* P )
	{
		static UFunction* pfnGetShouldTracePawn = NULL;

		if ( !pfnGetShouldTracePawn )
			pfnGetShouldTracePawn = UObject::FindObject< UFunction >( "Function CrimeCraft.CCProjectile.GetShouldTracePawn" );

		ACCProjectile_eventGetShouldTracePawn_Parms GetShouldTracePawn_Parms;
		GetShouldTracePawn_Parms.P = P;

		this->ProcessEvent( pfnGetShouldTracePawn, &GetShouldTracePawn_Parms, NULL );

		return GetShouldTracePawn_Parms.ReturnValue;
	};

	void Splash ( struct FVector HurtOrigin, float Radius, float BlindeTime, struct FName EffectName )
	{
		static UFunction* pfnSplash = NULL;

		if ( !pfnSplash )
