/////////////////////////////////////////////////////////////////////////////
// Unreal Engine MiniSDK Generator by uNrEaL
// Game: CrimeCraft
// File: ACCPawn.h
// Date: 06/16/2011 @ 05:19:40.60
/////////////////////////////////////////////////////////////////////////////

#ifdef _MSC_VER
#pragma pack( push, 4 )
#endif

#define Const_MAX_AAI_RELEVANCY_TIME               2.0f
#define Const_AdditionalAnimInfo_MaxRotatorParameters 2
#define Const_AdditionalAnimInfo_MaxVectorParameters 2
#define Const_AdditionalAnimInfo_MaxMeshParameters 2

enum EMoveMode
{
	MOVE_RUN = 0,
	MOVE_CROUCH = 1,
	MOVE_SPRINT = 2,
	MOVE_PANIC = 3,
	MOVE_WALK = 4,
	MOVE_ROLLING = 5,
	MOVE_MELEE = 6,
	MOVE_MAX = 7
};

enum ECCD_IKLerpingMode
{
	ECCDIK_None = 0,
	ECCDIK_LerpIntoSpot = 1,
	ECCDIK_LerpOutFromSpot = 2,
	ECCDIK_MAX = 3
};

struct ACCPawn_execResetTurnNodes_Parms
{
	struct FRotator ResetRot;
};

struct ACCPawn_eventrealmClubStandupImmediately_Parms
{
};// FUNC_Event

struct ACCPawn_eventrealmClubStandupLatent_Parms
{
};// FUNC_Event

struct ACCPawn_eventrealmClubSitdownImmediately_Parms
{
	void* SitableActor;
	int SitdownType;
	int AnimIndex;
};// FUNC_Event

struct ACCPawn_eventrealmClubSitdownLatent_Parms
{
	void* SitableActor;
	int SitdownType;
	int AnimIndex;
};// FUNC_Event

struct ACCPawn_execOnSitableLogicStartedSittingState_Parms
{
	int StartParam;
	int RulingExtraFlags;
};

struct ACCPawn_execOnSitableLogicStartedIdleState_Parms
{
};

struct ACCPawn_execClubTestStage6_Parms
{
};// FUNC_Final

struct ACCPawn_execClubTestStage5_Parms
{
};// FUNC_Final

struct ACCPawn_execClubTestStage4_Parms
{
};// FUNC_Final

struct ACCPawn_execClubTestStage3_Parms
{
};// FUNC_Final

struct ACCPawn_execClubTestStage2_Parms
{
};// FUNC_Final

struct ACCPawn_execClubTestStage1a2_Parms
{
};// FUNC_Final

struct ACCPawn_execClubTestStage1a1_Parms
{
};// FUNC_Final

struct ACCPawn_execClubTestStage1_Parms
{
};// FUNC_Final

struct ACCPawn_execClubTestStage0_Parms
{
};// FUNC_Final

struct ACCPawn_execClubTestFromInstance_Parms
{
};// FUNC_Exec

struct ACCPawn_execClubStandupImmediately_Parms
{
};// FUNC_Exec

struct ACCPawn_execClubStandupLatent_Parms
{
};// FUNC_Exec

struct ACCPawn_execClubSitdownImmediately_Parms
{
	void* SitableActor;
	int SitdownType;
	int AnimIndex;
};

struct ACCPawn_execClubSitdownLatent_Parms
{
	void* SitableActor;
	int SitdownType;
	int AnimIndex;
};

struct ACCPawn_execClubSitableLogic_ProcessViewRotation_Parms
{
	float DeltaTime;
	struct FRotator out_ViewRotation; // CPF_OutParm
	struct FRotator out_DeltaRot; // CPF_OutParm
};// FUNC_Final

struct ACCPawn_execTickClubSitableLogic_Parms
{
	float DeltaTime;
};// FUNC_Final

struct ACCPawn_execChangeClubSitableLogicRulingInfo_Parms
{
	struct FCSLRulingInfo NewRulingInfoStruct; // CPF_OutParm
};// FUNC_Final

struct ACCPawn_execBuildCLSRulingInfo_Parms
{
	unsigned char NewRulingAction;
	struct FCSL_SitableActorInfo NewRulingSitable;
	int NewRulingActionParameter;
	struct FName NewRulingActionNameParameter;
	int NewRulingFlags;
	int NewRulingExtraFlags;
	struct FCSLRulingInfo ReturnValue; // CPF_ReturnParm
};

struct ACCPawn_execSitableLogicIsSitting_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final

struct ACCPawn_eventSitableLogicIsActive_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Event

struct ACCPawn_eventSearchForSitableObject_Parms
{
	struct FCSL_SitableActorInfo ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Event

struct ACCPawn_execDoSearchForSitableAndDrawDebug_Parms
{
};// FUNC_Final

struct ACCPawn_execGetInitialPawnTransformForSitable_Parms
{
	struct FCSL_SitableActorInfo Sitable; // CPF_OutParm
	struct FVector OutLocation; // CPF_OutParm
	struct FRotator OutRotation; // CPF_OutParm
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final

struct ACCPawn_execConditionalCreateSlubSitableLogic_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final

struct ACCPawn_execCreateSlubSitableLogic_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final

struct ACCPawn_eventSetAnimPosition_Parms
{
	struct FName SlotName;
	int ChannelIndex;
	struct FName InAnimSeqName;
	float InPosition;
	unsigned long bFireNotifies : 1;
	unsigned long bLooping : 1;
};// FUNC_Event

struct ACCPawn_eventBeginAnimControl_Parms
{
	TArray< void* > InAnimSets;
};// FUNC_Event

struct ACCPawn_execOnToggle_Parms
{
	void* Action;
};

struct ACCPawn_execTestPointAtEnd_Parms
{
};

struct ACCPawn_execTestPointAtFourthStage_Parms
{
};

struct ACCPawn_execTestPointAtThirdStage_Parms
{
};

struct ACCPawn_execTestPointAtSecondStage_Parms
{
};

struct ACCPawn_execTestPointAtFirstStage_Parms
{
};

struct ACCPawn_execTestPointAtBegin_Parms
{
};

struct ACCPawn_execServerTestPointAt_Parms
{
	float Time;
	float StartTime;
	float EndTime;
};

struct ACCPawn_execTestPointAt_Parms
{
	float Time;
};// FUNC_Exec

struct ACCPawn_execTestMobileEnd_Parms
{
};

struct ACCPawn_execTestMobileFourthStage_Parms
{
};

struct ACCPawn_execTestMobileThirdStage_Parms
{
};

struct ACCPawn_execTestMobileSecondStage_Parms
{
};

struct ACCPawn_execTestMobileFirstStage_Parms
{
};

struct ACCPawn_execTestMobileBegin_Parms
{
};

struct ACCPawn_execServerTestMobile_Parms
{
	float Time;
	float StartTime;
	float EndTime;
};

struct ACCPawn_execTestMobile_Parms
{
	float Time;
};// FUNC_Exec

struct ACCPawn_execTestLMGEnd_Parms
{
};

struct ACCPawn_execTestLMGFourthStage_Parms
{
};

struct ACCPawn_execTestLMGThirdStage_Parms
{
};

struct ACCPawn_execTestLMGSecondStage_Parms
{
};

struct ACCPawn_execTestLMGFirstStage_Parms
{
};

struct ACCPawn_execTestLMGBegin_Parms
{
};

struct ACCPawn_execServerTestLMG_Parms
{
};

struct ACCPawn_execTestLMG_Parms
{
};// FUNC_Exec

struct ACCPawn_execTestContusionEnd_Parms
{
};

struct ACCPawn_execTestContusionFourthStage_Parms
{
};

struct ACCPawn_execTestContusionThirdStage_Parms
{
};

struct ACCPawn_execTestContusionSecondStage_Parms
{
};

struct ACCPawn_execTestContusionFirstStage_Parms
{
};

struct ACCPawn_execTestContusionBegin_Parms
{
};

struct ACCPawn_execServerTestContusion_Parms
{
	float Time;
};

struct ACCPawn_execTestContusion_Parms
{
	float Time;
};// FUNC_Exec

struct ACCPawn_execGetDamagePenetration_Parms
{
	float ReturnValue; // CPF_ReturnParm
};

struct ACCPawn_execTestBM_Parms
{
	float Time;
};// FUNC_Exec

struct ACCPawn_execServerTestBM_Parms
{
	float Time;
};

struct ACCPawn_execFrozeMovementFor_Parms
{
	float frozeTime;
};

struct ACCPawn_execFindMostRelevantTurnNode_Parms
{
	void* ReturnValue; // CPF_ReturnParm
};

struct ACCPawn_execFindMostRelevantNode_Parms
{
	TArray< void* > Nodes; // CPF_OutParm
	void* ReturnValue; // CPF_ReturnParm
};

struct ACCPawn_eventOnCharacterComponentTransformsComputed_Parms
{
	void* Comp;
};// FUNC_Event

struct ACCPawn_execRemoveShadowCharacterComponent_Parms
{
	struct FName Id;
};

struct ACCPawn_execCreateShadowCharacterComponent_Parms
{
	struct FName Id;
	class UMaterialInterface* Mtl;
	void* ReturnValue; // CPF_ReturnParm
};

struct ACCPawn_execFellOutOfWorld_Parms
{
	class UClass* dmgType;
};

struct ACCPawn_execFindAndMoveToPlayerStart_Parms
{
};

struct ACCPawn_execTestEncroachment_Parms
{
	struct FVector Translation;
	struct FVector Extent;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Native

struct ACCPawn_execGetClientActionManager_Parms
{
	void* ReturnValue; // CPF_ReturnParm
};

struct ACCPawn_execGetServerActionManager_Parms
{
	void* ReturnValue; // CPF_ReturnParm
};

struct ACCPawn_execGetMainActionManager_Parms
{
	void* ReturnValue; // CPF_ReturnParm
};

struct ACCPawn_execSetNewMaterial_Parms
{
	unsigned long bVis : 1;
};

struct ACCPawn_execLoadDebugMovementNodeScaleNative_Parms
{
	struct FString Filename;
};// FUNC_Native

struct ACCPawn_execSaveDebugMovementNodeScaleNative_Parms
{
	struct FString Filename;
};// FUNC_Native

struct ACCPawn_execLoadDebugMovementNodeScale_Parms
{
	struct FString Filename;
};// FUNC_Exec

struct ACCPawn_execSaveDebugMovementNodeScale_Parms
{
	struct FString Filename;
};// FUNC_Exec

struct ACCPawn_eventGetAimRotation_Parms
{
	struct FRotator ReturnValue; // CPF_ReturnParm
};// FUNC_Event

struct ACCPawn_execgibbedBy_Parms
{
	class AActor* Other;
};

struct ACCPawn_eventCCUnhide_Parms
{
};// FUNC_Event

struct ACCPawn_eventCCHide_Parms
{
};// FUNC_Event

struct ACCPawn_eventTakeDamage_Parms
{
	int Damage;
	class AController* InstigatedBy;
	struct FVector HitLocation;
	struct FVector Momentum;
	class UClass* DamageType;
	struct FTraceHitInfo HitInfo;
	class AActor* DamageCauser;
	struct FAdditionalHitInfo AddInfo;
};// FUNC_Event

struct ACCPawn_execGetPawnSoundLocation_Parms
{
	struct FVector ReturnValue; // CPF_ReturnParm
};

struct ACCPawn_execUpdateCollisionModeForClub_Parms
{
	unsigned long bEffectMode : 1;
};

struct ACCPawn_execUpdateCollisionMode_Parms
{
	unsigned long bEffectMode : 1;
};

struct ACCPawn_execIsInClubMode_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCPawn_execUpdateCollisionModeAuto_Parms
{
};

struct ACCPawn_execCheckIfCanStandUpFromCrouch_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCPawn_execUpdateCollisionSize_Parms
{
};

struct ACCPawn_execGetCollisionSizeValuesForMM_Parms
{
	unsigned char TheMovementMode;
	struct FVector Translation; // CPF_OutParm
	float ColRadius; // CPF_OutParm
	float ColHeight; // CPF_OutParm
};

struct ACCPawn_eventPlayTurnSound_Parms
{
	void* SourceNode;
	float TurnAngle;
};// FUNC_Event

struct ACCPawn_execMovementModeChanged_Parms
{
	unsigned char OldMovementMode;
};

struct ACCPawn_execSetMovementMode_Parms
{
	unsigned char Mode;
};

struct ACCPawn_execGetSpecificLandedSound_Parms
{
	void* FootStepParams;
	float FallingTime;
	void* ReturnValue; // CPF_ReturnParm
};

struct ACCPawn_execGetLandedSound_Parms
{
	void* PMaterial;
	float FallingTime;
	void* ReturnValue; // CPF_ReturnParm
};

struct ACCPawn_execActuallyPlayLandedSound_Parms
{
	float FallingTime;
	struct FTraceHitInfo HitInfo;
};

struct ACCPawn_eventPlayLandedSound_Parms
{
	float FallingTime;
};// FUNC_Event

struct ACCPawn_execUpdateMovementAmbientSound_Parms
{
	unsigned char Mode;
};

struct ACCPawn_eventDestroyed_Parms
{
};// FUNC_Event

struct ACCPawn_execPlayMovementStepSound_Parms
{
	int FootDown;
	struct FTraceHitInfo HitInfo;
};

struct ACCPawn_execGetSpecificFootStepEffect_Parms
{
	void* FootStepParams;
	int FootDown;
	void* ReturnValue; // CPF_ReturnParm
};

struct ACCPawn_execGetSpecificFootStepSound_Parms
{
	void* FootStepParams;
	int FootDown;
	void* ReturnValue; // CPF_ReturnParm
};

struct ACCPawn_execGetFootStepSound_Parms
{
	void* PMaterial;
	int FootDown;
	void* ReturnValue; // CPF_ReturnParm
};

struct ACCPawn_execGetFootStepEffect_Parms
{
	void* PMaterial;
	int FootDown;
	void* ReturnValue; // CPF_ReturnParm
};

struct ACCPawn_execActuallyPlayFootStepSound_Parms
{
	int FootDown;
	struct FTraceHitInfo HitInfo;
};

struct ACCPawn_execPerformFootStepTrace_Parms
{
	struct FTraceHitInfo HitInfo; // CPF_OutParm
	class AActor* ReturnValue; // CPF_ReturnParm
};

struct ACCPawn_eventPlayFootStepSound_Parms
{
	int FootDown;
};// FUNC_Event

struct ACCPawn_execAttachMeshToSocket_Parms
{
	void* InMesh;
	struct FName SocketName;
};

struct ACCPawn_eventHoldGameObject_Parms
{
	void* CarriedObject;
};// FUNC_Event

struct ACCPawn_execClientClearGameObjectFor_Parms
{
	class ACCPawn* Pawn;
};

struct ACCPawn_execUpdateMove_Parms
{
};

struct ACCPawn_execMoveMelee_Parms
{
};

struct ACCPawn_execMoveRolling_Parms
{
};

struct ACCPawn_execMovePanic_Parms
{
};

struct ACCPawn_execMoveSprint_Parms
{
};

struct ACCPawn_execMoveWalk_Parms
{
};

struct ACCPawn_execMoveRun_Parms
{
};

struct ACCPawn_execMoveCrouch_Parms
{
};

struct ACCPawn_execGetAimOffsetRotation_Parms
{
	struct FRotator ReturnValue; // CPF_ReturnParm
};

struct ACCPawn_execUpdateAimOffsetData_Parms
{
	float DeltaTime;
};

struct ACCPawn_execUpdateMeshBoneControllers_Parms
{
	float DeltaTime;
};

struct ACCPawn_execProcessViewRotation_Parms
{
	float DeltaTime;
	struct FRotator out_ViewRotation; // CPF_OutParm
	struct FRotator out_DeltaRot; // CPF_OutParm
};

struct ACCPawn_execInterpolatePawnLocation_Parms
{
	float DeltaTime;
};

struct ACCPawn_eventTick_Parms
{
	float DeltaTime;
};// FUNC_Event

struct ACCPawn_execTickFootplacement_Parms
{
	float DeltaTime;
};

struct ACCPawn_execCalcCamera_Parms
{
	float fDeltaTime;
	struct FVector out_CamLoc; // CPF_OutParm
	struct FRotator out_CamRot; // CPF_OutParm
	float out_FOV; // CPF_OutParm
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCPawn_execInitializeAnimationNodes_Parms
{
};

struct ACCPawn_execEquipDefaultItems_Parms
{
};// FUNC_Native

struct ACCPawn_eventOnCreateCharacterComponent_Parms
{
};// FUNC_Event

struct ACCPawn_eventCreateCharacterComponent_Parms
{
	struct FCharacterVisualDescription Appearance; // CPF_OutParm
	unsigned char AnimType;
};// FUNC_Event

struct ACCPawn_eventCreateNPCCharacterComponent_Parms
{
	int VisualId;
};// FUNC_Event

struct ACCPawn_execIThinkNowBotsMustBeVisible_Parms
{
};

struct ACCPawn_execPlayAbilitySoundEffect_Parms
{
	void* Sound;
};

struct ACCPawn_execPlayAbilityPSEffect_Parms
{
	int Index;
	void* PS;
	float PSPlayTime;
	struct FName PSAttachSocket;
	struct FName PSAttachBoneName;
};

struct ACCPawn_execReplicateEmoteShowing_Parms
{
	struct FString EmoteName;
};

struct ACCPawn_execShowEmote_Parms
{
	struct FString EmoteName;
};// FUNC_Exec

struct ACCPawn_execAttachPSToCustomComponent_Parms
{
	struct FString CompName;
	struct FName SocketName;
	void* PS;
};

struct ACCPawn_execClearCCSRotatorParameter_Parms
{
	int Index;
};

struct ACCPawn_execGetCCSRotatorParameter_Parms
{
	int Index;
	struct FRotator ReturnValue; // CPF_ReturnParm
};

struct ACCPawn_execSetCCSRotatorParameter_Parms
{
	int Index;
	struct FRotator Value;
};

struct ACCPawn_execClearCCSVectorParameter_Parms
{
	int Index;
};

struct ACCPawn_execGetCCSVectorParameter_Parms
{
	int Index;
	struct FVector ReturnValue; // CPF_ReturnParm
};

struct ACCPawn_execSetCCSVectorParameter_Parms
{
	int Index;
	struct FVector Value;
};

struct ACCPawn_execClearCCSMeshParameter_Parms
{
	int Index;
};

struct ACCPawn_execGetCCSMeshParameter_Parms
{
	int Index;
	class UMeshComponent* ReturnValue; // CPF_ReturnParm
};

struct ACCPawn_execSetCCSMeshParameter_Parms
{
	int Index;
	class UMeshComponent* Value;
};

struct ACCPawn_execGetCCSPPControllerForSocket_Parms
{
	struct FName SocketName;
	void* ReturnValue; // CPF_ReturnParm
};

struct ACCPawn_execUpdateCustomComponentIKControllerTransform_Parms
{
	void* SkelController;
	struct FName SocketName;
	struct FSkelControlDestLocation DestLocation;
	float Alpha;
};

struct ACCPawn_execUpdateCustomComponentIKFor_Parms
{
	int Index;
	float DeltaTime;
};

struct ACCPawn_execForceDisableCustomComponentIKFor_Parms
{
	int Index;
};

struct ACCPawn_execUpdateCustomComponentLifeTimeFor_Parms
{
	int Index;
	float DeltaTime;
};

struct ACCPawn_execTickCustomComponentSystem_Parms
{
	float DeltaTime;
};

struct ACCPawn_execDeleteReferenceToCustomComonent_Parms
{
	struct FString CompTag;
};

struct ACCPawn_execFindCustomComponent_Parms
{
	struct FString CompTag;
	class UActorComponent* ReturnValue; // CPF_ReturnParm
};

struct ACCPawn_execPerformCustomComponentIKLerping_Parms
{
	struct FString CompTag;
	unsigned char IKLerpingMode;
	float IKLerpingTime;
	struct FSkelControlDestLocation IKLerpingLocation;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCPawn_execDetachCustomComponent_Parms
{
	struct FString CompTag;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCPawn_execAttachCustomComponent_Parms
{
	struct FString CompTag;
	class UActorComponent* Comp;
	struct FName SocketToAttach;
	float TimeOut;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCPawn_execShowHideFlag_Parms
{
	unsigned long bHide : 1;
};

struct ACCPawn_eventOnAnimEnd_Parms
{
	void* SeqNode;
	float PlayedTime;
	float ExcessTime;
};// FUNC_Event FUNC_Native

struct ACCPawn_execPostAdditionalAnimationInfoForReplicated_Parms
{
	struct FAdditionalAnimInfo AAI; // CPF_OutParm
};

struct ACCPawn_execPrepareAdditionalAnimationInfoForReplication_Parms
{
	struct FAdditionalAnimInfo AAI; // CPF_OutParm
};

struct ACCPawn_execBuildAAIMeshParameterValue_Parms
{
	struct FString ResourceName;
	class UMeshComponent* ReturnValue; // CPF_ReturnParm
};

struct ACCPawn_execBuildAAIMeshParameterResourceName_Parms
{
	class UMeshComponent* Value;
	struct FString ReturnValue; // CPF_ReturnParm
};

struct ACCPawn_execStaticIsTemplate_Parms
{
	class UObject* Obj;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Native

struct ACCPawn_execAdditionalAnimationsTimer_Parms
{
};

struct ACCPawn_execAdditionalAnimationsTimer_DoFinishPlayInternal_Parms
{
	unsigned long bNoBlendOut : 1;
};

struct ACCPawn_execAdditionalAnimationsTimer_DoFinishPlay_Parms
{
};

struct ACCPawn_execAdditionalAnimationsTimer_FinishPlay_Parms
{
};

struct ACCPawn_execAdditionalAnimationsTimer_StartPlay_Parms
{
};

struct ACCPawn_execTickAdditionalAnimations_Parms
{
	float DeltaTime;
};

struct ACCPawn_execCreateAAIEffectFor_Parms
{
	struct FString AnimName;
	void* ReturnValue; // CPF_ReturnParm
};

struct ACCPawn_execForceAbortAdditionalAnimation_Parms
{
	unsigned long bNoBlendOut : 1;
};

struct ACCPawn_eventAbortAdditionalAnimation_Parms
{
	unsigned long bNoBlendOut : 1;
};// FUNC_Event

struct ACCPawn_eventIsPlayingAdditionalAnimation_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Event

struct ACCPawn_eventPlayAdditionalAnimation_Parms
{
	struct FAdditionalAnimInfo AAI; // CPF_OutParm
};// FUNC_Event

struct ACCPawn_execAdditionalAnimationFinished_Parms
{
};

struct ACCPawn_execAdditionalAnimationStarted_Parms
{
};

struct ACCPawn_execServerForceAbortAdditionalAnimation_Parms
{
};

struct ACCPawn_execServerAbortAdditionalAnimation_Parms
{
};

struct ACCPawn_execServerPlayAdditionalAnimation_Parms
{
	struct FAdditionalAnimInfo AAI;
};

struct ACCPawn_execIsReplicatedAdditionalAnimationInfoRelevant_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCPawn_execTestGetStartAndFinishDelay_Parms
{
	float StartDelay; // CPF_OutParm
	float FinishDelay; // CPF_OutParm
};

struct ACCPawn_execTestAbortAdditionalAnimation_Parms
{
};// FUNC_Exec

struct ACCPawn_execTestPlayAdditionalAnimation_Parms
{
	struct FString AnimName;
	float BlendNodeTarget;
	unsigned long bHideWeaponDueAnim : 1;
};// FUNC_Exec

struct ACCPawn_execGetAAIsNotRelevant_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCPawn_execCalcAAIBlendTime_Parms
{
	void* ListNode; // CPF_OutParm
	TArray< void* > Selectors; // CPF_OutParm
	int DestListNodeChildIndex;
	float ListNodeBlendTime; // CPF_OutParm
	float SelectorBlendTime; // CPF_OutParm
};

struct ACCPawn_execGetAdditionalAnimationsNames_Parms
{
	TArray< struct FString > Names; // CPF_OutParm
};

struct ACCPawn_eventGetAdditionalAnimationName_Parms
{
	int EntryIndex;
	struct FName ReturnValue; // CPF_ReturnParm
};// FUNC_Event

struct ACCPawn_eventGetAdditionalAnimationSequenceLengthEx_Parms
{
	struct FName AnimName;
	float ReturnValue; // CPF_ReturnParm
};// FUNC_Event

struct ACCPawn_eventGetAdditionalAnimationSequenceLength_Parms
{
	int Index;
	float ReturnValue; // CPF_ReturnParm
};// FUNC_Event

struct ACCPawn_eventIsAdditionalAnimationEntryValid_Parms
{
	int Index;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Event

struct ACCPawn_eventFindAdditionalAnimationEntryIndex_Parms
{
	struct FName AnimName;
	int ReturnValue; // CPF_ReturnParm
};// FUNC_Event

struct ACCPawn_execPrintAdditionalAnimationsDebugInfo_Parms
{
};

struct ACCPawn_execBuildAdditionalAnimationEntryForNode_Parms
{
	void* BaseEntryNode;
	struct FAdditionalAnimationEntry ReturnValue; // CPF_ReturnParm
};

struct ACCPawn_execBuildAdditionalAnimationEntryFor_Parms
{
	int AAINodeIndex;
	int AAIChildIndex;
	struct FAdditionalAnimationEntry ReturnValue; // CPF_ReturnParm
};

struct ACCPawn_execBuildAdditionalAnimationNodeInfoFor_Parms
{
	struct FString NodeName;
	struct FAdditionalAnimationNodeInfo NodeInfo; // CPF_OutParm
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCPawn_execInitializeAdditionalAnimations_Parms
{
};

struct ACCPawn_execPossessedBy_Parms
{
	class AController* C;
	unsigned long bVehicleTransition : 1;
};

struct ACCPawn_eventPostBeginPlay_Parms
{
};// FUNC_Event

struct ACCPawn_eventGetAvatar_Parms
{
	void* ReturnValue; // CPF_ReturnParm
};// FUNC_Event

struct ACCPawn_execGetName_Parms
{
	struct FString ReturnValue; // CPF_ReturnParm
};

struct ACCPawn_execGetNetworkID_Parms
{
	int ReturnValue; // CPF_ReturnParm
};

struct ACCPawn_execServerSetNetworkID_Parms
{
	int NetId;
};

struct ACCPawn_eventSetSPDModifier_Parms
{
	float Modifier;
};// FUNC_Event

struct ACCPawn_execRegisterInRealmNodesProxy_Parms
{
};// FUNC_Native

struct ACCPawn_execSetNetworkID_Parms
{
	int NetId;
};

struct ACCPawn_eventReplicatedEvent_Parms
{
	struct FName VarName;
};// FUNC_Event

struct ACCPawn_execUpdateAimOffset_Parms
{
	struct FRotator NewAimOffsetPct;
	float DeltaTime;
};// FUNC_Final FUNC_Native

struct ACCPawn_execInitializeOtherAnimationNodes_Parms
{
};// FUNC_Native

struct ACCPawn_eventUpdateSpeedParams_Parms
{
};// FUNC_Event

// (0x3D8 - 0x6BC)
class ACCPawn : public APawn
{
public:
	void*                                              CharacterComponent;                          // 0x03D8 (0x0004)
	void*                                              SpriteLod;                                   // 0x03DC (0x0004)
	void*                                              LightEnvironment;                            // 0x03E0 (0x0004)
	void*                                              PawnProps;                                   // 0x03E4 (0x0004)
	int                                                MovementStepsCounter;                        // 0x03E8 (0x0004)
	void*                                              MovementAmbientSound;                        // 0x03EC (0x0004)
	unsigned long                                      LockPitchRotation : 1;                       // 0x03F0 (0x0004) [0x00000001]
	unsigned long                                      LockYawRotation : 1;                         // 0x03F0 (0x0004) [0x00000002]
	unsigned long                                      LockRollRotation : 1;                        // 0x03F0 (0x0004) [0x00000004]
	unsigned long                                      LockPawnRotation : 1;                        // 0x03F0 (0x0004) [0x00000008]
	unsigned long                                      bEnableFootPlacement : 1;                    // 0x03F0 (0x0004) [0x00000010]
	unsigned long                                      bPlayingAdditionalAnim : 1;                  // 0x03F0 (0x0004) [0x00000020]
	unsigned long                                      bCanUseMoveDirection : 1;                    // 0x03F0 (0x0004) [0x00000040]
	unsigned long                                      bUseDebugMovementNodeScale : 1;              // 0x03F0 (0x0004) [0x00000080]
	unsigned long                                      AllowToPlayFootstepSound : 1;                // 0x03F0 (0x0004) [0x00000100]
	unsigned long                                      CanChangeMat : 1;                            // 0x03F0 (0x0004) [0x00000200]
	unsigned long                                      bNoCollisionMode : 1;                        // 0x03F0 (0x0004) [0x00000400]
	TArray< void* >                                    TurnInPlaceNodes;                            // 0x03F4 (0x000C)
	TArray< void* >                                    TurnInMoveNodes;                             // 0x0400 (0x000C)
	void*                                              LeftHandIK1;                                 // 0x040C (0x0004)
	void*                                              LeftHandIK2;                                 // 0x0410 (0x0004)
	struct FSpeedParams                                CachedSpeedParams;                           // 0x0414 (0x0030)
	int                                                NetworkID;                                   // 0x0444 (0x0004)
	struct FName                                       LeftFootBone;                                // 0x0448 (0x0008)
	struct FName                                       RightFootBone;                               // 0x0450 (0x0008)
	struct FName                                       LeftFootControlName;                         // 0x0458 (0x0008)
	struct FName                                       RightFootControlName;                        // 0x0460 (0x0008)
	float                                              BaseTranslationOffset;                       // 0x0468 (0x0004)
	float                                              CrouchTranslationOffset;                     // 0x046C (0x0004)
	float                                              OldLocationZ;                                // 0x0470 (0x0004)
	float                                              ZSmoothingRate;                              // 0x0474 (0x0004)
	float                                              MaxFootPlacementDistSquared;                 // 0x0478 (0x0004)
	void*                                              LeftLegControl;                              // 0x047C (0x0004)
	void*                                              RightLegControl;                             // 0x0480 (0x0004)
	TArray< struct FCustomComponentDesc >              CustomComponents;                            // 0x0484 (0x000C)
	TArray< class UMeshComponent* >                    CCSMeshParameters;                           // 0x0490 (0x000C)
	TArray< struct FVector >                           CCSVectorParameters;                         // 0x049C (0x000C)
	TArray< struct FRotator >                          CCSRotatorParameters;                        // 0x04A8 (0x000C)
	struct FAdditionalAnimInfoRepStruct                ReplicatedAdditionalAnimationInfo;           // 0x04B4 (0x0090)
	struct FAdditionalAnimInfo                         CurrentAdditionalAnimationInfo;              // 0x0544 (0x008C)
	int                                                CurrentAdditionalAnimationEntryIndex;        // 0x05D0 (0x0004)
	void*                                              CurrentAdditionalAnimationEffect;            // 0x05D4 (0x0004)
	TArray< struct FAdditionalAnimationNodeInfo >      AdditionalAnimationNodes;                    // 0x05D8 (0x000C)
	TArray< struct FAdditionalAnimationEntry >         AdditionalAnimationsList;                    // 0x05E4 (0x000C)
	void*                                              AbilityPSEffect[ 3 ];                        // 0x05F0 (0x000C)
	int                                                DrugAutoInjectorLevel;                       // 0x05FC (0x0004)
	unsigned char                                      MovementMode;                                // 0x0600 (0x0001)
	unsigned char                                      PrevMovementMode;                            // 0x0601 (0x0001)
	unsigned char                                      MoveDirection;                               // 0x0602 (0x0001)
	unsigned char                                      RPG_Class;                                   // 0x0603 (0x0001)
	float                                              HP_Current;                                  // 0x0604 (0x0004)
	float                                              HP_Max;                                      // 0x0608 (0x0004)
	float                                              STM_Current;                                 // 0x060C (0x0004)
	float                                              STM_Max;                                     // 0x0610 (0x0004)
	float                                              STM_MinLevelToSprint;                        // 0x0614 (0x0004)
	float                                              STM_RollingCost;                             // 0x0618 (0x0004)
	float                                              SPD_Run;                                     // 0x061C (0x0004)
	float                                              SPD_Sprint;                                  // 0x0620 (0x0004)
	float                                              SPD_Rolling;                                 // 0x0624 (0x0004)
	float                                              RLL_Dist;                                    // 0x0628 (0x0004)
	float                                              RLL_Time;                                    // 0x062C (0x0004)
	float                                              SPD_Modifier;                                // 0x0630 (0x0004)
	TArray< float >                                    DebugMovementNodeScale;                      // 0x0634 (0x000C)
	struct FName                                       WPN_AimingCamDescName;                       // 0x0640 (0x0008)
	struct FName                                       WPN_CrouchAimingCamDescName;                 // 0x0648 (0x0008)
	int                                                STT_Type;                                    // 0x0650 (0x0004)
	float                                              STT_Factor;                                  // 0x0654 (0x0004)
	struct FRotator                                    AimOffsetRotation;                           // 0x0658 (0x000C)
	void*                                              FootStepEffectEmitter;                       // 0x0664 (0x0004)
	float                                              RadarScaleFactor;                            // 0x0668 (0x0004)
	float                                              BlockMovementFor;                            // 0x066C (0x0004)
	float                                              BlockFireFor;                                // 0x0670 (0x0004)
	float                                              ContusionFor;                                // 0x0674 (0x0004)
	float                                              testmobile_Time;                             // 0x0678 (0x0004)
	float                                              testmobile_StartTime;                        // 0x067C (0x0004)
	float                                              testmobile_EndTime;                          // 0x0680 (0x0004)
	float                                              testPointAt_Time;                            // 0x0684 (0x0004)
	float                                              testPointAt_StartTime;                       // 0x0688 (0x0004)
	float                                              testPointAt_EndTime;                         // 0x068C (0x0004)
	struct FVector                                     InterpSavedTranslation;                      // 0x0690 (0x000C)
	struct FVector                                     InterpSavedLocation;                         // 0x069C (0x000C)
	TArray< struct FShadowCharacterComponent >         ShadowCharacterComponents;                   // 0x06A8 (0x000C)
	float                                              ShadowCharacterComponentDelay;               // 0x06B4 (0x0004)
	void*                                              ClubSitableLogic;                            // 0x06B8 (0x0004)

private:
	static UClass* ClassPointer;

public:
	static UClass* StaticClass ()
	{
		if ( !ClassPointer )
			ClassPointer = UObject::FindClass( "Class CrimeCraft.CCPawn" );

		return ClassPointer;
	};

public:
	void ResetTurnNodes ( struct FRotator ResetRot )
	{
		static UFunction* pfnResetTurnNodes = NULL;

		if ( !pfnResetTurnNodes )
			pfnResetTurnNodes = UObject::FindObject< UFunction >( "Function CrimeCraft.CCPawn.ResetTurnNodes" );

		ACCPawn_execResetTurnNodes_Parms ResetTurnNodes_Parms;
		memcpy( &ResetTurnNodes_Parms.ResetRot, &ResetRot, 0xC );

		this->ProcessEvent( pfnResetTurnNodes, &ResetTurnNodes_Parms, NULL );
	};

	void eventrealmClubStandupImmediately ()
	{
		static UFunction* pfnrealmClubStandupImmediately = NULL;

		if ( !pfnrealmClubStandupImmediately )
			pfnrealmClubStandupImmediately = UObject::FindObject< UFunction >( "Function CrimeCraft.CCPawn.realmClubStandupImmediately" );

