/////////////////////////////////////////////////////////////////////////////
// Unreal Engine MiniSDK Generator by uNrEaL
// Game: CrimeCraft
// File: ACCWeapon.h
// Date: 06/16/2011 @ 05:19:41.392
/////////////////////////////////////////////////////////////////////////////

#ifdef _MSC_VER
#pragma pack( push, 4 )
#endif

enum AttachmentIDsFunc
{
	AIF_Silencer = 0,
	AIF_Scope = 10,
	AIF_FireMech_Aiming = 30,
	AIF_FireMech_Explode = 31,
	AIF_FireMech_Power = 32,
	AIF_FireMech = 33,
	AIF_MAX = 40
};

enum AttachmentIDsNum
{
	Slot_Silenser = 0,
	Slot_Scope = 1,
	Slot_Shell = 2,
	Slot_FireMech1 = 3,
	Slot_FireMech2 = 4,
	Slot_MAX = 5
};

enum EMeleeAnimationType
{
	EMAT_BeforeAttack = 0,
	EMAT_AttackModeSelection = 1,
	EMAT_Attack = 2,
	EMAT_Defend = 3,
	EMAT_MAX = 4
};

struct ACCWeapon_execmy_temp_function_Parms
{
};

struct ACCWeapon_execAbortPlayerGrenadeNoMovement_Parms
{
};

struct ACCWeapon_execStartPlayerGrenadeNoMovement_Parms
{
};

struct ACCWeapon_eventGetTraceRange_Parms
{
	float ReturnValue; // CPF_ReturnParm
};// FUNC_Event

struct ACCWeapon_eventdebugMsg_Parms
{
	struct FString S;
	unsigned long bAddClassName : 1;
	unsigned long bAddStateName : 1;
};// FUNC_Event

struct ACCWeapon_execGetShouldShowCWFTraces_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCWeapon_execGetIsHasRemoteClient_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCWeapon_execGetIsLocallyControlledOrBot_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCWeapon_execGetIsLocallyControlled_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCWeapon_execGetController_Parms
{
	class ACCInstanceController* ReturnValue; // CPF_ReturnParm
};

struct ACCWeapon_execGetClientActionManager_Parms
{
	void* ReturnValue; // CPF_ReturnParm
};

struct ACCWeapon_execGetServerActionManager_Parms
{
	void* ReturnValue; // CPF_ReturnParm
};

struct ACCWeapon_execGetMainActionManager_Parms
{
	void* ReturnValue; // CPF_ReturnParm
};

struct ACCWeapon_execDetachWeapon_Parms
{
};

struct ACCWeapon_execAttachWeaponTo_Parms
{
	class USkeletalMeshComponent* MeshCpnt;
	struct FName SocketName;
};

struct ACCWeapon_execGivenTo_Parms
{
	class APawn* thisPawn;
	unsigned long bDoNotActivate : 1;
};

struct ACCWeapon_execPutDownWeapon_Parms
{
};

struct ACCWeapon_execTryPutDown_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCWeapon_execActivate_Parms
{
};

struct ACCWeapon_execGetGrenadeAutoAim_Parms
{
	struct FVector StartFireLoc;
	struct FVector DestLoc;
	float Speed;
	struct FRotator ReturnValue; // CPF_ReturnParm
};

struct ACCWeapon_execModifyGrenadeCheckErrorFor_Parms
{
	class AActor* HitActor;
	float GrenadeCheckError;
	float ReturnValue; // CPF_ReturnParm
};

struct ACCWeapon_execGetGrenadeAutoAimDest_Parms
{
	struct FVector StartFireLoc;
	float Speed;
	float MaxGrenadeAddAngle;
	float TraceRange;
	float MaxFlyTime;
	float MaxGrenadeCheckError;
	int Penetration;
	void* DrawDebugProxy;
	struct FVector ReturnValue; // CPF_ReturnParm
};

struct ACCWeapon_execGetGrenadeLauncherAutoAim_Parms
{
	struct FVector StartFireLoc;
	struct FRotator ReturnValue; // CPF_ReturnParm
};

struct ACCWeapon_execServerReplicateGrenadeRelease_Parms
{
	struct FVector StartFireLoc;
	struct FVector DestFireLoc;
};

struct ACCWeapon_execReplicateGrenadeRelease_Parms
{
};

struct ACCWeapon_execThrowGrenade_Parms
{
	void* GrenadePreset;
	unsigned long bTest : 1;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCWeapon_execBuildGrenadeInfo_Parms
{
	struct FCustomProjectileFire GrenadeInfo; // CPF_OutParm
	class AController* InstigatorController;
	void* Preset;
	class ACCProjectile* Archetype;
	float Speed;
	unsigned long pedobomba : 1;
};

struct ACCWeapon_execProcessGrenadeRelease_Parms
{
	struct FVector StartFireLoc;
	struct FVector DestFireLoc;
	unsigned long bFallenOut : 1;
};

struct ACCWeapon_execAbortThrowGrenade_Parms
{
};

struct ACCWeapon_execServerAbortPlayerGrenadeNoMovement_Parms
{
};

struct ACCWeapon_execServerAbortPlayerGrenadeNoMovementInternal_Parms
{
};

struct ACCWeapon_execServerStartPlayerGrenadeNoMovement_Parms
{
};

struct ACCWeapon_execServerStartPlayerGrenadeNoMovementInternal_Parms
{
};

struct ACCWeapon_execAbortMeleeDefend_Parms
{
};

struct ACCWeapon_execStartMeleeDefend_Parms
{
	unsigned long bTest : 1;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCWeapon_execCalcLocalSpaceTraceLimitsEntry_Parms
{
	struct FMeleeTraceLimits Limits; // CPF_OutParm
	struct FMeleeTraceLimitsEntry Entry; // CPF_OutParm
	struct FMeleeTraceLimitsEntry ReturnValue; // CPF_ReturnParm
};

struct ACCWeapon_execCalcWorldSpaceTraceLimitsEntry_Parms
{
	struct FMeleeTraceLimits Limits; // CPF_OutParm
	struct FMeleeTraceLimitsEntry Entry; // CPF_OutParm
	struct FMeleeTraceLimitsEntry ReturnValue; // CPF_ReturnParm
};

struct ACCWeapon_execAbortPlayerMeleeMovement_Parms
{
};

struct ACCWeapon_execUpdateMeleeInitialViewRotation_Parms
{
};

struct ACCWeapon_execStartPlayerMeleeMovement_Parms
{
};

struct ACCWeapon_execGetCurrentMeleeBeatTime_Parms
{
	float ReturnValue; // CPF_ReturnParm
};

struct ACCWeapon_execServerPeekMeleeParameters_Parms
{
	int Pid;
	int Bmd;
};

struct ACCWeapon_execServerPeekMeleeParametersInternal_Parms
{
	int Pid;
	int Bmd;
};

struct ACCWeapon_execServerProcessMeleeHits_Parms
{
	unsigned long bRealRPCCall : 1;
	struct FVector MeleeStartTrace;
	struct FVector MeleeEndTrace;
};

struct ACCWeapon_execServerProcessMeleeHitsInternal_Parms
{
	unsigned long bRealRPCCall : 1;
	struct FVector MeleeStartTrace;
	struct FVector MeleeEndTrace;
};

struct ACCWeapon_execServerSetUnsuccessBeat_Parms
{
	int PrmsID;
	int Bmd;
	float TimeOut;
};

struct ACCWeapon_execSetUnsuccessBeat_Parms
{
	int PrmsID;
	int Bmd;
	float TimeOut;
};

struct ACCWeapon_execMeleeIsInUnsuccessBeatTimeout_Parms
{
	int PrmsID;
	int Bmd;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCWeapon_execMeleeIsSuccessBeat_Parms
{
	class AActor* LastHitActor;
	class ACCInstancePawn* OwnerPawn;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCWeapon_execComputeMeleeDamage_Parms
{
	class ACCInstancePawn* Sender;
	int BeatMode;
	float BaseDamage;
	class AActor* Victim;
	float ReturnValue; // CPF_ReturnParm
};

struct ACCWeapon_execPeekMeleeParameters_Parms
{
};

struct ACCWeapon_execDetermineMeleeBeatMode_Parms
{
	int ParamsId;
	int ReturnValue; // CPF_ReturnParm
};

struct ACCWeapon_execDetermineMeleeParametersID_Parms
{
	int ReturnValue; // CPF_ReturnParm
};

struct ACCWeapon_execDetermineMeleeParametersIDAndBeatMode_Parms
{
	int ParamsId; // CPF_OutParm
	int Mode; // CPF_OutParm
};

struct ACCWeapon_execDetermineMeleeCanBeStarted_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCWeapon_execMeleeCanBeStartedUpdated_Parms
{
};

struct ACCWeapon_execServerSetMeleeCanBeStarted_Parms
{
	unsigned long bValue : 1;
};

struct ACCWeapon_execUpdateMeleeCanBeStarted_Parms
{
	unsigned long bValue : 1;
};

struct ACCWeapon_execDoAbortMelee_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCWeapon_execDoStartMelee_Parms
{
	unsigned long bTest : 1;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCWeapon_execAbortMelee_Parms
{
};

struct ACCWeapon_execServerStartMeleeOnWeaponAttachment_Parms
{
	int BeatMode;
	float StartTime;
	float Time;
	float FullTime;
	float BackBlendTime;
	unsigned char AnimationType;
	int AnimationIndex;
};

struct ACCWeapon_execStartMeleeOnWeaponAttachment_Parms
{
	int BeatMode;
	float StartTime;
	float Time;
	float FullTime;
	float BackBlendTime;
	unsigned char AnimationType;
	int AnimationIndex;
};

struct ACCWeapon_execGetGrenadeAmmo_Parms
{
};

struct ACCWeapon_execGetAmmo_Parms
{
	int Limit;
};

struct ACCWeapon_execGetHowManyBulletsCanArm_Parms
{
	int ReturnValue; // CPF_ReturnParm
};

struct ACCWeapon_execCheckIfCanReload_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCWeapon_execGetIsReloading_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Native

struct ACCWeapon_execAbortReload_Parms
{
};

struct ACCWeapon_execReload_Parms
{
	unsigned long bTest : 1;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCWeapon_execServerAbortAdvReloadForFire_Parms
{
};

struct ACCWeapon_execSet_AI_WantsToDoShots_Parms
{
	int New_AI_WantsToDoShots;
};

struct ACCWeapon_execClearPendingFire_Parms
{
	int FireMode;
};

struct ACCWeapon_execPendingFire_Parms
{
	int FireMode;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCWeapon_execSetPendingFire_Parms
{
	int FireMode;
};

struct ACCWeapon_execConditionalStartFire_Parms
{
	unsigned char FireModeNum;
	unsigned long bTest : 1;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCWeapon_execStopFireEffects_Parms
{
	unsigned char FireModeNum;
};

struct ACCWeapon_execPlayFireEffects_Parms
{
	unsigned char FireModeNum;
	struct FVector StartTraceLocation;
	struct FVector EndTraceLocation;
	struct FAdditionalHitInfo AddInfo;
};

struct ACCWeapon_execPlayFireEffectsLocally_Parms
{
	int ShotFlags;
};

struct ACCWeapon_execGetFireInterval_Parms
{
	unsigned char FireModeNum;
	float ReturnValue; // CPF_ReturnParm
};

struct ACCWeapon_execCheckIfNeedsContinueFiringDueToShotsMade_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCWeapon_execServer_PIH_FinishImpactInfo_Parms
{
};

struct ACCWeapon_execServer_PIH_SetImpactInfo_Parms
{
	struct FImpactInfo Impact;
};

struct ACCWeapon_execServer_PIH_ClearImpactInfo_Parms
{
};

struct ACCWeapon_execImpactNeedsToBeReplicated_Parms
{
	struct FImpactInfo Impact;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCWeapon_execCalcFireingSensitivity_Parms
{
	unsigned long StartFire : 1;
	unsigned long startsprint : 1;
};

struct ACCWeapon_execSetFireingSensitivity_Parms
{
	float basemult;
	float firemult;
	float aimingmult;
	float abilitymult;
	float sprintmult;
};

struct ACCWeapon_execUpdateSensivity_Parms
{
	float DeltaTime;
};

struct ACCWeapon_execConditionalUpdateSensivity_Parms
{
	float DeltaTime;
};

struct ACCWeapon_execsens_ApplyFovModifier_Parms
{
	float BaseSensValue;
	float ReturnValue; // CPF_ReturnParm
};

struct ACCWeapon_execSetStartShootMachinegun_Parms
{
	unsigned long setstart : 1;
};

struct ACCWeapon_execStopFire_MachineGun_Parms
{
};

struct ACCWeapon_execStartFire_MachineGun_Parms
{
};

struct ACCWeapon_execMachinegunStopFireTimer_Parms
{
};

struct ACCWeapon_execMachinegunProcessFire_Parms
{
};

struct ACCWeapon_execAbortFire_Parms
{
};

struct ACCWeapon_execServerFireAmmunitionInternal_Parms
{
	unsigned long bRealRPCCall : 1;
	float FireTimeStamp;
};

struct ACCWeapon_execServerFireAmmunition_Parms
{
	unsigned long bRealRPCCall : 1;
	float FireTimeStamp;
	struct FVector ShootSpotLocation;
	struct FRotator ShootSpotRotation;
};

struct ACCWeapon_execFlashLocationClearTimer_Parms
{
};

struct ACCWeapon_execCalcWeaponToPreviousShotTimeLeft_Parms
{
	float ReturnValue; // CPF_ReturnParm
};

struct ACCWeapon_execServerPlayPawnFireAnimationEffects_Parms
{
};

struct ACCWeapon_execPlayPawnFireAnimationEffects_Parms
{
};

struct ACCWeapon_execServerStartFiringOnWA_Parms
{
};

struct ACCWeapon_execStartFiringOnWA_Parms
{
};

struct ACCWeapon_execServerHandleFinishedFiring_Parms
{
};

struct ACCWeapon_execHandleFinishedFiring_Parms
{
};

struct ACCWeapon_eventIsFiring_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Event

struct ACCWeapon_execIsFiringInternal_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Native

struct ACCWeapon_execFireAmmunition_Parms
{
	float FireTimeStamp;
};

struct ACCWeapon_execGetIsChangingWeapon_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Native

struct ACCWeapon_execAbortWeaponChange_Parms
{
};

struct ACCWeapon_execClientPostSwitchWeapon_Parms
{
};

struct ACCWeapon_execPostSwitchWeapon_Parms
{
};

struct ACCWeapon_execClientSetFiringParameters_Parms
{
	int FireMode;
	struct FName NewFiringState;
	unsigned char NewWeaponFireType;
	float NewDamage;
	class UClass* NewDamageType;
	float NewInstantHitMomentum;
	class UClass* NewWeaponProjectile;
};

struct ACCWeapon_execGetWeaponFiringState_Parms
{
	struct FName ReturnValue; // CPF_ReturnParm
};

struct ACCWeapon_execGetBaseDamage_Parms
{
	float ReturnValue; // CPF_ReturnParm
};

struct ACCWeapon_execSetInstantHitDamageType_Parms
{
	unsigned char FiringMode;
};

struct ACCWeapon_execSetInstantHitDamageTypes_Parms
{
};

struct ACCWeapon_execSwitchWeapon_Parms
{
};

struct ACCWeapon_execOldWeaponCleared_Parms
{
};

struct ACCWeapon_execStartWeaponSwitching_Parms
{
	unsigned long bSkipHide : 1;
};

struct ACCWeapon_execGetAdditionalAimRotation_Parms
{
	struct FVector StartFireLoc;
	struct FRotator ReturnValue; // CPF_ReturnParm
};

struct ACCWeapon_execAddAdditionalAimRotation_Parms
{
	struct FVector StartFireLoc;
	struct FRotator BaseRotation;
	struct FRotator ReturnValue; // CPF_ReturnParm
};

struct ACCWeapon_execGetAccuracyForceFovFromWeapon_Parms
{
	float out_ForceFovVal; // CPF_OutParm
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCWeapon_execGetActualAccuracyForHUD_Parms
{
	float ReturnValue; // CPF_ReturnParm
};

struct ACCWeapon_execAddSpread_Parms
{
	struct FRotator BaseAim;
	struct FRotator ReturnValue; // CPF_ReturnParm
};

struct ACCWeapon_execTickCombinedSpreadLogic_Parms
{
	float DeltaTime;
};

struct ACCWeapon_execTickFRSpreadLogic_Parms
{
	float DeltaTime;
};

struct ACCWeapon_execTickPresetSpreadLogic_Parms
{
	float DeltaTime;
};

struct ACCWeapon_execTickSpreadLogic_Parms
{
	float DeltaTime;
};

struct ACCWeapon_execUpdatePendingSpreadProcessShot_Parms
{
};

struct ACCWeapon_execStaticCalcRealSpreadAbilityModifier_Parms
{
	float BaseAbilityModifier;
	float ReturnValue; // CPF_ReturnParm
};// FUNC_Final

struct ACCWeapon_execStaticCalcInstanceFromLobbyModifier_Parms
{
	float LobbyVal1;
	float InstanceVal1;
	float LobbyVal2;
	float InstanceVal2;
	float LobbyModifierValue;
	float ReturnValue; // CPF_ReturnParm
};// FUNC_Final

struct ACCWeapon_execStaticCalcInstanceFromLobbySpreadModifier_Parms
{
	float LobbySpreadModifierValue;
	float ReturnValue; // CPF_ReturnParm
};// FUNC_Final

struct ACCWeapon_execGetFovValues_Parms
{
	float out_BaseFov; // CPF_OutParm
	float out_CurrentFov; // CPF_OutParm
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final

struct ACCWeapon_execUpdateSpreadParams_Parms
{
};

struct ACCWeapon_execConditionalSwitchSpreadProcessor_Parms
{
};

struct ACCWeapon_execSpreadTickPreLogic_Parms
{
	float DeltaTime;
};

struct ACCWeapon_execTickSpread_Parms
{
	float DeltaTime;
};

struct ACCWeapon_execConditionalTickSpread_Parms
{
	float DeltaTime;
};

struct ACCWeapon_execSpreadProcessBullet_Parms
{
	unsigned long bLastOne : 1;
};

struct ACCWeapon_execSpreadProcessShot_Parms
{
};

struct ACCWeapon_execResetSpread_Parms
{
};

struct ACCWeapon_execStillFiring_Parms
{
	unsigned char FireMode;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCWeapon_execbReadyToFire_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCWeapon_execHasAnyAmmo_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCWeapon_execHasAmmo_Parms
{
	unsigned char FireModeNum;
	int Amount;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCWeapon_execChangeAmmoCount_Parms
{
	int NewAmmoCount;
	unsigned long bCanSync : 1;
};// FUNC_Native

struct ACCWeapon_execAddAmmo_Parms
{
	int Amount;
	int ReturnValue; // CPF_ReturnParm
};

struct ACCWeapon_execConsumeAmmo_Parms
{
	unsigned char FireModeNum;
};

struct ACCWeapon_eventCallClientSyncAmmoCount_Parms
{
	float FireTimeStamp;
};// FUNC_Event

struct ACCWeapon_execSpawnSpiralRockets_Parms
{
};

struct ACCWeapon_execSpawnSpiralRocketRulers_Parms
{
};

struct ACCWeapon_execCalcSpiralRocketLocationFor_Parms
{
	int RocketIndex;
	int MaxRockets;
	struct FVector SpawnDir; // CPF_OutParm
	struct FVector ReturnValue; // CPF_ReturnParm
};

struct ACCWeapon_execServerSetLastSpiralRocketUniqIDs_Parms
{
	int InLastSpiralRocketRulerUniqID;
	int InLastSpiralRocketUniqID;
};

struct ACCWeapon_execComputeSpiralRocketUniqIDs_Parms
{
};

struct ACCWeapon_execGenerateSpiralRocketsUniqID_Parms
{
	int Count;
	int ReturnValue; // CPF_ReturnParm
};// FUNC_Native

struct ACCWeapon_execSpiralRocketsProjectileFire_Parms
{
};

struct ACCWeapon_execSimulateProjectileFire_Parms
{
	struct FCustomProjectileFire SourceInfo;
	class AProjectile* ReturnValue; // CPF_ReturnParm
};

struct ACCWeapon_execProjectileFire_Parms
{
	class AProjectile* ReturnValue; // CPF_ReturnParm
};

struct ACCWeapon_execGetPhysicalFireStartLoc_Parms
{
	struct FVector AimDir;
	struct FVector ReturnValue; // CPF_ReturnParm
};

struct ACCWeapon_execGetProjectileSpawnLocation_Parms
{
	struct FVector Direction; // CPF_OutParm
	struct FVector ReturnValue; // CPF_ReturnParm
};

struct ACCWeapon_execTimerForGL_Parms
{
};

struct ACCWeapon_execStartMultiPowerForGL_Parms
{
};

struct ACCWeapon_execIsCanSetPowerForGL_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCWeapon_execServerPerformRemoteExplode_Parms
{
};

struct ACCWeapon_execConditionalPerformRemoteExplode_Parms
{
};

struct ACCWeapon_execProcessInstantHitLocally_Parms
{
	unsigned char FiringMode;
	struct FImpactInfo Impact;
};

struct ACCWeapon_execSetDoZeroDamage_Parms
{
	unsigned long Value : 1;
};

struct ACCWeapon_execImpactNeedsToBeProcessed_Parms
{
	struct FImpactInfo Impact;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCWeapon_execProcessInstantHit_Parms
{
	unsigned char FiringMode;
	struct FImpactInfo Impact;
};

struct ACCWeapon_execPreProcessInstantHit_Parms
{
	unsigned char FiringMode;
	struct FImpactInfo Impact;
};

struct ACCWeapon_execProcessReplicatedFromClientHitList_Parms
{
	unsigned char FiringMode;
	TArray< struct FImpactInfo > ImpactList; // CPF_OutParm
};

struct ACCWeapon_execProcessInstantFireHitList_Parms
{
	unsigned char FiringMode;
	TArray< struct FImpactInfo > ImpactList; // CPF_OutParm
};

struct ACCWeapon_execCalcWeaponFireFromCameraPublic_Parms
{
	struct FVector StartTrace;
	struct FVector EndTrace;
	TArray< struct FImpactInfo > ImpactList; // CPF_OutParm
	void* DrawDebugProxy;
	struct FImpactInfo ReturnValue; // CPF_ReturnParm
};

struct ACCWeapon_execCalcWeaponFirePublic_Parms
{
	struct FVector StartTrace;
	struct FVector EndTrace;
	TArray< struct FImpactInfo > ImpactList; // CPF_OutParm
	unsigned long bFirstImpactOnly : 1;
	void* DrawDebugProxy;
	struct FImpactInfo ReturnValue; // CPF_ReturnParm
};

struct ACCWeapon_execCalcWeaponFire_Parms
{
	struct FVector StartTrace;
	struct FVector EndTrace;
	TArray< struct FImpactInfo > ImpactList; // CPF_OutParm
	struct FVector Extent;
	struct FImpactInfo ReturnValue; // CPF_ReturnParm
};

struct ACCWeapon_execCalcTraces_Parms
{
	struct FImpactInfo Impact;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCWeapon_execCalcUpdatedFireBounds_Parms
{
	struct FVector StartTrace; // CPF_OutParm
	struct FVector EndTrace; // CPF_OutParm
};

struct ACCWeapon_execCheckForCriticalDamage_Parms
{
	struct FImpactInfo Impact;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCWeapon_execInstantFire_Parms
{
};

struct ACCWeapon_execGetGrenadeRecoilRoll_Parms
{
	float ReturnValue; // CPF_ReturnParm
};

struct ACCWeapon_execClientAddGrenadeRecoil_Parms
{
	float Amplitude;
	float Period;
	float TotalTime;
	float FalloffNumber;
};

struct ACCWeapon_execStopSniperRifleRecoil_Parms
{
};

struct ACCWeapon_execStartSniperRifleRecoil_Parms
{
};

struct ACCWeapon_execUpdateSniperRifleRecoilParams_Parms
{
};

struct ACCWeapon_execClientAddDamageRecoil_Parms
{
	struct FVector PawnSpaceToShooterDir;
	float Amplitude;
	float RestoreTime;
	float DelayTime;
};

struct ACCWeapon_execTickWeaponRecoilLogic2_Parms
{
	float DeltaTime;
};

struct ACCWeapon_execTickWeaponRecoilLogic_Parms
{
	float DeltaTime;
};

struct ACCWeapon_execStaticCalcInstanceFromLobbyRecoilAmplitudeModifier_Parms
{
	float LobbyRecoilAmplitudeModifierValue;
	float ReturnValue; // CPF_ReturnParm
};// FUNC_Final

struct ACCWeapon_execUpdateWeaponRecoilParams_Parms
{
};

struct ACCWeapon_execAddWeaponRecoil_Parms
{
};

struct ACCWeapon_execGetSmoothedAdditionalRecoilRotation_Parms
{
	struct FRotator ReturnValue; // CPF_ReturnParm
};

struct ACCWeapon_execGetAdditionalRecoilRotation_Parms
{
	struct FRotator ReturnValue; // CPF_ReturnParm
};

struct ACCWeapon_execPerformRecoilLimitation_Parms
{
	struct FRotator RotationToRemove;
	unsigned long bUserMouseMove : 1;
	struct FRotator ReturnValue; // CPF_ReturnParm
};

struct ACCWeapon_execPerformRecoiCompensation_Parms
{
	struct FRotator DeltaRot;
	struct FRotator ReturnValue; // CPF_ReturnParm
};

struct ACCWeapon_execTickRecoil_Parms
{
	float DeltaTime;
};

struct ACCWeapon_execBuildRecoilProcessorsArray_Parms
{
	TArray< void* > Arr; // CPF_OutParm
};// FUNC_Final

struct ACCWeapon_execInitializeRecoil_Parms
{
};

struct ACCWeapon_execIsInAimingMode_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCWeapon_execTickShootSpotLocation_Parms
{
	float Delta;
};

struct ACCWeapon_execGetIsReadyToFire_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCWeapon_execGetIsInReadyToFireInternal_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct ACCWeapon_execUpdateIsReadyToFireTime_Parms
{
	float DeltaTime;
};

struct ACCWeapon_execReplicateShootSpotLocation_Parms
{
	struct FVector Loc;
	struct FRotator Rot;
	unsigned long bIsReadyToFire : 1;
};

struct ACCWeapon_execGetShootSpotLocation_Parms
{
	struct FRotator StartFireRot; // CPF_OutParm
	struct FVector ReturnValue; // CPF_ReturnParm
};

struct ACCWeapon_execTickForceNoIdleLogic_Parms
{
	float Delta;
};

struct ACCWeapon_execConditionalAutoReload_Parms
{
};

struct ACCWeapon_eventTick_Parms
{
	float Delta;
};// FUNC_Event

struct ACCWeapon_eventReplicatedEvent_Parms
{
	struct FName VarName;
};// FUNC_Event

struct ACCWeapon_eventPostBeginPlay_Parms
{
};// FUNC_Event

// (0x2AC - 0x678)
class ACCWeapon : public AWeapon
{
public:
	int                                                AmmoCount;                                   // 0x02AC (0x0004)
	int                                                MaxAmmoCount;                                // 0x02B0 (0x0004)
	int                                                ClipCount;                                   // 0x02B4 (0x0004)
	int                                                TotalAmmoCount;                              // 0x02B8 (0x0004)
	TArray< int >                                      ShotCost;                                    // 0x02BC (0x000C)
	int                                                BulletsPerShot;                              // 0x02C8 (0x0004)
	unsigned long                                      DoZeroDamage : 1;                            // 0x02CC (0x0004) [0x00000001]
	unsigned long                                      ClientbIsReadyToFire : 1;                    // 0x02CC (0x0004) [0x00000002]
	unsigned long                                      Weapon_SpreadUseAimingMode : 1;              // 0x02CC (0x0004) [0x00000004]
	unsigned long                                      bCanShootMachinegun : 1;                     // 0x02CC (0x0004) [0x00000008]
	unsigned long                                      bStartShootMachinegun : 1;                   // 0x02CC (0x0004) [0x00000010]
	unsigned long                                      bSimpleShoot : 1;                            // 0x02CC (0x0004) [0x00000020]
	unsigned long                                      bCritShoot : 1;                              // 0x02CC (0x0004) [0x00000040]
	unsigned long                                      bProjectileFalling : 1;                      // 0x02CC (0x0004) [0x00000080]
	unsigned long                                      ExplodeOnEnemy : 1;                          // 0x02CC (0x0004) [0x00000100]
	unsigned long                                      Reload_WantsAdvAborting : 1;                 // 0x02CC (0x0004) [0x00000200]
	unsigned long                                      bUseGrenadeLeadTargeting : 1;                // 0x02CC (0x0004) [0x00000400]
	unsigned long                                      bProcessedGrenadeRelease : 1;                // 0x02CC (0x0004) [0x00000800]
	unsigned long                                      bMeleeNeedsToHideWeapon : 1;                 // 0x02CC (0x0004) [0x00001000]
	unsigned long                                      bMeleeBeatCanBeRepeated : 1;                 // 0x02CC (0x0004) [0x00002000]
	unsigned long                                      bMeleeCanBeStarted : 1;                      // 0x02CC (0x0004) [0x00004000]
	unsigned long                                      bMeleeDoingBeat : 1;                         // 0x02CC (0x0004) [0x00008000]
	unsigned long                                      bMeleeHitAnyTarget : 1;                      // 0x02CC (0x0004) [0x00010000]
	unsigned long                                      bMeleeWasNonPawnHit : 1;                     // 0x02CC (0x0004) [0x00020000]
	unsigned long                                      bSavedMeleeTraceLimitsValid : 1;             // 0x02CC (0x0004) [0x00040000]
	unsigned long                                      Weapon_bOneShotWeapon : 1;                   // 0x02CC (0x0004) [0x00080000]
	unsigned long                                      bAltProjFire : 1;                            // 0x02CC (0x0004) [0x00100000]
	unsigned long                                      SetMultiPowerForGL : 1;                      // 0x02CC (0x0004) [0x00200000]
	unsigned long                                      SetMachinegunFire : 1;                       // 0x02CC (0x0004) [0x00400000]
	float                                              Weapon_Speed;                                // 0x02D0 (0x0004)
	int                                                StartShotsCount;                             // 0x02D4 (0x0004)
	float                                              StartShotDelay;                              // 0x02D8 (0x0004)
	float                                              PrepareTime;                                 // 0x02DC (0x0004)
	int                                                ShotsMade;                                   // 0x02E0 (0x0004)
	float                                              ClientLastFireTimeStamp;                     // 0x02E4 (0x0004)
	float                                              LastEmtyGunFireEffectsTime;                  // 0x02E8 (0x0004)
	int                                                AI_WantsToDoShots;                           // 0x02EC (0x0004)
	float                                              RecoilAmplitudeModifier;                     // 0x02F0 (0x0004)
	struct FBaseRecoilParams                           TheRecoilParams;                             // 0x02F4 (0x0038)
	struct FSniperRifleRecoilParams                    TheSniperRifleRecoilParams;                  // 0x032C (0x001C)
	void*                                              WeaponRecoilProcessor;                       // 0x0348 (0x0004)
	struct FAddWeaponRecoilInfo                        PendingAddWeaponRecoilInfoStruct;            // 0x034C (0x0004)
	void*                                              CameraRecoilProcessor;                       // 0x0350 (0x0004)
	void*                                              SniperRifleRecoilProcessor;                  // 0x0354 (0x0004)
	void*                                              GrenadeRecoil;                               // 0x0358 (0x0004)
	struct FTakeHitSpeedModifierInfo                   TheTakeHitSpeedModifierInfo;                 // 0x035C (0x000C)
	struct FVector                                     ClientShootSpotLocation;                     // 0x0368 (0x000C)
	struct FRotator                                    ClientShootSpotRotation;                     // 0x0374 (0x000C)
	int                                                IsReadyToFireTime;                           // 0x0380 (0x0004)
	float                                              WaitForReadyToFireStartTime;                 // 0x0384 (0x0004)
	TArray< struct FImpactInfo >                       ImpactInfoArrayForServer;                    // 0x0388 (0x000C)
	TArray< struct FImpactInfo >                       ImpactInfoArrayFromClient;                   // 0x0394 (0x000C)
	struct FSpreadParams                               Weapon_SpreadParams;                         // 0x03A0 (0x0084)
	float                                              Weapon_SpreadInAimingTime;                   // 0x0424 (0x0004)
	float                                              Weapon_SpreadModifier;                       // 0x0428 (0x0004)
	float                                              Weapon_SpreadAbilityModifier;                // 0x042C (0x0004)
	struct FSpreadProcessShotInfo                      PendingSpreadProcessShotInfoStruct;          // 0x0430 (0x0004)
	void*                                              SpreadProcessor;                             // 0x0434 (0x0004)
	float                                              SimpleShootTimeChanged;                      // 0x0438 (0x0004)
	float                                              CritShootTimeChanged;                        // 0x043C (0x0004)
	float                                              SimpleShootTime;                             // 0x0440 (0x0004)
	float                                              CritShootTime;                               // 0x0444 (0x0004)
	float                                              CanNotSootTime;                              // 0x0448 (0x0004)
	float                                              StartShootTime;                              // 0x044C (0x0004)
	float                                              StopShootTime;                               // 0x0450 (0x0004)
	float                                              StopSimpleShootTime;                         // 0x0454 (0x0004)
	float                                              StopCritShootTime;                           // 0x0458 (0x0004)
	float                                              ProjectileSpeed;                             // 0x045C (0x0004)
	float                                              ProjectileMaxSpeed;                          // 0x0460 (0x0004)
	float                                              ProjectileAccelerationTime;                  // 0x0464 (0x0004)
	float                                              ProjectileLifeTime;                          // 0x0468 (0x0004)
	float                                              ProjectileRotationRate;                      // 0x046C (0x0004)
	float                                              ProjectileReflectionDamage;                  // 0x0470 (0x0004)
	float                                              ProjectileReflectionMomentum;                // 0x0474 (0x0004)
	struct FWeaponSpiralRocketParams                   TheWeaponSpiralRocketParams;                 // 0x0478 (0x0044)
	float                                              ProjectileDamage;                            // 0x04BC (0x0004)
	float                                              ProjectileDamageRadius;                      // 0x04C0 (0x0004)
	float                                              ProjectileDamageRadiusMin;                   // 0x04C4 (0x0004)
	float                                              ProjectileDamageRadiusKoeficient;            // 0x04C8 (0x0004)
	float                                              ProjectileImpulseKoeficient;                 // 0x04CC (0x0004)
	float                                              ProjectileAirFrictionPower;                  // 0x04D0 (0x0004)
	float                                              ProjectileAirFrictionDelay;                  // 0x04D4 (0x0004)
	float                                              ProjectileLifePoints;                        // 0x04D8 (0x0004)
	class ACCProjectile*                               LastFireProjectile;                          // 0x04DC (0x0004)
	struct FCustomProjectileFire                       CustomProjectileInfo;                        // 0x04E0 (0x006C)
	int                                                LastSpiralRocketRulerUniqID;                 // 0x054C (0x0004)
	int                                                LastSpiralRocketUniqID;                      // 0x0550 (0x0004)
	float                                              Weapon_ReloadTime;                           // 0x0554 (0x0004)
	float                                              Weapon_ReloadPreTime;                        // 0x0558 (0x0004)
	float                                              Weapon_ReloadPostTime;                       // 0x055C (0x0004)
	float                                              Weapon_SingleBulletReloadTimePerc;           // 0x0560 (0x0004)
	float                                              Weapon_SingleBulletReloadTimePosPerc;        // 0x0564 (0x0004)
	int                                                Reload_BulletsToArm;                         // 0x0568 (0x0004)
	int                                                Reload_BulletsArmed;                         // 0x056C (0x0004)
	void*                                              GrenadeThrowingPreset;                       // 0x0570 (0x0004)
	struct FString                                     GrenadeThrowingPresetName;                   // 0x0574 (0x000C)
	struct FVector                                     AI_GrenadeTargetPoint;                       // 0x0580 (0x000C)
	float                                              AI_GrenadeThrowAngle;                        // 0x058C (0x0004)
	float                                              MaxGrenadeAdditionalAngle;                   // 0x0590 (0x0004)
	int                                                MaxGetGrenadeAutoAimDestPenetration;         // 0x0594 (0x0004)
	float                                              DeathGrenadeFromOwnerVelocityPerc;           // 0x0598 (0x0004)
	float                                              MeleeBeforeAttackTime;                       // 0x059C (0x0004)
	float                                              MeleeUnsuccessBeatTimeout;                   // 0x05A0 (0x0004)
	float                                              MeleeTime;                                   // 0x05A4 (0x0004)
	float                                              MeleeRepeatTimePerc;                         // 0x05A8 (0x0004)
	float                                              MeleeRepeatTimePosPerc;                      // 0x05AC (0x0004)
	float                                              MeleeBackBlendTime;                          // 0x05B0 (0x0004)
	float                                              MeleeDamage;                                 // 0x05B4 (0x0004)
	float                                              MeleeMomentum;                               // 0x05B8 (0x0004)
	unsigned char                                      MeleeEffectorType;                           // 0x05BC (0x0001)
	unsigned char                                      WeaponTypeName;                              // 0x05BD (0x0001)
	int                                                MeleeDamageType;                             // 0x05C0 (0x0004)
	void*                                              MeleeMotionLawObject;                        // 0x05C4 (0x0004)
	float                                              MeleeAvoidanceRadiusMultiplier;              // 0x05C8 (0x0004)
	float                                              MeleeAvoidanceGlueFactor;                    // 0x05CC (0x0004)
	float                                              MeleeWorldCollisionRadiusMultiplier;         // 0x05D0 (0x0004)
	float                                              MeleeLeftRotationLimit;                      // 0x05D4 (0x0004)
	float                                              MeleeRightRotationLimit;                     // 0x05D8 (0x0004)
	int                                                MeleeAnimationIndex;                         // 0x05DC (0x0004)
	float                                              MeleeStateStartTime;                         // 0x05E0 (0x0004)
	int                                                MeleeParametersID;                           // 0x05E4 (0x0004)
	int                                                MeleeBeatMode;                               // 0x05E8 (0x0004)
	TArray< class ACCInstancePawn* >                   MeleeHurtedPawnList;                         // 0x05EC (0x000C)
	struct FMeleeTraceLimits                           SavedMeleeTraceLimits;                       // 0x05F8 (0x0024)
	TArray< struct FMeleeUnsuccessBeatInfo >           LastMeleeBeatInfos;                          // 0x061C (0x000C)
	float                                              MeleeDefendTime;                             // 0x0628 (0x0004)
	float                                              LastCalculatedSensivity;                     // 0x062C (0x0004)
	float                                              AltProjFireDist;                             // 0x0630 (0x0004)
	float                                              TraceCoeff;                                  // 0x0634 (0x0004)
	float                                              WeaponSpeedModifier;                         // 0x0638 (0x0004)
	float                                              WeaponFireSpeedModifier;                     // 0x063C (0x0004)
	float                                              MaxPowerForGL;                               // 0x0640 (0x0004)
	float                                              MaxTimeForGL;                                // 0x0644 (0x0004)
	float                                              SaveProjSpeedForGL;                          // 0x0648 (0x0004)
	float                                              PowerIncrementForGL;                         // 0x064C (0x0004)
	float                                              WeaponRangeRep;                              // 0x0650 (0x0004)
	float                                              MaxDmgDist;                                  // 0x0654 (0x0004)
	float                                              DmgDist;                                     // 0x0658 (0x0004)
	float                                              WeaponPenetrationModifier;                   // 0x065C (0x0004)
	struct FAttachments                                AttachmentIDs[ 6 ];                          // 0x0660 (0x0018)

	// GrenadeThrowing
	// MeleeDefend
	// Melee
	// Reloading
	// CCWeaponMachineGunFiring
	// CCWeaponFiring
	// CCWeaponFiringBase
	// WeaponPuttingDown
	// WeaponEquipping
	// WeaponVisualHide
	// WeaponVisualGet

private:
	static UClass* ClassPointer;

public:
	static UClass* StaticClass ()
	{
		if ( !ClassPointer )
			ClassPointer = UObject::FindClass( "Class CrimeCraft.CCWeapon" );

		return ClassPointer;
	};

public:
	void my_temp_function ()
	{
		static UFunction* pfnmy_temp_function = NULL;

		if ( !pfnmy_temp_function )
			pfnmy_temp_function = UObject::FindObject< UFunction >( "Function CrimeCraft.CCWeapon.my_temp_function" );

		ACCWeapon_execmy_temp_function_Parms my_temp_function_Parms;

		this->ProcessEvent( pfnmy_temp_function, &my_temp_function_Parms, NULL );
	};

	void AbortPlayerGrenadeNoMovement ()
	{
		static UFunction* pfnAbortPlayerGrenadeNoMovement = NULL;

		if ( !pfnAbortPlayerGrenadeNoMovement )
