/////////////////////////////////////////////////////////////////////////////
// Unreal Engine MiniSDK Generator by uNrEaL
// Game: CrimeCraft
// File: AActor.h
// Date: 06/16/2011 @ 05:19:38.935
/////////////////////////////////////////////////////////////////////////////

#ifdef _MSC_VER
#pragma pack( push, 4 )
#endif

#define Const_RB_Sleeping                          0x02
#define Const_RB_NeedsUpdate                       0x01
#define Const_RB_None                              0x00
#define Const_RBSTATE_ANGVELSCALE                  1000.0
#define Const_RBSTATE_LINVELSCALE                  10.0
#define Const_ACTORMAXSTEPHEIGHT                   35.0
#define Const_MINFLOORZ                            0.7
#define Const_SHOTFLAG_AlreadyDead                 256
#define Const_SHOTFLAG_SimpleHitEffect             128
#define Const_SHOTFLAG_DontReplicateToShooter      64
#define Const_SHOTFLAG_UseEmpiricSpread            32
#define Const_SHOTFLAG_LastShell                   16
#define Const_SHOTFLAG_SpawnTrace                  8
#define Const_SHOTFLAG_HeadShot                    4
#define Const_SHOTFLAG_Critical                    2
#define Const_SHOTFLAG_Penetration                 1
#define Const_REP_RBLOCATION_ERROR_TOLERANCE_SQ    16.0f
#define Const_TRACEFLAG_GrenadeTrajectoryTest      16
#define Const_TRACEFLAG_Blocking                   8
#define Const_TRACEFLAG_SkipMovers                 4
#define Const_TRACEFLAG_PhysicsVolumes             2
#define Const_TRACEFLAG_Bullet                     1

enum EDoubleClickDir
{
	DCLICK_None = 0,
	DCLICK_Left = 1,
	DCLICK_Right = 2,
	DCLICK_Forward = 3,
	DCLICK_Back = 4,
	DCLICK_Active = 5,
	DCLICK_Done = 6,
	DCLICK_MAX = 7
};

enum ETravelType
{
	TRAVEL_Absolute = 0,
	TRAVEL_Partial = 1,
	TRAVEL_Relative = 2,
	TRAVEL_MAX = 3
};

enum ECollisionType
{
	COLLIDE_CustomDefault = 0,
	COLLIDE_NoCollision = 1,
	COLLIDE_BlockAll = 2,
	COLLIDE_BlockWeapons = 3,
	COLLIDE_TouchAll = 4,
	COLLIDE_TouchWeapons = 5,
	COLLIDE_BlockAllButWeapons = 6,
	COLLIDE_TouchAllButWeapons = 7,
	COLLIDE_BlockWeaponsKickable = 8,
	COLLIDE_BlockPawnNonZeroExtentOnly = 9,
	COLLIDE_MAX = 10
};

enum ENetRole
{
	ROLE_None = 0,
	ROLE_SimulatedProxy = 1,
	ROLE_AutonomousProxy = 2,
	ROLE_Authority = 3,
	ROLE_MAX = 4
};

enum EMoveDir
{
	MD_Stationary = 0,
	MD_Forward = 1,
	MD_Backward = 2,
	MD_Left = 3,
	MD_Right = 4,
	MD_Up = 5,
	MD_Down = 6,
	MD_MAX = 7
};

enum EPhysics
{
	PHYS_None = 0,
	PHYS_Walking = 1,
	PHYS_Falling = 2,
	PHYS_Swimming = 3,
	PHYS_Flying = 4,
	PHYS_Rotating = 5,
	PHYS_Projectile = 6,
	PHYS_Interpolating = 7,
	PHYS_Spider = 8,
	PHYS_Ladder = 9,
	PHYS_RigidBody = 10,
	PHYS_SoftBody = 11,
	PHYS_Unused = 12,
	PHYS_MAX = 13
};

struct AActor_execGoToStateChecked_Parms
{
	struct FName NewState;
	struct FName Label;
	unsigned long bForceEvents : 1;
	unsigned long bKeepStack : 1;
};

struct AActor_eventPostDemoRewind_Parms
{
};// FUNC_Event

struct AActor_eventAnimTreeUpdated_Parms
{
	class USkeletalMeshComponent* SkelMesh;
};// FUNC_Event

struct AActor_execSupportsKismetModification_Parms
{
	class USequenceOp* AskingOp;
	struct FString Reason; // CPF_OutParm
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct AActor_eventPlayParticleEffect_Parms
{
	void* AnimNotifyData;
};// FUNC_Event

struct AActor_execOnForceMaterialMipsResident_Parms
{
	void* Action;
};

struct AActor_execGetAimAdhesionExtent_Parms
{
	float Width; // CPF_OutParm
	float Height; // CPF_OutParm
	struct FVector Center; // CPF_OutParm
};

struct AActor_execGetAimFrictionExtent_Parms
{
	float Width; // CPF_OutParm
	float Height; // CPF_OutParm
	struct FVector Center; // CPF_OutParm
};

struct AActor_execIsInPersistentLevel_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct AActor_eventOnRigidBodySpringOverextension_Parms
{
	void* BodyInstance;
};// FUNC_Event

struct AActor_execGetPackageGuid_Parms
{
	struct FName PackageName;
	struct FGuid ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct AActor_eventPostInitAnimTree_Parms
{
	class USkeletalMeshComponent* SkelComp;
};// FUNC_Event

struct AActor_eventRootMotionExtracted_Parms
{
	class USkeletalMeshComponent* SkelComp;
	struct FBoneAtom ExtractedRootMotionDelta; // CPF_OutParm
};// FUNC_Event

struct AActor_eventRootMotionModeChanged_Parms
{
	class USkeletalMeshComponent* SkelComp;
};// FUNC_Event

struct AActor_eventPostRenderFor_Parms
{
	class APlayerController* PC;
	class UCanvas* Canvas;
	struct FVector CameraPosition;
	struct FVector CameraDir;
};// FUNC_Event

struct AActor_execNativePostRenderFor_Parms
{
	class APlayerController* PC;
	class UCanvas* Canvas;
	struct FVector CameraPosition;
	struct FVector CameraDir;
};// FUNC_Native

struct AActor_execSetHUDLocation_Parms
{
	struct FVector NewHUDLocation;
};// FUNC_Native

struct AActor_eventOnRanOver_Parms
{
	class ASVehicle* Vehicle;
	class UPrimitiveComponent* RunOverComponent;
	int WheelIndex;
};// FUNC_Event

struct AActor_eventRigidBodyCollision_Parms
{
	class UPrimitiveComponent* HitComponent;
	class UPrimitiveComponent* OtherComponent;
	struct FCollisionImpactData RigidCollisionData; // CPF_OutParm
	int ContactIndex;
};// FUNC_Event

struct AActor_eventInterpolationChanged_Parms
{
	void* InterpAction;
};// FUNC_Event

struct AActor_eventInterpolationFinished_Parms
{
	void* InterpAction;
};// FUNC_Event

struct AActor_eventInterpolationStarted_Parms
{
	void* InterpAction;
};// FUNC_Event

struct AActor_execPickedUpBy_Parms
{
	class APawn* P;
};

struct AActor_eventSpawnedByKismet_Parms
{
};// FUNC_Event

struct AActor_execGetTargetLocation_Parms
{
	class AActor* RequestedBy;
	unsigned long bRequestAlternateLoc : 1;
	struct FVector ReturnValue; // CPF_ReturnParm
};// FUNC_Native

struct AActor_execFindGoodEndView_Parms
{
	class APlayerController* PC;
	struct FRotator GoodRotation; // CPF_OutParm
};

struct AActor_execNotifyLocalPlayerTeamReceived_Parms
{
};

struct AActor_execGetLocationStringFor_Parms
{
	class APlayerReplicationInfo* PRI;
	struct FString ReturnValue; // CPF_ReturnParm
};

struct AActor_eventScriptGetTeamNum_Parms
{
	unsigned char ReturnValue; // CPF_ReturnParm
};// FUNC_Event

struct AActor_execGetTeamNum_Parms
{
	unsigned char ReturnValue; // CPF_ReturnParm
};// FUNC_Native

struct AActor_execPawnBaseDied_Parms
{
};

struct AActor_execIsPlayerOwned_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Native

struct AActor_eventGetActorEyesViewPoint_Parms
{
	struct FVector out_Location; // CPF_OutParm
	struct FRotator out_Rotation; // CPF_OutParm
};// FUNC_Event

struct AActor_execIsStationary_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AActor_eventGetActorFaceFXAsset_Parms
{
	void* ReturnValue; // CPF_ReturnParm
};// FUNC_Event

struct AActor_execCanActorPlayFaceFXAnim_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AActor_execIsActorPlayingFaceFXAnim_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AActor_eventSetSkelControlScale_Parms
{
	struct FName SkelControlName;
	float Scale;
};// FUNC_Event

struct AActor_eventSetMorphWeight_Parms
{
	struct FName MorphNodeName;
	float MorphWeight;
};// FUNC_Event

struct AActor_eventStopActorFaceFXAnim_Parms
{
};// FUNC_Event

struct AActor_eventPlayActorFaceFXAnim_Parms
{
	void* AnimSet;
	struct FString GroupName;
	struct FString SeqName;
	void* SoundCueToPlay;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Event

struct AActor_eventFinishAnimControl_Parms
{
};// FUNC_Event

struct AActor_eventSetAnimPosition_Parms
{
	struct FName SlotName;
	int ChannelIndex;
	struct FName InAnimSeqName;
	float InPosition;
	unsigned long bFireNotifies : 1;
	unsigned long bLooping : 1;
};// FUNC_Event

struct AActor_eventBeginAnimControl_Parms
{
	TArray< void* > InAnimSets;
};// FUNC_Event

struct AActor_eventOnAnimPlay_Parms
{
	void* SeqNode;
};// FUNC_Event

struct AActor_eventOnAnimEnd_Parms
{
	void* SeqNode;
	float PlayedTime;
	float ExcessTime;
};// FUNC_Event

struct AActor_execOnMakeNoise_Parms
{
	void* Action;
};

struct AActor_execDoKismetAttachment_Parms
{
	class AActor* Attachment;
	void* Action;
};

struct AActor_execOnAttachToActor_Parms
{
	void* Action;
};

struct AActor_execOnToggleHidden_Parms
{
	void* Action;
};

struct AActor_execOnChangeCollision_Parms
{
	void* Action;
};

struct AActor_execOnSetPhysics_Parms
{
	void* Action;
};

struct AActor_execOnSetBlockRigidBody_Parms
{
	void* Action;
};

struct AActor_execOnTeleport_Parms
{
	void* Action;
};

struct AActor_execOnHealDamage_Parms
{
	void* Action;
};

struct AActor_execPrestreamTextures_Parms
{
	float Seconds;
	unsigned long bEnableStreaming : 1;
};// FUNC_Native

struct AActor_execOnCauseDamage_Parms
{
	void* Action;
};

struct AActor_eventShutDown_Parms
{
};// FUNC_Event

struct AActor_execSetNetUpdateTime_Parms
{
	float NewUpdateTime;
};// FUNC_Final FUNC_Native

struct AActor_eventForceNetRelevant_Parms
{
};// FUNC_Event

struct AActor_execOnDestroy_Parms
{
	void* Action;
};

struct AActor_execClearLatentAction_Parms
{
	class UClass* actionClass;
	unsigned long bAborted : 1;
	void* exceptionAction;
};// FUNC_Final

struct AActor_execFindEventsOfClass_Parms
{
	class UClass* EventClass;
	TArray< class USequenceEvent* > out_EventList; // CPF_OutParm
	unsigned long bIncludeDisabled : 1;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final

struct AActor_execActivateEventClass_Parms
{
	class UClass* InClass;
	class AActor* InInstigator;
	TArray< class USequenceEvent* > EventList; // CPF_OutParm
	TArray< int > ActivateIndices; // CPF_OutParm
	unsigned long bTest : 1;
	TArray< class USequenceEvent* > ActivatedEvents; // CPF_OutParm
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final

struct AActor_execTriggerEventClass_Parms
{
	class UClass* InEventClass;
	class AActor* InInstigator;
	int ActivateIndex;
	unsigned long bTest : 1;
	TArray< class USequenceEvent* > ActivatedEvents; // CPF_OutParm
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AActor_execTimeSince_Parms
{
	float Time;
	float ReturnValue; // CPF_ReturnParm
};// FUNC_Final

struct AActor_execEffectIsRelevant_Parms
{
	struct FVector SpawnLocation;
	unsigned long bForceDedicated : 1;
	float CullDistance;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AActor_execCheckMaxEffectDistance_Parms
{
	class APlayerController* P;
	struct FVector SpawnLocation;
	float CullDistance;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AActor_execApplyFluidSurfaceImpact_Parms
{
	void* Fluid;
	struct FVector HitLocation;
};

struct AActor_execCanSplash_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AActor_execPlayTeleportEffect_Parms
{
	unsigned long bOut : 1;
	unsigned long bSound : 1;
};

struct AActor_execIsInPain_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AActor_execIsInVolume_Parms
{
	class AVolume* aVolume;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AActor_eventReset_Parms
{
};// FUNC_Event

struct AActor_eventGetFaceFXAudioComponent_Parms
{
	void* ReturnValue; // CPF_ReturnParm
};// FUNC_Event

struct AActor_eventModifyHearSoundComponent_Parms
{
	void* AC;
};// FUNC_Event

struct AActor_execGetPhysicsName_Parms
{
	struct FString ReturnValue; // CPF_ReturnParm
};

struct AActor_execDisplayDebug_Parms
{
	class AHUD* HUD;
	float out_YL; // CPF_OutParm
	float out_YPos; // CPF_OutParm
};

struct AActor_execGetDebugName_Parms
{
	struct FString ReturnValue; // CPF_ReturnParm
};

struct AActor_execSetGRI_Parms
{
	class AGameReplicationInfo* GRI;
};

struct AActor_execMatchStarting_Parms
{
};

struct AActor_execGetLocalString_Parms
{
	int Switch;
	class APlayerReplicationInfo* RelatedPRI1;
	class APlayerReplicationInfo* RelatedPRI2;
	struct FString ReturnValue; // CPF_ReturnParm
};

struct AActor_execReplaceText_Parms
{
	struct FString Text; // CPF_OutParm
	struct FString Replace;
	struct FString With;
};

struct AActor_execGetHumanReadableName_Parms
{
	struct FString ReturnValue; // CPF_ReturnParm
};

struct AActor_execGetItemName_Parms
{
	struct FString FullName;
	struct FString ReturnValue; // CPF_ReturnParm
};

struct AActor_execCalcCamera_Parms
{
	float fDeltaTime;
	struct FVector out_CamLoc; // CPF_OutParm
	struct FRotator out_CamRot; // CPF_OutParm
	float out_FOV; // CPF_OutParm
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AActor_eventEndViewTarget_Parms
{
	class APlayerController* PC;
};// FUNC_Event

struct AActor_eventBecomeViewTarget_Parms
{
	class APlayerController* PC;
};// FUNC_Event

struct AActor_execCheckForErrors_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AActor_eventDebugFreezeGame_Parms
{
	class AActor* ActorToLookAt;
};// FUNC_Event

struct AActor_execGetGravityZ_Parms
{
	float ReturnValue; // CPF_ReturnParm
};// FUNC_Native

struct AActor_execCheckHitInfo_Parms
{
	struct FTraceHitInfo HitInfo; // CPF_OutParm
	class UPrimitiveComponent* FallBackComponent;
	struct FVector Dir;
	struct FVector out_HitLocation; // CPF_OutParm
};// FUNC_Final

struct AActor_execTakeRadiusDamage_Parms
{
	class AController* InstigatedBy;
	float BaseDamage;
	float DamageRadius;
	class UClass* DamageType;
	float Momentum;
	struct FVector HurtOrigin;
	unsigned long bFullDamage : 1;
	class AActor* DamageCauser;
};

struct AActor_execHealDamage_Parms
{
	int Amount;
	class AController* Healer;
	class UClass* DamageType;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AActor_eventTakeDamage_Parms
{
	int DamageAmount;
	class AController* EventInstigator;
	struct FVector HitLocation;
	struct FVector Momentum;
	class UClass* DamageType;
	struct FTraceHitInfo HitInfo;
	class AActor* DamageCauser;
	struct FAdditionalHitInfo AddInfo;
};// FUNC_Event

struct AActor_execKilledBy_Parms
{
	class APawn* EventInstigator;
};

struct AActor_execHurtRadius_Parms
{
	float BaseDamage;
	float DamageRadius;
	class UClass* DamageType;
	float Momentum;
	struct FVector HurtOrigin;
	class AActor* IgnoredActor;
	class AController* InstigatedByController;
	unsigned long bDoFullDamage : 1;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AActor_execStopsProjectile_Parms
{
	class AProjectile* P;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AActor_eventNotifySkelControlBeyondLimit_Parms
{
	void* LookAt;
};// FUNC_Event

struct AActor_eventConstraintBrokenNotify_Parms
{
	class AActor* ConOwner;
	void* ConSetup;
	void* ConInstance;
};// FUNC_Event

struct AActor_eventSetInitialState_Parms
{
};// FUNC_Event

struct AActor_eventPostBeginPlay_Parms
{
};// FUNC_Event

struct AActor_eventBroadcastLocalizedTeamMessage_Parms
{
	int TeamIndex;
	class UClass* InMessageClass;
	int Switch;
	class APlayerReplicationInfo* RelatedPRI1;
	class APlayerReplicationInfo* RelatedPRI2;
	class UObject* OptionalObject;
	int OptionalData;
};// FUNC_Event

struct AActor_eventBroadcastLocalizedMessage_Parms
{
	class UClass* InMessageClass;
	int Switch;
	class APlayerReplicationInfo* RelatedPRI1;
	class APlayerReplicationInfo* RelatedPRI2;
	class UObject* OptionalObject;
	int OptionalData;
};// FUNC_Event

struct AActor_eventPreBeginPlay_Parms
{
};// FUNC_Event

struct AActor_execFindActorsOfClass_Parms
{
	class UClass* ActorClass;
	TArray< class AActor* > out_Actors; // CPF_OutParm
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final

struct AActor_execLocalPlayerControllers_Parms
{
	class UClass* BaseClass;
	class APlayerController* PC; // CPF_OutParm
};// FUNC_Final FUNC_Native

struct AActor_execAllOwnedComponents_Parms
{
	class UClass* BaseClass;
	class UActorComponent* OutComponent; // CPF_OutParm
};// FUNC_Final FUNC_Native

struct AActor_execComponentList_Parms
{
	class UClass* BaseClass;
	class UActorComponent* out_Component; // CPF_OutParm
};// FUNC_Final FUNC_Native

struct AActor_execOverlappingActors_Parms
{
	class UClass* BaseClass;
	class AActor* out_Actor; // CPF_OutParm
	float Radius;
	struct FVector Loc;
	unsigned long bIgnoreHidden : 1;
};// FUNC_Final FUNC_Native

struct AActor_execCollidingActors_Parms
{
	class UClass* BaseClass;
	class AActor* Actor; // CPF_OutParm
	float Radius;
	struct FVector Loc;
	unsigned long bUseOverlapCheck : 1;
};// FUNC_Final FUNC_Native NativeIndex[0x0141]

struct AActor_execVisibleCollidingActors_Parms
{
	class UClass* BaseClass;
	class AActor* Actor; // CPF_OutParm
	float Radius;
	struct FVector Loc;
	unsigned long bIgnoreHidden : 1;
	struct FVector Extent;
	unsigned long bTraceActors : 1;
};// FUNC_Final FUNC_Native NativeIndex[0x0138]

struct AActor_execVisibleActors_Parms
{
	class UClass* BaseClass;
	class AActor* Actor; // CPF_OutParm
	float Radius;
	struct FVector Loc;
};// FUNC_Final FUNC_Native NativeIndex[0x0137]

struct AActor_execTraceActors_Parms
{
	class UClass* BaseClass;
	class AActor* Actor; // CPF_OutParm
	struct FVector HitLoc; // CPF_OutParm
	struct FVector HitNorm; // CPF_OutParm
	struct FVector End;
	struct FVector Start;
	struct FVector Extent;
	struct FTraceHitInfo HitInfo; // CPF_OutParm
	int ExtraTraceFlags;
};// FUNC_Final FUNC_Native NativeIndex[0x0135]

struct AActor_execTouchingActors_Parms
{
	class UClass* BaseClass;
	class AActor* Actor; // CPF_OutParm
};// FUNC_Final FUNC_Native NativeIndex[0x0133]

struct AActor_execBasedActors_Parms
{
	class UClass* BaseClass;
	class AActor* Actor; // CPF_OutParm
};// FUNC_Final FUNC_Native NativeIndex[0x0132]

struct AActor_execChildActors_Parms
{
	class UClass* BaseClass;
	class AActor* Actor; // CPF_OutParm
};// FUNC_Final FUNC_Native NativeIndex[0x0131]

struct AActor_execDynamicActors_Parms
{
	class UClass* BaseClass;
	class AActor* Actor; // CPF_OutParm
};// FUNC_Final FUNC_Native NativeIndex[0x0139]

struct AActor_execAllActors_Parms
{
	class UClass* BaseClass;
	class AActor* Actor; // CPF_OutParm
};// FUNC_Final FUNC_Native NativeIndex[0x0130]

struct AActor_execGetURLMap_Parms
{
	struct FString ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native NativeIndex[0x0223]

struct AActor_execPostTeleport_Parms
{
	void* OutTeleporter;
};

struct AActor_execPreTeleport_Parms
{
	void* InTeleporter;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AActor_execGetDestination_Parms
{
	class AController* C;
	struct FVector ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct AActor_execSuggestTossVelocity_Parms
{
	struct FVector TossVelocity; // CPF_OutParm
	struct FVector Destination;
	struct FVector Start;
	float TossSpeed;
	float BaseTossZ;
	float DesiredZPct;
	struct FVector CollisionSize;
	float TerminalVelocity;
	float OverrideGravityZ;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct AActor_execPlayerCanSeeMe_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native NativeIndex[0x0214]

struct AActor_execMakeNoise_Parms
{
	float Loudness;
	struct FName NoiseType;
};// FUNC_Final FUNC_Native NativeIndex[0x0200]

struct AActor_execPlaySound_Parms
{
	void* InSoundCue;
	unsigned long bNotReplicated : 1;
	unsigned long bNoRepToOwner : 1;
	unsigned long bStopWhenOwnerDestroyed : 1;
	struct FVector SoundLocation;
	unsigned long bNoRepToRelevant : 1;
};// FUNC_Final FUNC_Native

struct AActor_execCreateAudioComponent_Parms
{
	void* InSoundCue;
	unsigned long bPlay : 1;
	unsigned long bStopWhenOwnerDestroyed : 1;
	unsigned long bUseLocation : 1;
	struct FVector SourceLocation;
	unsigned long bAttachToSelf : 1;
	void* ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct AActor_execGetRemainingTimeForTimer_Parms
{
	struct FName TimerFuncName;
	class UObject* inObj;
	float ReturnValue; // CPF_ReturnParm
};// FUNC_Final

struct AActor_execGetTimerRate_Parms
{
	struct FName TimerFuncName;
	class UObject* inObj;
	float ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct AActor_execGetTimerCount_Parms
{
	struct FName inTimerFunc;
	class UObject* inObj;
	float ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct AActor_execIsTimerActive_Parms
{
	struct FName inTimerFunc;
	class UObject* inObj;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct AActor_execPauseTimer_Parms
{
	unsigned long bPause : 1;
	struct FName inTimerFunc;
	class UObject* inObj;
};// FUNC_Final FUNC_Native

struct AActor_execClearTimer_Parms
{
	struct FName inTimerFunc;
	class UObject* inObj;
};// FUNC_Final FUNC_Native

struct AActor_execSetTimer_Parms
{
	float InRate;
	unsigned long inbLoop : 1;
	struct FName inTimerFunc;
	class UObject* inObj;
};// FUNC_Final FUNC_Native NativeIndex[0x0118]

struct AActor_eventTornOff_Parms
{
};// FUNC_Event

struct AActor_execDestroy_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native NativeIndex[0x0117]

struct AActor_execSpawn_Parms
{
	class UClass* SpawnClass;
	class AActor* SpawnOwner;
	struct FName SpawnTag;
	struct FVector SpawnLocation;
	struct FRotator SpawnRotation;
	class AActor* ActorTemplate;
	unsigned long bNoCollisionFail : 1;
	class AActor* ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct AActor_execGetBoundingCylinder_Parms
{
	float CollisionRadius; // CPF_OutParm
	float CollisionHeight; // CPF_OutParm
};// FUNC_Native

struct AActor_execGetComponentsBoundingBox_Parms
{
	struct FBox ActorBox; // CPF_OutParm
};// FUNC_Final FUNC_Native

struct AActor_execIsOverlapping_Parms
{
	class AActor* A;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct AActor_execContainsPoint_Parms
{
	struct FVector Spot;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct AActor_execFindSpot_Parms
{
	struct FVector BoxExtent;
	struct FVector SpotLocation; // CPF_OutParm
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct AActor_execTraceAllPhysicsAssetInteractions_Parms
{
	class USkeletalMeshComponent* SkelMeshComp;
	struct FVector EndTrace;
	struct FVector StartTrace;
	TArray< struct FImpactInfo > out_Hits; // CPF_OutParm
	struct FVector Extent;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct AActor_execFastTrace_Parms
{
	struct FVector TraceEnd;
	struct FVector TraceStart;
	struct FVector BoxExtent;
	unsigned long bTraceBullet : 1;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native NativeIndex[0x0224]

struct AActor_execPointCheckComponent_Parms
{
	class UPrimitiveComponent* InComponent;
	struct FVector PointLocation;
	struct FVector PointExtent;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct AActor_execTraceComponent_Parms
{
	struct FVector HitLocation; // CPF_OutParm
	struct FVector HitNormal; // CPF_OutParm
	class UPrimitiveComponent* InComponent;
	struct FVector TraceEnd;
	struct FVector TraceStart;
	struct FVector Extent;
	struct FTraceHitInfo HitInfo; // CPF_OutParm
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct AActor_execTrace_Parms
{
	struct FVector HitLocation; // CPF_OutParm
	struct FVector HitNormal; // CPF_OutParm
	struct FVector TraceEnd;
	struct FVector TraceStart;
	unsigned long bTraceActors : 1;
	struct FVector Extent;
	struct FTraceHitInfo HitInfo; // CPF_OutParm
	int ExtraTraceFlags;
	class AActor* ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native NativeIndex[0x0115]

struct AActor_execMakeEmptyAdditionalHitInfo_Parms
{
	struct FAdditionalHitInfo ReturnValue; // CPF_ReturnParm
};

struct AActor_execMakeAdditionalHitInfo_Parms
{
	int HitEffectType;
	unsigned long bUseHitAnimation : 1;
	int ShotFlags;
	struct FAdditionalHitInfo ReturnValue; // CPF_ReturnParm
};

struct AActor_execVolumeBasedDestroy_Parms
{
	void* PV;
};

struct AActor_eventOutsideWorldBounds_Parms
{
};// FUNC_Event

struct AActor_eventFellOutOfWorld_Parms
{
	class UClass* dmgType;
};// FUNC_Event

struct AActor_execUsedBy_Parms
{
	class APawn* User;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AActor_eventOverRotated_Parms
{
	struct FRotator out_Desired; // CPF_OutParm
	struct FRotator out_Actual; // CPF_OutParm
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Event

struct AActor_execClampRotation_Parms
{
	struct FRotator out_Rot; // CPF_OutParm
	struct FRotator rBase;
	struct FRotator rUpperLimits;
	struct FRotator rLowerLimits;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct AActor_eventRanInto_Parms
{
	class AActor* Other;
};// FUNC_Event

struct AActor_eventEncroachedBy_Parms
{
	class AActor* Other;
};// FUNC_Event

struct AActor_eventEncroachingOn_Parms
{
	class AActor* Other;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Event

struct AActor_eventCollisionChanged_Parms
{
};// FUNC_Event

struct AActor_eventSpecialHandling_Parms
{
	class APawn* Other;
	class AActor* ReturnValue; // CPF_ReturnParm
};// FUNC_Event

struct AActor_eventDetach_Parms
{
	class AActor* Other;
};// FUNC_Event

struct AActor_eventAttach_Parms
{
	class AActor* Other;
};// FUNC_Event

struct AActor_eventBaseChange_Parms
{
};// FUNC_Event

struct AActor_eventBump_Parms
{
	class AActor* Other;
	class UPrimitiveComponent* OtherComp;
	struct FVector HitNormal;
};// FUNC_Event

struct AActor_eventUnTouch_Parms
{
	class AActor* Other;
};// FUNC_Event

struct AActor_eventPostTouch_Parms
{
	class AActor* Other;
};// FUNC_Event

struct AActor_eventTouch_Parms
{
	class AActor* Other;
	class UPrimitiveComponent* OtherComp;
	struct FVector HitLocation;
	struct FVector HitNormal;
};// FUNC_Event

struct AActor_eventPhysicsVolumeChange_Parms
{
	void* NewVolume;
};// FUNC_Event

struct AActor_eventLanded_Parms
{
	struct FVector HitNormal;
	class AActor* FloorActor;
};// FUNC_Event

struct AActor_eventFalling_Parms
{
};// FUNC_Event

struct AActor_eventHitWall_Parms
{
	struct FVector HitNormal;
	class AActor* Wall;
	class UPrimitiveComponent* WallComp;
};// FUNC_Event

struct AActor_eventTimer_Parms
{
};// FUNC_Event

struct AActor_eventTick_Parms
{
	float DeltaTime;
};// FUNC_Event

struct AActor_eventLostChild_Parms
{
	class AActor* Other;
};// FUNC_Event

struct AActor_eventGainedChild_Parms
{
	class AActor* Other;
};// FUNC_Event

struct AActor_eventDestroyed_Parms
{
};// FUNC_Event

struct AActor_execSetTickGroup_Parms
{
	unsigned char NewTickGroup;
};// FUNC_Final FUNC_Native

struct AActor_execReattachComponent_Parms
{
	class UActorComponent* ComponentToReattach;
};// FUNC_Final FUNC_Native

struct AActor_execDetachComponent_Parms
{
	class UActorComponent* ExComponent;
};// FUNC_Final FUNC_Native

struct AActor_execAttachComponent_Parms
{
	class UActorComponent* NewComponent;
};// FUNC_Final FUNC_Native

struct AActor_execUnClock_Parms
{
	float Time; // CPF_OutParm
};// FUNC_Final FUNC_Native

struct AActor_execClock_Parms
{
	float Time; // CPF_OutParm
};// FUNC_Final FUNC_Native

struct AActor_execSetPhysics_Parms
{
	unsigned char newPhysics;
};// FUNC_Final FUNC_Native NativeIndex[0x0F82]

struct AActor_execSetOnlyOwnerSee_Parms
{
	unsigned long bNewOnlyOwnerSee : 1;
};// FUNC_Final FUNC_Native

struct AActor_execSetHidden_Parms
{
	unsigned long bNewHidden : 1;
};// FUNC_Final FUNC_Native

struct AActor_execChartData_Parms
{
	struct FString DataName;
	float DataValue;
};// FUNC_Final FUNC_Native

struct AActor_execDrawDebugCone_Parms
{
	struct FVector Origin;
	struct FVector Direction;
	float Length;
	float AngleWidth;
	float AngleHeight;
	int NumSides;
	struct FColor DrawColor;
	unsigned long bPersistentLines : 1;
};// FUNC_Final FUNC_Native

struct AActor_execDrawDebugCylinder_Parms
{
	struct FVector Start;
	struct FVector End;
	float Radius;
	int Segments;
	unsigned char R;
	unsigned char G;
	unsigned char B;
	unsigned long bPersistentLines : 1;
};// FUNC_Final FUNC_Native

struct AActor_execDrawDebugSphere_Parms
{
	struct FVector Center;
	float Radius;
	int Segments;
	unsigned char R;
	unsigned char G;
	unsigned char B;
	unsigned long bPersistentLines : 1;
};// FUNC_Final FUNC_Native

struct AActor_execDrawDebugCoordinateSystem_Parms
{
	struct FVector AxisLoc;
	struct FRotator AxisRot;
	float Scale;
	unsigned long bPersistentLines : 1;
};// FUNC_Final FUNC_Native

struct AActor_execDrawDebugBox_Parms
{
	struct FVector Center;
	struct FVector Extent;
	unsigned char R;
	unsigned char G;
	unsigned char B;
	unsigned long bPersistentLines : 1;
};// FUNC_Final FUNC_Native

struct AActor_execDrawDebugLine_Parms
{
	struct FVector LineStart;
	struct FVector LineEnd;
	unsigned char R;
	unsigned char G;
	unsigned char B;
	unsigned long bPersistentLines : 1;
};// FUNC_Final FUNC_Native

struct AActor_execFlushPersistentDebugLines_Parms
{
};// FUNC_Final FUNC_Native

struct AActor_execSetForcedInitialReplicatedProperty_Parms
{
	void* PropToReplicate;
	unsigned long bAdd : 1;
};// FUNC_Final FUNC_Native

struct AActor_eventReplicatedDataBinding_Parms
{
	struct FName VarName;
};// FUNC_Event

struct AActor_eventReplicatedEventEx_Parms
{
	struct FName VarName;
	int ArrayIndex;
};// FUNC_Event

struct AActor_eventReplicatedEvent_Parms
{
	struct FName VarName;
};// FUNC_Event

struct AActor_execIsOwnedBy_Parms
{
	class AActor* TestActor;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct AActor_execGetBaseMost_Parms
{
	class AActor* ReturnValue; // CPF_ReturnParm
};// FUNC_Native

struct AActor_execIsBasedOn_Parms
{
	class AActor* TestActor;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct AActor_execFindBase_Parms
{
};// FUNC_Native

struct AActor_execSetOwner_Parms
{
	class AActor* NewOwner;
};// FUNC_Final FUNC_Native NativeIndex[0x0110]

struct AActor_execSetBase_Parms
{
	class AActor* NewBase;
	struct FVector NewFloor;
	class USkeletalMeshComponent* SkelComp;
	struct FName AttachName;
};// FUNC_Final FUNC_Native NativeIndex[0x012A]

struct AActor_execGetTerminalVelocity_Parms
{
	float ReturnValue; // CPF_ReturnParm
};// FUNC_Native

struct AActor_execAutonomousPhysics_Parms
{
	float DeltaSeconds;
};// FUNC_Final FUNC_Native NativeIndex[0x0F83]

struct AActor_execMoveSmooth_Parms
{
	struct FVector Delta;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native NativeIndex[0x0F81]

struct AActor_execfixedTurn_Parms
{
	int Current;
	int Desired;
	int DeltaRate;
	int ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct AActor_execSetHardAttach_Parms
{
	unsigned long bNewHardAttach : 1;
};// FUNC_Final FUNC_Native

struct AActor_execSetRelativeLocation_Parms
{
	struct FVector NewLocation;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct AActor_execSetRelativeRotation_Parms
{
	struct FRotator NewRotation;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct AActor_execSetZone_Parms
{
	unsigned long bForceRefresh : 1;
};// FUNC_Final FUNC_Native

struct AActor_execMovingWhichWay_Parms
{
	float Amount; // CPF_OutParm
	unsigned char ReturnValue; // CPF_ReturnParm
};// FUNC_Native

struct AActor_execSetRotation_Parms
{
	struct FRotator NewRotation;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native NativeIndex[0x012B]

struct AActor_execSetLocation_Parms
{
	struct FVector NewLocation;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native NativeIndex[0x010B]

struct AActor_execMove_Parms
{
	struct FVector Delta;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native NativeIndex[0x010A]

struct AActor_execSetDrawScale3D_Parms
{
	struct FVector NewScale3D;
};// FUNC_Final FUNC_Native

struct AActor_execSetDrawScale_Parms
{
	float NewScale;
};// FUNC_Final FUNC_Native

struct AActor_execSetCollisionType_Parms
{
	unsigned char NewCollisionType;
};// FUNC_Final FUNC_Native

struct AActor_execSetCollisionSize_Parms
{
	float NewRadius;
	float NewHeight;
};// FUNC_Final FUNC_Native NativeIndex[0x011B]

struct AActor_execSetCollision_Parms
{
	unsigned long bNewColActors : 1;
	unsigned long bNewBlockActors : 1;
	unsigned long bNewIgnoreEncroachers : 1;
};// FUNC_Final FUNC_Native NativeIndex[0x0106]

struct AActor_execFinishAnim_Parms
{
	void* SeqNode;
};// FUNC_Final FUNC_Native NativeIndex[0x0105]

struct AActor_execSleep_Parms
{
	float Seconds;
};// FUNC_Final FUNC_Native NativeIndex[0x0100]

struct AActor_execConsoleCommand_Parms
{
	struct FString Command;
	unsigned long bWriteToLog : 1;
	struct FString ReturnValue; // CPF_ReturnParm
};// FUNC_Native

struct AActor_execForceUpdateComponents_Parms
{
	unsigned long bCollisionUpdate : 1;
	unsigned long bTransformOnly : 1;
};// FUNC_Native

// (0x3C - 0x1BC)
class AActor : public UObject
{
public:
	TArray< class UActorComponent* >                   Components;                                  // 0x003C (0x000C)
	TArray< class UActorComponent* >                   AllComponents;                               // 0x0048 (0x000C)
	struct FVector                                     Location;                                    // 0x0054 (0x000C)
	struct FRotator                                    Rotation;                                    // 0x0060 (0x000C)
	float                                              DrawScale;                                   // 0x006C (0x0004)
	struct FVector                                     DrawScale3D;                                 // 0x0070 (0x000C)
	struct FVector                                     PrePivot;                                    // 0x007C (0x000C)
	struct FRenderCommandFence                         DetachFence;                                 // 0x0088 (0x0004)
	float                                              CustomTimeDilation;                          // 0x008C (0x0004)
	unsigned char                                      Physics;                                     // 0x0090 (0x0001)
	unsigned char                                      RemoteRole;                                  // 0x0091 (0x0001)
	unsigned char                                      Role;                                        // 0x0092 (0x0001)
	unsigned char                                      CollisionType;                               // 0x0093 (0x0001)
	unsigned char                                      ReplicatedCollisionType;                     // 0x0094 (0x0001)
	unsigned char                                      TickGroup;                                   // 0x0095 (0x0001)
	class AActor*                                      Owner;                                       // 0x0098 (0x0004)
	class AActor*                                      Base;                                        // 0x009C (0x0004)
	TArray< struct FTimerData >                        Timers;                                      // 0x00A0 (0x000C)
	unsigned long                                      bStatic : 1;                                 // 0x00AC (0x0004) [0x00000001]
	unsigned long                                      bHidden : 1;                                 // 0x00AC (0x0004) [0x00000002]
	unsigned long                                      bNoDelete : 1;                               // 0x00AC (0x0004) [0x00000004]
	unsigned long                                      bDeleteMe : 1;                               // 0x00AC (0x0004) [0x00000008]
	unsigned long                                      bTicked : 1;                                 // 0x00AC (0x0004) [0x00000010]
	unsigned long                                      bOnlyOwnerSee : 1;                           // 0x00AC (0x0004) [0x00000020]
	unsigned long                                      bStasis : 1;                                 // 0x00AC (0x0004) [0x00000040]
	unsigned long                                      bWorldGeometry : 1;                          // 0x00AC (0x0004) [0x00000080]
	unsigned long                                      bIgnoreRigidBodyPawns : 1;                   // 0x00AC (0x0004) [0x00000100]
	unsigned long                                      bOrientOnSlope : 1;                          // 0x00AC (0x0004) [0x00000200]
	unsigned long                                      bIgnoreEncroachers : 1;                      // 0x00AC (0x0004) [0x00000400]
	unsigned long                                      bPushedByEncroachers : 1;                    // 0x00AC (0x0004) [0x00000800]
	unsigned long                                      bDestroyedByInterpActor : 1;                 // 0x00AC (0x0004) [0x00001000]
	unsigned long                                      bRouteBeginPlayEvenIfStatic : 1;             // 0x00AC (0x0004) [0x00002000]
	unsigned long                                      bIsMoving : 1;                               // 0x00AC (0x0004) [0x00004000]
	unsigned long                                      bAlwaysEncroachCheck : 1;                    // 0x00AC (0x0004) [0x00008000]
	unsigned long                                      bHasAlternateTargetLocation : 1;             // 0x00AC (0x0004) [0x00010000]
	unsigned long                                      bCanStepUpOn : 1;                            // 0x00AC (0x0004) [0x00020000]
	unsigned long                                      bNetTemporary : 1;                           // 0x00AC (0x0004) [0x00040000]
	unsigned long                                      bOnlyRelevantToOwner : 1;                    // 0x00AC (0x0004) [0x00080000]
	unsigned long                                      bNetDirty : 1;                               // 0x00AC (0x0004) [0x00100000]
	unsigned long                                      bAlwaysRelevant : 1;                         // 0x00AC (0x0004) [0x00200000]
	unsigned long                                      bReplicateInstigator : 1;                    // 0x00AC (0x0004) [0x00400000]
	unsigned long                                      bReplicateMovement : 1;                      // 0x00AC (0x0004) [0x00800000]
	unsigned long                                      bDisablePhysicsReplication : 1;              // 0x00AC (0x0004) [0x01000000]
	unsigned long                                      bSkipActorPropertyReplication : 1;           // 0x00AC (0x0004) [0x02000000]
	unsigned long                                      bUpdateSimulatedPosition : 1;                // 0x00AC (0x0004) [0x04000000]
	unsigned long                                      bTearOff : 1;                                // 0x00AC (0x0004) [0x08000000]
	unsigned long                                      bOnlyDirtyReplication : 1;                   // 0x00AC (0x0004) [0x10000000]
	unsigned long                                      bAllowFluidSurfaceInteraction : 1;           // 0x00AC (0x0004) [0x20000000]
	unsigned long                                      bDemoRecording : 1;                          // 0x00AC (0x0004) [0x40000000]
	unsigned long                                      bDemoOwner : 1;                              // 0x00AC (0x0004) [0x80000000]
	unsigned long                                      bForceDemoRelevant : 1;                      // 0x00B0 (0x0004) [0x00000001]
	unsigned long                                      bNetInitialRotation : 1;                     // 0x00B0 (0x0004) [0x00000002]
	unsigned long                                      bReplicateRigidBodyLocation : 1;             // 0x00B0 (0x0004) [0x00000004]
	unsigned long                                      bKillDuringLevelTransition : 1;              // 0x00B0 (0x0004) [0x00000008]
	unsigned long                                      bExchangedRoles : 1;                         // 0x00B0 (0x0004) [0x00000010]
	unsigned long                                      bConsiderAllStaticMeshComponentsForStreaming : 1; // 0x00B0 (0x0004) [0x00000020]
	unsigned long                                      bDebug : 1;                                  // 0x00B0 (0x0004) [0x00000040]
	unsigned long                                      bPostRenderIfNotVisible : 1;                 // 0x00B0 (0x0004) [0x00000080]
	unsigned long                                      bForceNetUpdate : 1;                         // 0x00B0 (0x0004) [0x00000100]
	unsigned long                                      bPendingNetUpdate : 1;                       // 0x00B0 (0x0004) [0x00000200]
	unsigned long                                      bHardAttach : 1;                             // 0x00B0 (0x0004) [0x00000400]
	unsigned long                                      bIgnoreBaseRotation : 1;                     // 0x00B0 (0x0004) [0x00000800]
	unsigned long                                      bShadowParented : 1;                         // 0x00B0 (0x0004) [0x00001000]
	unsigned long                                      bUseBaseRotationAndLocation : 1;             // 0x00B0 (0x0004) [0x00002000]
	unsigned long                                      bCanBeAdheredTo : 1;                         // 0x00B0 (0x0004) [0x00004000]
	unsigned long                                      bCanBeFrictionedTo : 1;                      // 0x00B0 (0x0004) [0x00008000]
	unsigned long                                      bHurtEntry : 1;                              // 0x00B0 (0x0004) [0x00010000]
	unsigned long                                      bGameRelevant : 1;                           // 0x00B0 (0x0004) [0x00020000]
	unsigned long                                      bMovable : 1;                                // 0x00B0 (0x0004) [0x00040000]
	unsigned long                                      bDestroyInPainVolume : 1;                    // 0x00B0 (0x0004) [0x00080000]
	unsigned long                                      bCanBeDamaged : 1;                           // 0x00B0 (0x0004) [0x00100000]
	unsigned long                                      bShouldBaseAtStartup : 1;                    // 0x00B0 (0x0004) [0x00200000]
	unsigned long                                      bPendingDelete : 1;                          // 0x00B0 (0x0004) [0x00400000]
	unsigned long                                      bCanTeleport : 1;                            // 0x00B0 (0x0004) [0x00800000]
	unsigned long                                      bAlwaysTick : 1;                             // 0x00B0 (0x0004) [0x01000000]
	unsigned long                                      bBlocksNavigation : 1;                       // 0x00B0 (0x0004) [0x02000000]
	unsigned long                                      BlockRigidBody : 1;                          // 0x00B0 (0x0004) [0x04000000]
	unsigned long                                      bCollideWhenPlacing : 1;                     // 0x00B0 (0x0004) [0x08000000]
	unsigned long                                      bCollideActors : 1;                          // 0x00B0 (0x0004) [0x10000000]
	unsigned long                                      bCollideWorld : 1;                           // 0x00B0 (0x0004) [0x20000000]
	unsigned long                                      bCollideComplex : 1;                         // 0x00B0 (0x0004) [0x40000000]
	unsigned long                                      bBlockActors : 1;                            // 0x00B0 (0x0004) [0x80000000]
	unsigned long                                      bProjTarget : 1;                             // 0x00B4 (0x0004) [0x00000001]
	unsigned long                                      bBlocksTeleport : 1;                         // 0x00B4 (0x0004) [0x00000002]
	unsigned long                                      bIgnorePawnNonZeroExtent : 1;                // 0x00B4 (0x0004) [0x00000004]
	unsigned long                                      bNoEncroachCheck : 1;                        // 0x00B4 (0x0004) [0x00000008]
	unsigned long                                      bPhysRigidBodyOutOfWorldCheck : 1;           // 0x00B4 (0x0004) [0x00000010]
	unsigned long                                      bComponentOutsideWorld : 1;                  // 0x00B4 (0x0004) [0x00000020]
	unsigned long                                      bBounce : 1;                                 // 0x00B4 (0x0004) [0x00000040]
	unsigned long                                      bJustTeleported : 1;                         // 0x00B4 (0x0004) [0x00000080]
	unsigned long                                      bNetInitial : 1;                             // 0x00B4 (0x0004) [0x00000100]
	unsigned long                                      bNetOwner : 1;                               // 0x00B4 (0x0004) [0x00000200]
	unsigned long                                      bHiddenEd : 1;                               // 0x00B4 (0x0004) [0x00000400]
	unsigned long                                      bHiddenEdGroup : 1;                          // 0x00B4 (0x0004) [0x00000800]
	unsigned long                                      bHiddenEdCustom : 1;                         // 0x00B4 (0x0004) [0x00001000]
	unsigned long                                      bEdShouldSnap : 1;                           // 0x00B4 (0x0004) [0x00002000]
	unsigned long                                      bTempEditor : 1;                             // 0x00B4 (0x0004) [0x00004000]
	unsigned long                                      bPathColliding : 1;                          // 0x00B4 (0x0004) [0x00008000]
	unsigned long                                      bPathTemp : 1;                               // 0x00B4 (0x0004) [0x00010000]
	unsigned long                                      bScriptInitialized : 1;                      // 0x00B4 (0x0004) [0x00020000]
	unsigned long                                      bLockLocation : 1;                           // 0x00B4 (0x0004) [0x00040000]
	unsigned long                                      bForceAllowKismetModification : 1;           // 0x00B4 (0x0004) [0x00080000]
	int                                                NetTag;                                      // 0x00B8 (0x0004)
	float                                              NetUpdateTime;                               // 0x00BC (0x0004)
	float                                              NetUpdateFrequency;                          // 0x00C0 (0x0004)
	float                                              NetPriority;                                 // 0x00C4 (0x0004)
	float                                              LastNetUpdateTime;                           // 0x00C8 (0x0004)
	class APawn*                                       Instigator;                                  // 0x00CC (0x0004)
	class AWorldInfo*                                  WorldInfo;                                   // 0x00D0 (0x0004)
	float                                              LifeSpan;                                    // 0x00D4 (0x0004)
	float                                              CreationTime;                                // 0x00D8 (0x0004)
	float                                              LastRenderTime;                              // 0x00DC (0x0004)
	struct FName                                       Tag;                                         // 0x00E0 (0x0008)
	struct FName                                       InitialState;                                // 0x00E8 (0x0008)
	struct FName                                       Group;                                       // 0x00F0 (0x0008)
	TArray< class AActor* >                            Touching;                                    // 0x00F8 (0x000C)
	TArray< class AActor* >                            Children;                                    // 0x0104 (0x000C)
	float                                              LatentFloat;                                 // 0x0110 (0x0004)
	void*                                              LatentSeqNode;                               // 0x0114 (0x0004)
	void*                                              PhysicsVolume;                               // 0x0118 (0x0004)
	struct FVector                                     Velocity;                                    // 0x011C (0x000C)
	struct FVector                                     Acceleration;                                // 0x0128 (0x000C)
	struct FVector                                     AngularVelocity;                             // 0x0134 (0x000C)
	class USkeletalMeshComponent*                      BaseSkelComponent;                           // 0x0140 (0x0004)
	struct FName                                       BaseBoneName;                                // 0x0144 (0x0008)
	TArray< class AActor* >                            Attached;                                    // 0x014C (0x000C)
	struct FVector                                     RelativeLocation;                            // 0x0158 (0x000C)
	struct FRotator                                    RelativeRotation;                            // 0x0164 (0x000C)
	class UPrimitiveComponent*                         CollisionComponent;                          // 0x0170 (0x0004)
	int                                                OverlapTag;                                  // 0x0174 (0x0004)
	struct FRotator                                    RotationRate;                                // 0x0178 (0x000C)
	struct FRotator                                    DesiredRotation;                             // 0x0184 (0x000C)
	class AActor*                                      PendingTouch;                                // 0x0190 (0x0004)
	class UClass*                                      MessageClass;                                // 0x0194 (0x0004)
	TArray< class UClass* >                            SupportedEvents;                             // 0x0198 (0x000C)
	TArray< class USequenceEvent* >                    GeneratedEvents;                             // 0x01A4 (0x000C)
	TArray< void* >                                    LatentActions;                               // 0x01B0 (0x000C)

private:
	static UClass* ClassPointer;

public:
	static UClass* StaticClass ()
	{
		if ( !ClassPointer )
			ClassPointer = UObject::FindClass( "Class Engine.Actor" );

		return ClassPointer;
	};

public:
	void GoToStateChecked ( struct FName NewState/*CPF_OptionalParm*/, struct FName Label/*CPF_OptionalParm*/, unsigned long bForceEvents/*CPF_OptionalParm*/, unsigned long bKeepStack/*CPF_OptionalParm*/ )
	{
		static UFunction* pfnGoToStateChecked = NULL;

		if ( !pfnGoToStateChecked )
			pfnGoToStateChecked = UObject::FindObject< UFunction >( "Function Engine.Actor.GoToStateChecked" );

		AActor_execGoToStateChecked_Parms GoToStateChecked_Parms;
		memcpy( &GoToStateChecked_Parms.NewState, &NewState, 0x8 );
		memcpy( &GoToStateChecked_Parms.Label, &Label, 0x8 );
		GoToStateChecked_Parms.bForceEvents = bForceEvents;
		GoToStateChecked_Parms.bKeepStack = bKeepStack;

