/////////////////////////////////////////////////////////////////////////////
// Unreal Engine MiniSDK Generator by uNrEaL
// Game: CrimeCraft
// File: AController.h
// Date: 06/16/2011 @ 05:19:39.135
/////////////////////////////////////////////////////////////////////////////

#ifdef _MSC_VER
#pragma pack( push, 4 )
#endif

#define Const_LATENT_MOVETOWARD                    503

struct AController_execReadyForLift_Parms
{
};

struct AController_execSendMessage_Parms
{
	class APlayerReplicationInfo* Recipient;
	struct FName MessageType;
	float Wait;
	class UClass* DamageType;
};

struct AController_eventCurrentLevelUnloaded_Parms
{
};// FUNC_Event

struct AController_execGetRouteGoalAfter_Parms
{
	int RouteIdx;
	class AActor* ReturnValue; // CPF_ReturnParm
};

struct AController_eventIsInCombat_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Event

struct AController_eventIsSpectating_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Event

struct AController_execGetKillerController_Parms
{
	class AController* ReturnValue; // CPF_ReturnParm
};

struct AController_execOnToggleHidden_Parms
{
	void* Action;
};

struct AController_execNotifyAddInventory_Parms
{
	class AInventory* NewItem;
};

struct AController_execOnCauseDamage_Parms
{
	void* Action;
};

struct AController_execNotifyCoverClaimViolation_Parms
{
	class AController* NewClaim;
	void* Link;
	int SlotIdx;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AController_eventNotifyCoverAdjusted_Parms
{
};// FUNC_Event

struct AController_execNotifyCoverDisabled_Parms
{
	void* Link;
	int SlotIdx;
	unsigned long bAdjacentIdx : 1;
};

struct AController_execOnToggleAffectedByHitEffects_Parms
{
	void* inAction;
};

struct AController_execOnToggleGodMode_Parms
{
	void* inAction;
};

struct AController_execOnTeleport_Parms
{
	void* Action;
};

struct AController_execOnMakeNoise_Parms
{
	void* Action;
};

struct AController_execIsDead_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AController_execGetHumanReadableName_Parms
{
	struct FString ReturnValue; // CPF_ReturnParm
};

struct AController_execDisplayDebug_Parms
{
	class AHUD* HUD;
	float out_YL; // CPF_OutParm
	float out_YPos; // CPF_OutParm
};

struct AController_execStopLatentExecution_Parms
{
};// FUNC_Final FUNC_Native

struct AController_execInLatentExecution_Parms
{
	int LatentActionNumber;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct AController_eventNotifyMissedJump_Parms
{
};// FUNC_Event

struct AController_eventNotifyJumpApex_Parms
{
};// FUNC_Event

struct AController_eventNotifyBump_Parms
{
	class AActor* Other;
	struct FVector HitNormal;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Event

struct AController_eventNotifyFallingHitWall_Parms
{
	struct FVector HitNormal;
	class AActor* Wall;
};// FUNC_Event

struct AController_eventNotifyHitWall_Parms
{
	struct FVector HitNormal;
	class AActor* Wall;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Event

struct AController_eventNotifyLanded_Parms
{
	struct FVector HitNormal;
	class AActor* FloorActor;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Event

struct AController_eventNotifyHeadVolumeChange_Parms
{
	void* NewVolume;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Event

struct AController_eventNotifyPhysicsVolumeChange_Parms
{
	void* NewVolume;
};// FUNC_Event

struct AController_execLandingShake_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AController_execIsAimingAt_Parms
{
	class AActor* ATarget;
	float Epsilon;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AController_eventGetActorEyesViewPoint_Parms
{
	struct FVector out_Location; // CPF_OutParm
	struct FRotator out_Rotation; // CPF_OutParm
};// FUNC_Event

struct AController_eventGetPlayerViewPoint_Parms
{
	struct FVector out_Location; // CPF_OutParm
	struct FRotator out_Rotation; // CPF_OutParm
};// FUNC_Event

struct AController_eventHandlePathObstruction_Parms
{
	class AActor* BlockedBy;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Event

struct AController_execUnderLift_Parms
{
	void* Lift;
};

struct AController_eventMoverFinished_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Event

struct AController_execWaitForMover_Parms
{
	void* M;
};

struct AController_eventAllowDetourTo_Parms
{
	class ANavigationPoint* N;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Event

struct AController_eventMayFall_Parms
{
};// FUNC_Event

struct AController_execEndClimbLadder_Parms
{
};// FUNC_Native

struct AController_eventLongFall_Parms
{
};// FUNC_Event

struct AController_execWaitForLanding_Parms
{
	float waitDuration;
};// FUNC_Final FUNC_Native NativeIndex[0x020F]

struct AController_execPickWallAdjust_Parms
{
	struct FVector HitNormal;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native NativeIndex[0x020E]

struct AController_eventMoveUnreachable_Parms
{
	struct FVector AttemptedDest;
	class AActor* AttemptedTarget;
};// FUNC_Event

struct AController_execActorReachable_Parms
{
	class AActor* anActor;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native NativeIndex[0x0208]

struct AController_execPointReachable_Parms
{
	struct FVector aPoint;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native NativeIndex[0x0209]

struct AController_execFindPathToIntercept_Parms
{
	class APawn* P;
	class AActor* InRouteGoal;
	unsigned long bWeightDetours : 1;
	int MaxPathLength;
	unsigned long bReturnPartial : 1;
	class AActor* ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct AController_execFindRandomDest_Parms
{
	class ANavigationPoint* ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native NativeIndex[0x020D]

struct AController_execFindPathTowardNearest_Parms
{
	class UClass* GoalClass;
	unsigned long bWeightDetours : 1;
	int MaxPathLength;
	unsigned long bReturnPartial : 1;
	class AActor* ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct AController_execFindPathToward_Parms
{
	class AActor* anActor;
	unsigned long bWeightDetours : 1;
	int MaxPathLength;
	unsigned long bReturnPartial : 1;
	class AActor* ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native NativeIndex[0x0205]

struct AController_execFindPathTo_Parms
{
	struct FVector aPoint;
	int MaxPathLength;
	unsigned long bReturnPartial : 1;
	class AActor* ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native NativeIndex[0x0206]

struct AController_execFinishRotation_Parms
{
};// FUNC_Final FUNC_Native NativeIndex[0x01FC]

struct AController_eventSetupSpecialPathAbilities_Parms
{
};// FUNC_Event

struct AController_execMoveToward_Parms
{
	class AActor* NewTarget;
	class AActor* ViewFocus;
	float DestinationOffset;
	unsigned long bUseStrafing : 1;
	unsigned long bShouldWalk : 1;
};// FUNC_Final FUNC_Native NativeIndex[0x01F6]

struct AController_execMoveTo_Parms
{
	struct FVector NewDestination;
	class AActor* ViewFocus;
	unsigned long bShouldWalk : 1;
};// FUNC_Final FUNC_Native NativeIndex[0x01F4]

struct AController_eventEnemyNotVisible_Parms
{
};// FUNC_Event

struct AController_eventSeeMonster_Parms
{
	class APawn* Seen;
};// FUNC_Event

struct AController_eventSeePlayer_Parms
{
	class APawn* Seen;
};// FUNC_Event

struct AController_eventHearNoise_Parms
{
	float Loudness;
	class AActor* NoiseMaker;
	struct FName NoiseType;
};// FUNC_Event

struct AController_execPickTarget_Parms
{
	class UClass* TargetClass;
	float bestAim; // CPF_OutParm
	float bestDist; // CPF_OutParm
	struct FVector FireDir;
	struct FVector projStart;
	float MaxRange;
	class APawn* ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native NativeIndex[0x0213]

struct AController_execCanSeeByPoints_Parms
{
	struct FVector ViewLocation;
	struct FVector TestLocation;
	struct FRotator ViewRotation;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native NativeIndex[0x0219]

struct AController_execCanSee_Parms
{
	class APawn* Other;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native NativeIndex[0x0215]

struct AController_execLineOfSightTo_Parms
{
	class AActor* Other;
	struct FVector chkLocation;
	unsigned long bTryAlternateTargetLoc : 1;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native NativeIndex[0x0202]

struct AController_execNotifyChangedWeapon_Parms
{
	class AWeapon* PrevWeapon;
	class AWeapon* NewWeapon;
};

struct AController_execClientSetWeapon_Parms
{
	class UClass* WeaponClass;
};

struct AController_execClientSwitchToBestWeapon_Parms
{
	unsigned long bForceNewWeapon : 1;
};

struct AController_execSwitchToBestWeapon_Parms
{
	unsigned long bForceNewWeapon : 1;
};// FUNC_Exec

struct AController_execReceiveProjectileWarning_Parms
{
	class AProjectile* Proj;
};

struct AController_execReceiveWarning_Parms
{
	class APawn* shooter;
	float projSpeed;
	struct FVector FireDir;
};

struct AController_execInstantWarnTarget_Parms
{
	class AActor* InTarget;
	class AWeapon* FiredWeapon;
	struct FVector FireDir;
};

struct AController_execGetAdjustedAimFor_Parms
{
	class AWeapon* W;
	struct FVector StartFireLoc;
	struct FRotator ReturnValue; // CPF_ReturnParm
};

struct AController_execHandlePickup_Parms
{
	class AInventory* Inv;
};

struct AController_execRoundHasEnded_Parms
{
	class AActor* EndRoundFocus;
};

struct AController_eventStopFiring_Parms
{
};// FUNC_Event

struct AController_execFireWeaponAt_Parms
{
	class AActor* inActor;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AController_eventRatePickup_Parms
{
	class AActor* PickupHolder;
	class UClass* inPickup;
	float ReturnValue; // CPF_ReturnParm
};// FUNC_Event

struct AController_execWarnProjExplode_Parms
{
	class AProjectile* Proj;
};

struct AController_execNotifyProjLanded_Parms
{
	class AProjectile* Proj;
};

struct AController_execNotifyKilled_Parms
{
	class AController* Killer;
	class AController* Killed;
	class APawn* KilledPawn;
};

struct AController_execGameHasEnded_Parms
{
	class AActor* EndGameFocus;
	unsigned long bIsWinner : 1;
};

struct AController_execSetCharacter_Parms
{
	struct FString inCharacter;
};

struct AController_execServerGivePawn_Parms
{
};

struct AController_execServerRestartPlayer_Parms
{
};

struct AController_execGetTeamNum_Parms
{
	unsigned char ReturnValue; // CPF_ReturnParm
};// FUNC_Native

struct AController_execInitPlayerReplicationInfo_Parms
{
};

struct AController_execNotifyTakeHit_Parms
{
	class AController* InstigatedBy;
	struct FVector HitLocation;
	int Damage;
	class UClass* DamageType;
	struct FVector Momentum;
};

struct AController_execEnemyJustTeleported_Parms
{
};

struct AController_execBeyondFogDistance_Parms
{
	struct FVector ViewPoint;
	struct FVector OtherPoint;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct AController_execRestart_Parms
{
	unsigned long bVehicleTransition : 1;
};

struct AController_execCleanupPRI_Parms
{
};

struct AController_eventDestroyed_Parms
{
};// FUNC_Event

struct AController_eventNotifyPostLanded_Parms
{
};// FUNC_Event

struct AController_execGoToDeadState_Parms
{
};

struct AController_execGamePlayEndedState_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AController_execPawnDied_Parms
{
	class APawn* inPawn;
};

struct AController_eventUnPossess_Parms
{
};// FUNC_Event

struct AController_execUpdateSex_Parms
{
};

struct AController_eventPossess_Parms
{
	class APawn* inPawn;
	unsigned long bVehicleTransition : 1;
};// FUNC_Event

struct AController_execOnPossess_Parms
{
	void* inAction;
};

struct AController_eventReplicatedEvent_Parms
{
	struct FName VarName;
};// FUNC_Event

struct AController_execClientSetRotation_Parms
{
	struct FRotator NewRotation;
	unsigned long bResetCamera : 1;
};

struct AController_execClientSetLocation_Parms
{
	struct FVector NewLocation;
	struct FRotator NewRotation;
};

struct AController_execReset_Parms
{
};

struct AController_eventPostBeginPlay_Parms
{
};// FUNC_Event

struct AController_execGetAdjustLocation_Parms
{
	struct FVector ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct AController_execSetAdjustLocation_Parms
{
	struct FVector NewLoc;
	unsigned long bAdjust : 1;
	unsigned long bOffsetFromBase : 1;
};// FUNC_Final FUNC_Native

struct AController_execGetDestinationPosition_Parms
{
	struct FVector ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct AController_execSetDestinationPosition_Parms
{
	struct FVector Dest;
	unsigned long bOffsetFromBase : 1;
};// FUNC_Final FUNC_Native

struct AController_execGetFocalPoint_Parms
{
	struct FVector ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct AController_execSetFocalPoint_Parms
{
	struct FVector FP;
	unsigned long bOffsetFromBase : 1;
};// FUNC_Final FUNC_Native

struct AController_execGetBasedPosition_Parms
{
	struct FBasedPosition BP;
	struct FVector ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct AController_execSetBasedPosition_Parms
{
	struct FBasedPosition BP; // CPF_OutParm
	struct FVector pos;
	class AActor* ForcedBase;
};// FUNC_Final FUNC_Native

struct AController_execRouteCache_RemoveIndex_Parms
{
	int InIndex;
	int Count;
};// FUNC_Native

struct AController_execRouteCache_RemoveItem_Parms
{
	class ANavigationPoint* Nav;
};// FUNC_Native

struct AController_execRouteCache_InsertItem_Parms
{
	class ANavigationPoint* Nav;
	int Idx;
};// FUNC_Native

struct AController_execRouteCache_AddItem_Parms
{
	class ANavigationPoint* Nav;
};// FUNC_Native

struct AController_execRouteCache_Empty_Parms
{
};// FUNC_Native

struct AController_execIsLocalPlayerController_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Native

// (0x1BC - 0x344)
class AController : public AActor
{
public:
	class APawn*                                       Pawn;                                        // 0x01BC (0x0004)
	class APlayerReplicationInfo*                      PlayerReplicationInfo;                       // 0x01C0 (0x0004)
	int                                                PlayerNum;                                   // 0x01C4 (0x0004)
	class AController*                                 NextController;                              // 0x01C8 (0x0004)
	unsigned long                                      bIsPlayer : 1;                               // 0x01CC (0x0004) [0x00000001]
	unsigned long                                      bGodMode : 1;                                // 0x01CC (0x0004) [0x00000002]
	unsigned long                                      bAffectedByHitEffects : 1;                   // 0x01CC (0x0004) [0x00000004]
	unsigned long                                      bSoaking : 1;                                // 0x01CC (0x0004) [0x00000008]
	unsigned long                                      bSlowerZAcquire : 1;                         // 0x01CC (0x0004) [0x00000010]
	unsigned long                                      bForceStrafe : 1;                            // 0x01CC (0x0004) [0x00000020]
	unsigned long                                      bNotifyPostLanded : 1;                       // 0x01CC (0x0004) [0x00000040]
	unsigned long                                      bNotifyApex : 1;                             // 0x01CC (0x0004) [0x00000080]
	unsigned long                                      bAdvancedTactics : 1;                        // 0x01CC (0x0004) [0x00000100]
	unsigned long                                      bCanDoSpecial : 1;                           // 0x01CC (0x0004) [0x00000200]
	unsigned long                                      bAdjusting : 1;                              // 0x01CC (0x0004) [0x00000400]
	unsigned long                                      bPreparingMove : 1;                          // 0x01CC (0x0004) [0x00000800]
	unsigned long                                      bLOSflag : 1;                                // 0x01CC (0x0004) [0x00001000]
	unsigned long                                      bUsePlayerHearing : 1;                       // 0x01CC (0x0004) [0x00002000]
	unsigned long                                      bNotifyFallingHitWall : 1;                   // 0x01CC (0x0004) [0x00004000]
	unsigned long                                      bForceDesiredRotation : 1;                   // 0x01CC (0x0004) [0x00008000]
	unsigned long                                      bPreciseDestination : 1;                     // 0x01CC (0x0004) [0x00010000]
	unsigned long                                      bSeeFriendly : 1;                            // 0x01CC (0x0004) [0x00020000]
	unsigned long                                      bUsingPathLanes : 1;                         // 0x01CC (0x0004) [0x00040000]
	unsigned char                                      bFire;                                       // 0x01D0 (0x0001)
	float                                              MinHitWall;                                  // 0x01D4 (0x0004)
	float                                              MoveTimer;                                   // 0x01D8 (0x0004)
	class AActor*                                      MoveTarget;                                  // 0x01DC (0x0004)
	struct FBasedPosition                              DestinationPosition;                         // 0x01E0 (0x0034)
	struct FBasedPosition                              FocalPosition;                               // 0x0214 (0x0034)
	class AActor*                                      Focus;                                       // 0x0248 (0x0004)
	class AActor*                                      GoalList[ 4 ];                               // 0x024C (0x0010)
	struct FBasedPosition                              AdjustPosition;                              // 0x025C (0x0034)
	class ANavigationPoint*                            StartSpot;                                   // 0x0290 (0x0004)
	TArray< class ANavigationPoint* >                  RouteCache;                                  // 0x0294 (0x000C)
	void*                                              CurrentPath;                                 // 0x02A0 (0x0004)
	void*                                              NextRoutePath;                               // 0x02A4 (0x0004)
	struct FVector                                     CurrentPathDir;                              // 0x02A8 (0x000C)
	class AActor*                                      RouteGoal;                                   // 0x02B4 (0x0004)
	float                                              RouteDist;                                   // 0x02B8 (0x0004)
	float                                              LastRouteFind;                               // 0x02BC (0x0004)
	void*                                              PendingMover;                                // 0x02C0 (0x0004)
	class AActor*                                      FailedMoveTarget;                            // 0x02C4 (0x0004)
	int                                                MoveFailureCount;                            // 0x02C8 (0x0004)
	float                                              GroundPitchTime;                             // 0x02CC (0x0004)
	struct FVector                                     ViewX;                                       // 0x02D0 (0x000C)
	struct FVector                                     ViewY;                                       // 0x02DC (0x000C)
	struct FVector                                     ViewZ;                                       // 0x02E8 (0x000C)
	class APawn*                                       ShotTarget;                                  // 0x02F4 (0x0004)
	class AActor*                                      LastFailedReach;                             // 0x02F8 (0x0004)
	float                                              FailedReachTime;                             // 0x02FC (0x0004)
	struct FVector                                     FailedReachLocation;                         // 0x0300 (0x000C)
	float                                              SightCounter;                                // 0x030C (0x0004)
	float                                              SightCounterInterval;                        // 0x0310 (0x0004)
	float                                              RespawnPredictionTime;                       // 0x0314 (0x0004)
	float                                              InUseNodeCostMultiplier;                     // 0x0318 (0x0004)
	int                                                HighJumpNodeCostModifier;                    // 0x031C (0x0004)
	class APawn*                                       Enemy;                                       // 0x0320 (0x0004)
	class AActor*                                      Target;                                      // 0x0324 (0x0004)
	TArray< struct FVisiblePortalInfo >                VisiblePortals;                              // 0x0328 (0x000C)
	float                                              LaneOffset;                                  // 0x0334 (0x0004)
	struct FRotator                                    OldBasedRotation;                            // 0x0338 (0x000C)

	// RoundEnded
	// Dead

private:
	static UClass* ClassPointer;

public:
	static UClass* StaticClass ()
	{
		if ( !ClassPointer )
			ClassPointer = UObject::FindClass( "Class Engine.Controller" );

		return ClassPointer;
	};

public:
	void ReadyForLift ()
	{
		static UFunction* pfnReadyForLift = NULL;

		if ( !pfnReadyForLift )
			pfnReadyForLift = UObject::FindObject< UFunction >( "Function Engine.Controller.ReadyForLift" );

		AController_execReadyForLift_Parms ReadyForLift_Parms;

		this->ProcessEvent( pfnReadyForLift, &ReadyForLift_Parms, NULL );
	};

	void SendMessage ( class APlayerReplicationInfo* Recipient, struct FName MessageType, float Wait, class UClass* DamageType/*CPF_OptionalParm*/ )
	{
		static UFunction* pfnSendMessage = NULL;

		if ( !pfnSendMessage )
			pfnSendMessage = UObject::FindObject< UFunction >( "Function Engine.Controller.SendMessage" );

		AController_execSendMessage_Parms SendMessage_Parms;
