/////////////////////////////////////////////////////////////////////////////
// Unreal Engine MiniSDK Generator by uNrEaL
// Game: CrimeCraft
// File: AGameInfo.h
// Date: 06/16/2011 @ 05:19:39.257
/////////////////////////////////////////////////////////////////////////////

#ifdef _MSC_VER
#pragma pack( push, 4 )
#endif

enum PlayerScoreType
{
	PSC_None = 0,
	PSC_Kill = 1,
	PSC_KillAssist = 2,
	PSC_GranadeKill = 3,
	PSC_MultiKill = 4,
	PSC_Death = 5,
	PSC_CLT = 6,
	PSC_CTF = 7,
	PSC_CTP = 8,
	PSC_CTPDefendKill = 9,
	PSC_CTPCaptureKill = 10,
	PSC_PTB = 11,
	PSC_ROB = 12,
	PSC_ROBBagCarrierKill = 13,
	PSC_ROBWithBagKill = 14,
	PSC_ROBDeposit = 15,
	PSC_ROBRobbery = 16,
	PSC_ROBMaxScoreCapture = 17,
	PSC_ROBBagCapture = 18,
	PSC_ROBBagReturn = 19,
	PSC_ROBDefendKill = 20,
	PSC_PICKUP = 21,
	PSC_TDM = 22,
	PSC_Headshot = 23,
	PSC_FirstBlood = 24,
	PSC_LastBulletKill = 25,
	PSC_HighLevelKill = 26,
	PSC_PenetrationKill = 27,
	PSC_MeleeKill = 28,
	PSC_BossKill = 29,
	PSC_BossKillAssist = 30,
	PSC_MineDestroy = 31,
	PSC_FFAKill = 32,
	PSC_CTF_FlagSteal = 33,
	PSC_CTF_FlagPickUp = 34,
	PSC_CTF_FlagReturn = 35,
	PSC_CTF_FlagCapture = 36,
	PSC_CTF_FlagCarrierKill = 37,
	PSC_CTF_WithFlagKill = 38,
	PSC_Suicide = 39,
	PSC_MAX = 40
};

struct AGameInfo_execAddPlayerScore_Parms
{
	class APlayerReplicationInfo* PRI;
	int ScoreToAdd;
	unsigned char PST;
	int ExtraData;
};

struct AGameInfo_execDoGameSpecificPerformanceSettings_Parms
{
	class AWorldInfo* TheWorldInfo;
};

struct AGameInfo_execDoTimeBasedSentinelStatGathering_Parms
{
};

struct AGameInfo_execDoSentinel_PerfAtSpecificLocation_Parms
{
	struct FVector InLocation;
	struct FRotator InRotation;
};// FUNC_Native

struct AGameInfo_execDoSentinel_MemoryAtSpecificLocation_Parms
{
	struct FVector InLocation;
	struct FRotator InRotation;
};// FUNC_Native

struct AGameInfo_execGetTravelLocations_Parms
{
	struct FName LevelName;
	class APlayerController* PC;
	TArray< struct FVector > TravelPoints; // CPF_OutParm
};// FUNC_Native

struct AGameInfo_execHandlePerLoadedMapAudioStats_Parms
{
};// FUNC_Native

struct AGameInfo_execDoSentinelActionPerLoadedMap_Parms
{
};// FUNC_Native

struct AGameInfo_execDoTravelTheWorld_Parms
{
};// FUNC_Exec

struct AGameInfo_execEndSentinelRun_Parms
{
	unsigned char RunResult;
};// FUNC_Native

struct AGameInfo_execAddSentinelPerTimePeriodStats_Parms
{
	struct FVector InLocation;
	struct FRotator InRotation;
};// FUNC_Native

struct AGameInfo_execBeginSentinelRun_Parms
{
	struct FString TaskDescription;
	struct FString TaskParameter;
	struct FString TagDesc;
};// FUNC_Native

struct AGameInfo_execTellClientsToTravelToSession_Parms
{
	struct FName SessionName;
	class UClass* SearchClass;
	unsigned char PlatformSpecificInfo[ 68 ];
};

struct AGameInfo_execTellClientsToReturnToPartyHost_Parms
{
	class APlayerReplicationInfo* PartyLeader;
};

struct AGameInfo_execIncrementNumberOfMatchesPlayed_Parms
{
};

struct AGameInfo_execIncrementAutomatedTestingMapIndex_Parms
{
};

struct AGameInfo_execCloseAutomatedMapTestTimer_Parms
{
};

struct AGameInfo_execStartAutomatedMapTestTimerWorker_Parms
{
};

struct AGameInfo_eventStartAutomatedMapTestTimer_Parms
{
};// FUNC_Event

struct AGameInfo_execOnServerCreateComplete_Parms
{
	struct FName SessionName;
	unsigned long bWasSuccessful : 1;
};

struct AGameInfo_execRegisterServer_Parms
{
};

struct AGameInfo_execOnLoginChange_Parms
{
	unsigned char LocalUserNum;
};

struct AGameInfo_execOnLoginFailed_Parms
{
	unsigned char LocalUserNum;
	unsigned char ErrorCode;
};

struct AGameInfo_execClearAutoLoginDelegates_Parms
{
};

struct AGameInfo_execProcessServerLogin_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AGameInfo_eventMatineeCancelled_Parms
{
};// FUNC_Event

struct AGameInfo_execRecalculateSkillRating_Parms
{
};

struct AGameInfo_execUpdateGameplayMuteList_Parms
{
	class APlayerController* PC;
};

struct AGameInfo_execNotifyArbitratedMatchEnd_Parms
{
};

struct AGameInfo_execMatchIsInProgress_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AGameInfo_execArbitrationRegistrationComplete_Parms
{
	struct FName SessionName;
	unsigned long bWasSuccessful : 1;
};

struct AGameInfo_execRegisterServerForArbitration_Parms
{
};

struct AGameInfo_execStartArbitratedMatch_Parms
{
};

struct AGameInfo_execStartArbitrationRegistration_Parms
{
};

struct AGameInfo_execProcessClientRegistrationCompletion_Parms
{
	class APlayerController* PC;
	unsigned long bWasSuccessful : 1;
};

struct AGameInfo_execUpdateGameSettingsCounts_Parms
{
};

struct AGameInfo_execSetSeamlessTravelViewTarget_Parms
{
	class APlayerController* PC;
};

struct AGameInfo_eventHandleSeamlessTravelPlayer_Parms
{
	class AController* C; // CPF_OutParm
};// FUNC_Event

struct AGameInfo_execUpdateGameSettings_Parms
{
};

struct AGameInfo_eventPostSeamlessTravel_Parms
{
};// FUNC_Event

struct AGameInfo_execSwapPlayerControllers_Parms
{
	class APlayerController* OldPC;
	class APlayerController* NewPC;
};// FUNC_Final FUNC_Native

struct AGameInfo_eventGetSeamlessTravelActorList_Parms
{
	unsigned long bToEntry : 1;
	TArray< class AActor* > ActorList; // CPF_OutParm
};// FUNC_Event

struct AGameInfo_execOverridePRI_Parms
{
	class APlayerController* PC;
	class APlayerReplicationInfo* OldPRI;
};

struct AGameInfo_execFindInactivePRI_Parms
{
	class APlayerController* PC;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AGameInfo_execAddInactivePRI_Parms
{
	class APlayerReplicationInfo* PRI;
	class APlayerController* PC;
};

struct AGameInfo_eventPostCommitMapChange_Parms
{
};// FUNC_Event

struct AGameInfo_eventPreCommitMapChange_Parms
{
	struct FString PreviousMapName;
	struct FString NextMapName;
};// FUNC_Event

struct AGameInfo_execAllowPausing_Parms
{
	class APlayerController* PC;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AGameInfo_execAllowCheats_Parms
{
	class APlayerController* P;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AGameInfo_execAllowMutator_Parms
{
	struct FString MutatorClassName;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AGameInfo_execPlayerCanRestart_Parms
{
	class APlayerController* aPlayer;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AGameInfo_execPlayerCanRestartGame_Parms
{
	class APlayerController* aPlayer;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AGameInfo_execKillBots_Parms
{
};// FUNC_Exec

struct AGameInfo_execDriverLeftVehicle_Parms
{
	class AVehicle* V;
	class APawn* P;
};

struct AGameInfo_execCanLeaveVehicle_Parms
{
	class AVehicle* V;
	class APawn* P;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AGameInfo_execDriverEnteredVehicle_Parms
{
	class AVehicle* V;
	class APawn* P;
};

struct AGameInfo_execParseMessageString_Parms
{
	class AController* Who;
	struct FString Message;
	struct FString ReturnValue; // CPF_ReturnParm
};

struct AGameInfo_execModifyScoreKill_Parms
{
	class AController* Killer;
	class AController* Other;
};

struct AGameInfo_execScoreKill_Parms
{
	class AController* Killer;
	class AController* Other;
	class UClass* DamageType;
	int WeaponID;
	unsigned long bFakeDeath : 1;
	int ShootFlags;
};

struct AGameInfo_execCheckScore_Parms
{
	class APlayerReplicationInfo* Scorer;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AGameInfo_execScoreObjective_Parms
{
	class APlayerReplicationInfo* Scorer;
	int Score;
};

struct AGameInfo_execAddObjectiveScore_Parms
{
	class APlayerReplicationInfo* Scorer;
	int Score;
};

struct AGameInfo_execRatePlayerStart_Parms
{
	void* P;
	unsigned char Team;
	class AController* Player;
	float ReturnValue; // CPF_ReturnParm
};

struct AGameInfo_execChoosePlayerStart_Parms
{
	class AController* Player;
	unsigned char InTeam;
	void* ReturnValue; // CPF_ReturnParm
};

struct AGameInfo_execFindPlayerStart_Parms
{
	class AController* Player;
	unsigned char InTeam;
	struct FString IncomingName;
	class ANavigationPoint* ReturnValue; // CPF_ReturnParm
};

struct AGameInfo_execShouldSpawnAtStartSpot_Parms
{
	class AController* Player;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AGameInfo_execEndLogging_Parms
{
	struct FString Reason;
};

struct AGameInfo_execEndOnlineGame_Parms
{
};

struct AGameInfo_execPerformEndGameHandling_Parms
{
};

struct AGameInfo_execEndGame_Parms
{
	class APlayerReplicationInfo* Winner;
	struct FString Reason;
};

struct AGameInfo_execWriteOnlinePlayerScores_Parms
{
};

struct AGameInfo_execWriteOnlineStats_Parms
{
};

struct AGameInfo_execCheckEndGame_Parms
{
	class APlayerReplicationInfo* Winner;
	struct FString Reason;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AGameInfo_execCheckModifiedEndGame_Parms
{
	class APlayerReplicationInfo* Winner;
	struct FString Reason;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AGameInfo_eventBroadcastLocalizedTeam_Parms
{
	int TeamIndex;
	class AActor* Sender;
	class UClass* Message;
	int Switch;
	class APlayerReplicationInfo* RelatedPRI1;
	class APlayerReplicationInfo* RelatedPRI2;
	class UObject* OptionalObject;
	int OptionalData;
};// FUNC_Event

struct AGameInfo_eventBroadcastLocalized_Parms
{
	class AActor* Sender;
	class UClass* Message;
	int Switch;
	class APlayerReplicationInfo* RelatedPRI1;
	class APlayerReplicationInfo* RelatedPRI2;
	class UObject* OptionalObject;
	int OptionalData;
};// FUNC_Event

struct AGameInfo_execBroadcastTeam_Parms
{
	class AController* Sender;
	struct FString msg;
	struct FName Type;
};

struct AGameInfo_eventBroadcast_Parms
{
	class AActor* Sender;
	struct FString msg;
	struct FName Type;
};// FUNC_Event

struct AGameInfo_execRestartGame_Parms
{
};

struct AGameInfo_execGetTravelType_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AGameInfo_execGetNextAutomatedTestingMap_Parms
{
	struct FString ReturnValue; // CPF_ReturnParm
};

struct AGameInfo_execGetNextMap_Parms
{
	struct FString ReturnValue; // CPF_ReturnParm
};

struct AGameInfo_execSendPlayer_Parms
{
	class APlayerController* aPlayer;
	struct FString URL;
};

struct AGameInfo_execPickTeam_Parms
{
	unsigned char Current;
	class AController* C;
	unsigned char ReturnValue; // CPF_ReturnParm
};

struct AGameInfo_execChangeTeam_Parms
{
	class AController* Other;
	int N;
	unsigned long bNewTeam : 1;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AGameInfo_execChangeName_Parms
{
	class AController* Other;
	struct FString S;
	unsigned long bNameChange : 1;
};

struct AGameInfo_execDiscardInventory_Parms
{
	class APawn* Other;
	class AController* Killer;
};

struct AGameInfo_execPickupQuery_Parms
{
	class APawn* Other;
	class UClass* ItemClass;
	class AActor* Pickup;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AGameInfo_execShouldRespawn_Parms
{
	void* Other;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AGameInfo_execCheckRelevance_Parms
{
	class AActor* Other;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AGameInfo_execReduceDamage_Parms
{
	int Damage; // CPF_OutParm
	class APawn* injured;
	class AController* InstigatedBy;
	struct FVector HitLocation;
	struct FVector Momentum; // CPF_OutParm
	class UClass* DamageType;
};

struct AGameInfo_execCanSpectate_Parms
{
	class APlayerController* Viewer;
	class APlayerReplicationInfo* ViewTarget;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AGameInfo_execKickBan_Parms
{
	struct FString S;
};

struct AGameInfo_execKick_Parms
{
	struct FString S;
};

struct AGameInfo_execParseKillMessage_Parms
{
	struct FString KillerName;
	struct FString VictimName;
	struct FString DeathMessage;
	struct FString ReturnValue; // CPF_ReturnParm
};

struct AGameInfo_execBroadcastDeathMessage_Parms
{
	class AController* Killer;
	class AController* Other;
	class UClass* DamageType;
};

struct AGameInfo_execPreventDeath_Parms
{
	class APawn* KilledPawn;
	class AController* Killer;
	class UClass* DamageType;
	struct FVector HitLocation;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AGameInfo_execKilled_Parms
{
	class AController* Killer;
	class AController* KilledPlayer;
	class APawn* KilledPawn;
	class UClass* DamageType;
};

struct AGameInfo_execNotifyKilled_Parms
{
	class AController* Killer;
	class AController* Killed;
	class APawn* KilledPawn;
};

struct AGameInfo_execSetPlayerDefaults_Parms
{
	class APawn* PlayerPawn;
};

struct AGameInfo_execMutate_Parms
{
	struct FString MutateString;
	class APlayerController* Sender;
};

struct AGameInfo_eventAddDefaultInventory_Parms
{
	class APawn* P;
};// FUNC_Event

struct AGameInfo_eventAcceptInventory_Parms
{
	class APawn* PlayerPawn;
};// FUNC_Event

struct AGameInfo_execUnregisterPlayer_Parms
{
	class APlayerController* PC;
};

struct AGameInfo_execLogout_Parms
{
	class AController* Exiting;
};

struct AGameInfo_eventPreExit_Parms
{
};// FUNC_Event

struct AGameInfo_execCalculatedNetSpeed_Parms
{
	int ReturnValue; // CPF_ReturnParm
};

struct AGameInfo_execUpdateNetSpeeds_Parms
{
};

struct AGameInfo_eventPostLogin_Parms
{
	class APlayerController* NewPlayer;
};// FUNC_Event

struct AGameInfo_execGenericPlayerInitialization_Parms
{
	class AController* C;
};

struct AGameInfo_execReplicateStreamingStatus_Parms
{
	class APlayerController* PC;
};

struct AGameInfo_execGetDefaultPlayerClass_Parms
{
	class AController* C;
	class UClass* ReturnValue; // CPF_ReturnParm
};

struct AGameInfo_execSpawnDefaultPawnFor_Parms
{
	class AController* NewPlayer;
	class ANavigationPoint* StartSpot;
	class APawn* ReturnValue; // CPF_ReturnParm
};

struct AGameInfo_execRestartPlayer_Parms
{
	class AController* NewPlayer;
};

struct AGameInfo_execStartBots_Parms
{
};

struct AGameInfo_execStartHumans_Parms
{
};

struct AGameInfo_execOnStartOnlineGameComplete_Parms
{
	struct FName SessionName;
	unsigned long bWasSuccessful : 1;
};

struct AGameInfo_execStartOnlineGame_Parms
{
};

struct AGameInfo_execStartMatch_Parms
{
};

struct AGameInfo_eventLogin_Parms
{
	struct FString Portal;
	struct FString Options;
	struct FString ErrorMessage; // CPF_OutParm
	class APlayerController* ReturnValue; // CPF_ReturnParm
};// FUNC_Event

struct AGameInfo_execAtCapacity_Parms
{
	unsigned long bSpectator : 1;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AGameInfo_eventPreLogin_Parms
{
	struct FString Options;
	struct FString Address;
	struct FString ErrorMessage; // CPF_OutParm
};// FUNC_Event

struct AGameInfo_execRequiresPassword_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AGameInfo_execProcessClientTravel_Parms
{
	struct FString URL; // CPF_OutParm
	struct FGuid NextMapGuid;
	unsigned long bSeamless : 1;
	unsigned long bAbsolute : 1;
	class APlayerController* ReturnValue; // CPF_ReturnParm
};

struct AGameInfo_execProcessServerTravel_Parms
{
	struct FString URL;
	unsigned long bAbsolute : 1;
};

struct AGameInfo_eventGetBeaconText_Parms
{
	struct FString ReturnValue; // CPF_ReturnParm
};// FUNC_Event

struct AGameInfo_execRemoveMutator_Parms
{
	void* MutatorToRemove;
};

struct AGameInfo_execAddGameRules_Parms
{
	class UClass* GRClass;
};

struct AGameInfo_execAddMutator_Parms
{
	struct FString mutname;
	unsigned long bUserAdded : 1;
};

struct AGameInfo_execParseAutomatedTestingOptions_Parms
{
	struct FString Options;
};

struct AGameInfo_eventNotifyPendingConnectionLost_Parms
{
};// FUNC_Event

struct AGameInfo_eventInitGame_Parms
{
	struct FString Options;
	struct FString ErrorMessage; // CPF_OutParm
};// FUNC_Event

struct AGameInfo_eventSetGameType_Parms
{
	struct FString MapName;
	struct FString Options;
	struct FString Portal;
	class UClass* ReturnValue; // CPF_ReturnParm
};// FUNC_Event

struct AGameInfo_eventGetDefaultGameClassPath_Parms
{
	struct FString MapName;
	struct FString Options;
	struct FString Portal;
	struct FString ReturnValue; // CPF_ReturnParm
};// FUNC_Event

struct AGameInfo_execGetIntOption_Parms
{
	struct FString Options;
	struct FString ParseString;
	int CurrentValue;
	int ReturnValue; // CPF_ReturnParm
};

struct AGameInfo_execHasOption_Parms
{
	struct FString Options;
	struct FString InKey;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AGameInfo_execParseOption_Parms
{
	struct FString Options;
	struct FString InKey;
	struct FString ReturnValue; // CPF_ReturnParm
};

struct AGameInfo_execGetKeyValue_Parms
{
	struct FString Pair;
	struct FString Key; // CPF_OutParm
	struct FString Value; // CPF_OutParm
};

struct AGameInfo_execGrabOption_Parms
{
	struct FString Options; // CPF_OutParm
	struct FString Result; // CPF_OutParm
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AGameInfo_execSetGameSpeed_Parms
{
	float T;
};

struct AGameInfo_execDebugPause_Parms
{
};

struct AGameInfo_execForceClearUnpauseDelegates_Parms
{
	class AActor* PauseActor;
};// FUNC_Final FUNC_Native

struct AGameInfo_eventClearPause_Parms
{
};// FUNC_Event

struct AGameInfo_execSetPause_Parms
{
	class APlayerController* PC;
	struct FScriptDelegate CanUnpauseDelegate;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AGameInfo_execCanUnpause_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AGameInfo_execGetServerPort_Parms
{
	int ReturnValue; // CPF_ReturnParm
};

struct AGameInfo_execGetNumPlayers_Parms
{
	int ReturnValue; // CPF_ReturnParm
};

struct AGameInfo_execGetNetworkNumber_Parms
{
	struct FString ReturnValue; // CPF_ReturnParm
};// FUNC_Native

struct AGameInfo_execInitGameReplicationInfo_Parms
{
};

struct AGameInfo_eventKickIdler_Parms
{
	class APlayerController* PC;
};// FUNC_Event

struct AGameInfo_eventGameEnding_Parms
{
};// FUNC_Event

struct AGameInfo_execNotifyNavigationChanged_Parms
{
	class ANavigationPoint* N;
};

struct AGameInfo_execDoNavFearCostFallOff_Parms
{
};// FUNC_Final FUNC_Native

struct AGameInfo_eventTimer_Parms
{
};// FUNC_Event

struct AGameInfo_execResetLevel_Parms
{
};

struct AGameInfo_execShouldReset_Parms
{
	class AActor* ActorToReset;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AGameInfo_execReset_Parms
{
};

struct AGameInfo_eventPostBeginPlay_Parms
{
};// FUNC_Event

struct AGameInfo_execGetCoverReplicator_Parms
{
	void* ReturnValue; // CPF_ReturnParm
};

struct AGameInfo_execUseLowGore_Parms
{
	class AWorldInfo* WI;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AGameInfo_execFindPlayerByID_Parms
{
	int PlayerID;
	struct FString ReturnValue; // CPF_ReturnParm
};

struct AGameInfo_eventPreBeginPlay_Parms
{
};// FUNC_Event

// (0x1BC - 0x394)
class AGameInfo : public AInfo
{
public:
	unsigned long                                      bRestartLevel : 1;                           // 0x01BC (0x0004) [0x00000001]
	unsigned long                                      bPauseable : 1;                              // 0x01BC (0x0004) [0x00000002]
	unsigned long                                      bTeamGame : 1;                               // 0x01BC (0x0004) [0x00000004]
	unsigned long                                      bGameEnded : 1;                              // 0x01BC (0x0004) [0x00000008]
	unsigned long                                      bOverTime : 1;                               // 0x01BC (0x0004) [0x00000010]
	unsigned long                                      bDelayedStart : 1;                           // 0x01BC (0x0004) [0x00000020]
	unsigned long                                      bWaitingToStartMatch : 1;                    // 0x01BC (0x0004) [0x00000040]
	unsigned long                                      bChangeLevels : 1;                           // 0x01BC (0x0004) [0x00000080]
	unsigned long                                      bAlreadyChanged : 1;                         // 0x01BC (0x0004) [0x00000100]
	unsigned long                                      bLoggingGame : 1;                            // 0x01BC (0x0004) [0x00000200]
	unsigned long                                      bAdminCanPause : 1;                          // 0x01BC (0x0004) [0x00000400]
	unsigned long                                      bGameRestarted : 1;                          // 0x01BC (0x0004) [0x00000800]
	unsigned long                                      bLevelChange : 1;                            // 0x01BC (0x0004) [0x00001000]
	unsigned long                                      bKickLiveIdlers : 1;                         // 0x01BC (0x0004) [0x00002000]
	unsigned long                                      bUsingArbitration : 1;                       // 0x01BC (0x0004) [0x00004000]
	unsigned long                                      bHasArbitratedHandshakeBegun : 1;            // 0x01BC (0x0004) [0x00008000]
	unsigned long                                      bNeedsEndGameHandshake : 1;                  // 0x01BC (0x0004) [0x00010000]
	unsigned long                                      bIsEndGameHandshakeComplete : 1;             // 0x01BC (0x0004) [0x00020000]
	unsigned long                                      bHasEndGameHandshakeBegun : 1;               // 0x01BC (0x0004) [0x00040000]
	unsigned long                                      bFixedPlayerStart : 1;                       // 0x01BC (0x0004) [0x00080000]
	unsigned long                                      bAutomatedPerfTesting : 1;                   // 0x01BC (0x0004) [0x00100000]
	unsigned long                                      bAutoContinueToNextRound : 1;                // 0x01BC (0x0004) [0x00200000]
	unsigned long                                      bUsingAutomatedTestingMapList : 1;           // 0x01BC (0x0004) [0x00400000]
	unsigned long                                      bAutomatedTestingWithOpen : 1;               // 0x01BC (0x0004) [0x00800000]
	unsigned long                                      bCheckingForFragmentation : 1;               // 0x01BC (0x0004) [0x01000000]
	unsigned long                                      bCheckingForMemLeaks : 1;                    // 0x01BC (0x0004) [0x02000000]
	unsigned long                                      bDoingASentinelRun : 1;                      // 0x01BC (0x0004) [0x04000000]
	unsigned long                                      bDoFearCostFallOff : 1;                      // 0x01BC (0x0004) [0x08000000]
	unsigned long                                      bUseSeamlessTravel : 1;                      // 0x01BC (0x0004) [0x10000000]
	unsigned long                                      bHasNetworkError : 1;                        // 0x01BC (0x0004) [0x20000000]
	unsigned long                                      bRequiresPushToTalk : 1;                     // 0x01BC (0x0004) [0x40000000]
	unsigned long                                      bSentinelStreamingLevelStillLoading : 1;     // 0x01BC (0x0004) [0x80000000]
	int                                                AutomatedPerfRemainingTime;                  // 0x01C0 (0x0004)
	int                                                AutomatedTestingMapIndex;                    // 0x01C4 (0x0004)
	TArray< struct FString >                           AutomatedMapTestingList;                     // 0x01C8 (0x000C)
	int                                                NumAutomatedMapTestingCycles;                // 0x01D4 (0x0004)
	int                                                NumberOfMatchesPlayed;                       // 0x01D8 (0x0004)
	int                                                NumMapListCyclesDone;                        // 0x01DC (0x0004)
	struct FString                                     AutomatedTestingExecCommandToRunAtStartMatch; // 0x01E0 (0x000C)
	struct FString                                     AutomatedMapTestingTransitionMap;            // 0x01EC (0x000C)
	struct FString                                     CauseEventCommand;                           // 0x01F8 (0x000C)
	struct FString                                     SentinelTaskDescription;                     // 0x0204 (0x000C)
	struct FString                                     SentinelTaskParameter;                       // 0x0210 (0x000C)
	struct FString                                     SentinelTagDesc;                             // 0x021C (0x000C)
	struct FString                                     BugLocString;                                // 0x0228 (0x000C)
	struct FString                                     BugRotString;                                // 0x0234 (0x000C)
	TArray< class APlayerController* >                 PendingArbitrationPCs;                       // 0x0240 (0x000C)
	TArray< class APlayerController* >                 ArbitrationPCs;                              // 0x024C (0x000C)
	float                                              ArbitrationHandshakeTimeout;                 // 0x0258 (0x0004)
	float                                              GameDifficulty;                              // 0x025C (0x0004)
	int                                                GoreLevel;                                   // 0x0260 (0x0004)
	float                                              GameSpeed;                                   // 0x0264 (0x0004)
	class UClass*                                      DefaultPawnClass;                            // 0x0268 (0x0004)
	class UClass*                                      ScoreBoardType;                              // 0x026C (0x0004)
	class UClass*                                      HUDType;                                     // 0x0270 (0x0004)
	int                                                MaxSpectators;                               // 0x0274 (0x0004)
	int                                                MaxSpectatorsAllowed;                        // 0x0278 (0x0004)
	int                                                NumSpectators;                               // 0x027C (0x0004)
	int                                                MaxPlayers;                                  // 0x0280 (0x0004)
	int                                                MaxPlayersAllowed;                           // 0x0284 (0x0004)
	int                                                NumPlayers;                                  // 0x0288 (0x0004)
	int                                                NumBots;                                     // 0x028C (0x0004)
	int                                                NumTravellingPlayers;                        // 0x0290 (0x0004)
	int                                                CurrentID;                                   // 0x0294 (0x0004)
	struct FString                                     DefaultPlayerName;                           // 0x0298 (0x000C)
	struct FString                                     GameName;                                    // 0x02A4 (0x000C)
	float                                              FearCostFallOff;                             // 0x02B0 (0x0004)
	int                                                GoalScore;                                   // 0x02B4 (0x0004)
	int                                                MaxLives;                                    // 0x02B8 (0x0004)
	int                                                TimeLimit;                                   // 0x02BC (0x0004)
	class UClass*                                      DeathMessageClass;                           // 0x02C0 (0x0004)
	class UClass*                                      GameMessageClass;                            // 0x02C4 (0x0004)
	void*                                              BaseMutator;                                 // 0x02C8 (0x0004)
	class UClass*                                      AccessControlClass;                          // 0x02CC (0x0004)
	void*                                              AccessControl;                               // 0x02D0 (0x0004)
	void*                                              GameRulesModifiers;                          // 0x02D4 (0x0004)
	class UClass*                                      BroadcastHandlerClass;                       // 0x02D8 (0x0004)
	void*                                              BroadcastHandler;                            // 0x02DC (0x0004)
	class UClass*                                      PlayerControllerClass;                       // 0x02E0 (0x0004)
	class UClass*                                      PlayerReplicationInfoClass;                  // 0x02E4 (0x0004)
	class UClass*                                      GameReplicationInfoClass;                    // 0x02E8 (0x0004)
	class AGameReplicationInfo*                        GameReplicationInfo;                         // 0x02EC (0x0004)
	float                                              MaxIdleTime;                                 // 0x02F0 (0x0004)
	float                                              MaxTimeMargin;                               // 0x02F4 (0x0004)
	float                                              TimeMarginSlack;                             // 0x02F8 (0x0004)
	float                                              MinTimeMargin;                               // 0x02FC (0x0004)
	TArray< class APlayerReplicationInfo* >            InactivePRIArray;                            // 0x0300 (0x000C)
	TArray< struct FScriptDelegate >                   Pausers;                                     // 0x030C (0x000C)
	class UOnlineSubsystem*                            OnlineSub;                                   // 0x0318 (0x0004)
	unsigned char                                      unknown_data08[ 8 ];                         // 0x031C (0x0008)
	class UClass*                                      OnlineStatsWriteClass;                       // 0x0324 (0x0004)
	int                                                LeaderboardId;                               // 0x0328 (0x0004)
	int                                                ArbitratedLeaderboardId;                     // 0x032C (0x0004)
	void*                                              CoverReplicatorBase;                         // 0x0330 (0x0004)
	class UClass*                                      OnlineGameSettingsClass;                     // 0x0334 (0x0004)
	struct FString                                     ServerOptions;                               // 0x0338 (0x000C)
	int                                                AdjustedNetSpeed;                            // 0x0344 (0x0004)
	float                                              LastNetSpeedUpdateTime;                      // 0x0348 (0x0004)
	int                                                TotalNetBandwidth;                           // 0x034C (0x0004)
	int                                                MinDynamicBandwidth;                         // 0x0350 (0x0004)
	int                                                MaxDynamicBandwidth;                         // 0x0354 (0x0004)
	class APlayerController*                           SentinelPC;                                  // 0x0358 (0x0004)
	class APawn*                                       SentinelPawn;                                // 0x035C (0x0004)
	TArray< class ANavigationPoint* >                  SentinelNavArray;                            // 0x0360 (0x000C)
	TArray< struct FVector >                           SentinelTravelArray;                         // 0x036C (0x000C)
	int                                                SentinelNavigationIdx;                       // 0x0378 (0x0004)
	int                                                SentinelIdx;                                 // 0x037C (0x0004)
	int                                                NumRotationsIncrement;                       // 0x0380 (0x0004)
	int                                                TravelPointsIncrement;                       // 0x0384 (0x0004)
	struct FScriptDelegate                             __CanUnpause__Delegate;                      // 0x0388 (0x000C)

	// TravelTheWorld
	// PendingMatch

private:
	static UClass* ClassPointer;

public:
	static UClass* StaticClass ()
	{
		if ( !ClassPointer )
			ClassPointer = UObject::FindClass( "Class Engine.GameInfo" );

		return ClassPointer;
	};

public:
	void AddPlayerScore ( class APlayerReplicationInfo* PRI, int ScoreToAdd, unsigned char PST/*CPF_OptionalParm*/, int ExtraData/*CPF_OptionalParm*/ )
	{
		static UFunction* pfnAddPlayerScore = NULL;

		if ( !pfnAddPlayerScore )
			pfnAddPlayerScore = UObject::FindObject< UFunction >( "Function Engine.GameInfo.AddPlayerScore" );

		AGameInfo_execAddPlayerScore_Parms AddPlayerScore_Parms;
		AddPlayerScore_Parms.PRI = PRI;
		AddPlayerScore_Parms.ScoreToAdd = ScoreToAdd;
		AddPlayerScore_Parms.PST = PST;
		AddPlayerScore_Parms.ExtraData = ExtraData;

		this->ProcessEvent( pfnAddPlayerScore, &AddPlayerScore_Parms, NULL );
	};

