/////////////////////////////////////////////////////////////////////////////
// Unreal Engine MiniSDK Generator by uNrEaL
// Game: CrimeCraft
// File: APawn.h
// Date: 06/16/2011 @ 05:19:39.487
/////////////////////////////////////////////////////////////////////////////

#ifdef _MSC_VER
#pragma pack( push, 4 )
#endif

enum EPathSearchType
{
	PST_Default = 0,
	PST_Breadth = 1,
	PST_NewBestPathTo = 2,
	PST_Constraint = 3,
	PST_MAX = 4
};

struct APawn_eventGetDemoPlayCameraLocationAndRotationAndUpdate_Parms
{
	struct FVector out_CamLoc; // CPF_OutParm
	struct FRotator out_CamRot; // CPF_OutParm
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Event

struct APawn_eventNotifyWorldCollisionResponse_Parms
{
	class AActor* With;
	struct FVector Delta;
	struct FVector Loc;
	struct FVector N;
	float Time;
	struct FVector AvoidanceNormal;
	struct FVector ReturnValue; // CPF_ReturnParm
};// FUNC_Event

struct APawn_eventNotifyPawnCollisionResponse_Parms
{
	class APawn* With;
	struct FVector Delta;
	struct FVector ReturnValue; // CPF_ReturnParm
};// FUNC_Event

struct APawn_execSetCinematicMode_Parms
{
	unsigned long bInCinematicMode : 1;
};

struct APawn_execZeroMovementVariables_Parms
{
};

struct APawn_execClearPathStep_Parms
{
};// FUNC_Native

struct APawn_execDrawPathStep_Parms
{
	class UCanvas* C;
};// FUNC_Native

struct APawn_execIncrementPathChild_Parms
{
	int Cnt;
	class UCanvas* C;
};// FUNC_Native

struct APawn_execIncrementPathStep_Parms
{
	int Cnt;
	class UCanvas* C;
};// FUNC_Native

struct APawn_execCreatePathGoalEvaluator_Parms
{
	class UClass* GoalEvalClass;
	void* ReturnValue; // CPF_ReturnParm
};

struct APawn_execCreatePathConstraint_Parms
{
	class UClass* ConstraintClass;
	void* ReturnValue; // CPF_ReturnParm
};

struct APawn_execAddGoalEvaluator_Parms
{
	void* Evaluator;
};// FUNC_Native

struct APawn_execAddPathConstraint_Parms
{
	void* Constraint;
};// FUNC_Native

struct APawn_execClearConstraints_Parms
{
};// FUNC_Native

struct APawn_eventSoakPause_Parms
{
};// FUNC_Event

struct APawn_eventBecomeViewTarget_Parms
{
	class APlayerController* PC;
};// FUNC_Event

struct APawn_execAdjustCameraScale_Parms
{
	unsigned long bMoveCameraIn : 1;
};

struct APawn_eventMessagePlayer_Parms
{
	struct FString msg;
};// FUNC_Final FUNC_Event

struct APawn_execEffectIsRelevant_Parms
{
	struct FVector SpawnLocation;
	unsigned long bForceDedicated : 1;
	float CullDistance;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct APawn_execOnTeleport_Parms
{
	void* Action;
};

struct APawn_execOnSetMaterial_Parms
{
	void* Action;
};

struct APawn_execInCombat_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct APawn_execPoweredUp_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct APawn_execGetDamageScaling_Parms
{
	float ReturnValue; // CPF_ReturnParm
};

struct APawn_execDoKismetAttachment_Parms
{
	class AActor* Attachment;
	void* Action;
};

struct APawn_eventSpawnedByKismet_Parms
{
};// FUNC_Event

struct APawn_execIsStationary_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct APawn_execGetCollisionExtent_Parms
{
	struct FVector ReturnValue; // CPF_ReturnParm
};// FUNC_Final

struct APawn_execGetCollisionHeight_Parms
{
	float ReturnValue; // CPF_ReturnParm
};

struct APawn_execGetCollisionRadius_Parms
{
	float ReturnValue; // CPF_ReturnParm
};

struct APawn_execCheatFly_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct APawn_execCheatGhost_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct APawn_execCheatWalk_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct APawn_execPlayWeaponSwitch_Parms
{
	class AWeapon* OldWeapon;
	class AWeapon* NewWeapon;
};

struct APawn_execSetActiveWeapon_Parms
{
	class AWeapon* NewWeapon;
};

struct APawn_execTossInventory_Parms
{
	class AInventory* Inv;
	struct FVector ForceVelocity;
	class UClass* DamageType;
};

struct APawn_execOnThrowActiveWeapon_Parms
{
	void* Action;
};

struct APawn_execThrowActiveWeapon_Parms
{
	class UClass* DamageType;
};

struct APawn_execDrawHUD_Parms
{
	class AHUD* H;
};

struct APawn_execFindInventoryType_Parms
{
	class UClass* DesiredClass;
	unsigned long bAllowSubclass : 1;
	class AInventory* ReturnValue; // CPF_ReturnParm
};// FUNC_Final

struct APawn_eventCreateInventory_Parms
{
	class UClass* NewInvClass;
	unsigned long bDoNotActivate : 1;
	class AInventory* ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Event

struct APawn_execAddDefaultInventory_Parms
{
};

struct APawn_eventStopDriving_Parms
{
	class AVehicle* V;
};// FUNC_Event

struct APawn_eventStartDriving_Parms
{
	class AVehicle* V;
};// FUNC_Event

struct APawn_execCanThrowWeapon_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct APawn_execSuicide_Parms
{
};

struct APawn_execGetVehicleBase_Parms
{
	class AVehicle* ReturnValue; // CPF_ReturnParm
};// FUNC_Native

struct APawn_execPlayLanded_Parms
{
	float ImpactVel;
};

struct APawn_execCannotJumpNow_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct APawn_eventPlayFootStepSound_Parms
{
	int FootDown;
};// FUNC_Event

struct APawn_eventTornOff_Parms
{
};// FUNC_Event

struct APawn_execPlayDying_Parms
{
	class UClass* DamageType;
	struct FVector HitLoc;
};

struct APawn_execPerformStartDying_Parms
{
};

struct APawn_execTurnOff_Parms
{
};

struct APawn_execPlayHit_Parms
{
	float Damage;
	class AController* InstigatedBy;
	struct FVector HitLocation;
	class UClass* DamageType;
	struct FVector Momentum;
	struct FTraceHitInfo HitInfo;
	struct FAdditionalHitInfo AddInfo;
};

struct APawn_execPlayDyingSound_Parms
{
};

struct APawn_execDoJump_Parms
{
	unsigned long bUpdating : 1;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct APawn_execCheckWaterJump_Parms
{
	struct FVector WallNormal; // CPF_OutParm
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct APawn_execTakeDrowningDamage_Parms
{
};

struct APawn_eventBreathTimer_Parms
{
};// FUNC_Event

struct APawn_execIsInPain_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct APawn_execTouchingWaterVolume_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct APawn_eventHeadVolumeChange_Parms
{
	void* newHeadVolume;
};// FUNC_Event

struct APawn_eventLanded_Parms
{
	struct FVector HitNormal;
	class AActor* FloorActor;
};// FUNC_Event

struct APawn_eventHitWall_Parms
{
	struct FVector HitNormal;
	class AActor* Wall;
	class UPrimitiveComponent* WallComp;
};// FUNC_Event

struct APawn_eventFalling_Parms
{
};// FUNC_Event

struct APawn_execDied_Parms
{
	class AController* Killer;
	class UClass* DamageType;
	struct FVector HitLocation;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct APawn_eventIsSameTeam_Parms
{
	class APawn* Other;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Event

struct APawn_execGetTeam_Parms
{
	class ATeamInfo* ReturnValue; // CPF_ReturnParm
};

struct APawn_execGetTeamNum_Parms
{
	unsigned char ReturnValue; // CPF_ReturnParm
};// FUNC_Native

struct APawn_eventTakeDamage_Parms
{
	int Damage;
	class AController* InstigatedBy;
	struct FVector HitLocation;
	struct FVector Momentum;
	class UClass* DamageType;
	struct FTraceHitInfo HitInfo;
	class AActor* DamageCauser;
	struct FAdditionalHitInfo AddInfo;
};// FUNC_Event

struct APawn_eventHealthBelowZero_Parms
{
	int Damage;
	class AController* InstigatedBy;
	struct FVector HitLocation;
	struct FVector Momentum;
	class UClass* DamageType;
	struct FTraceHitInfo HitInfo;
	class AActor* DamageCauser;
	struct FAdditionalHitInfo AddInfo;
};// FUNC_Event

struct APawn_execSetKillInstigator_Parms
{
	class AController* InstigatedBy;
	class UClass* DamageType;
	class AController* ReturnValue; // CPF_ReturnParm
};

struct APawn_execNotifyTakeHit_Parms
{
	class AController* InstigatedBy;
	struct FVector HitLocation;
	int Damage;
	class UClass* DamageType;
	struct FVector Momentum;
};

struct APawn_eventTakeRadiusDamageOnBones_Parms
{
	class AController* InstigatedBy;
	float BaseDamage;
	float DamageRadius;
	class UClass* DamageType;
	float Momentum;
	struct FVector HurtOrigin;
	unsigned long bFullDamage : 1;
	class AActor* DamageCauser;
	TArray< struct FName > Bones;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Event

struct APawn_execPruneDamagedBoneList_Parms
{
	TArray< struct FName > Bones; // CPF_OutParm
};

struct APawn_execHealDamage_Parms
{
	int Amount;
	class AController* Healer;
	class UClass* DamageType;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct APawn_execAdjustDamage_Parms
{
	int inDamage; // CPF_OutParm
	struct FVector Momentum; // CPF_OutParm
	class AController* InstigatedBy;
	struct FVector HitLocation;
	class UClass* DamageType;
	struct FTraceHitInfo HitInfo;
};

struct APawn_execSetMovementPhysics_Parms
{
};

struct APawn_execGasp_Parms
{
};

struct APawn_execOnGiveInventory_Parms
{
	void* inAction;
};

struct APawn_execOnAssignController_Parms
{
	void* inAction;
};

struct APawn_execSpawnDefaultController_Parms
{
};

struct APawn_eventPostBeginPlay_Parms
{
};// FUNC_Event

struct APawn_eventPreBeginPlay_Parms
{
};// FUNC_Event

struct APawn_eventDestroyed_Parms
{
};// FUNC_Event

struct APawn_execDetachFromController_Parms
{
	unsigned long bDestroyController : 1;
};

struct APawn_execCrushedBy_Parms
{
	class APawn* OtherPawn;
};

struct APawn_execCanBeBaseForPawn_Parms
{
	class APawn* aPawn;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct APawn_eventBaseChange_Parms
{
};// FUNC_Event

struct APawn_eventStuckOnPawn_Parms
{
	class APawn* OtherPawn;
};// FUNC_Event

struct APawn_execJumpOffPawn_Parms
{
};

struct APawn_execgibbedBy_Parms
{
	class AActor* Other;
};

struct APawn_eventEncroachedBy_Parms
{
	class AActor* Other;
};// FUNC_Event

struct APawn_eventEncroachingOn_Parms
{
	class AActor* Other;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Event

struct APawn_execFaceRotation_Parms
{
	struct FRotator NewRotation;
	float DeltaTime;
};

struct APawn_execClientSetRotation_Parms
{
	struct FRotator NewRotation;
};

struct APawn_execClientSetLocation_Parms
{
	struct FVector NewLocation;
	struct FRotator NewRotation;
};

struct APawn_execClientRestart_Parms
{
};

struct APawn_execRestart_Parms
{
};

struct APawn_execTakeFallingDamage_Parms
{
};

struct APawn_execKilledBy_Parms
{
	class APawn* EventInstigator;
};

struct APawn_execAddVelocity_Parms
{
	struct FVector NewVelocity;
	struct FVector HitLocation;
	class UClass* DamageType;
	struct FTraceHitInfo HitInfo;
};

struct APawn_execRestartPlayer_Parms
{
};

struct APawn_eventStartCrouch_Parms
{
	float HeightAdjust;
};// FUNC_Event

struct APawn_eventEndCrouch_Parms
{
	float HeightAdjust;
};// FUNC_Event

struct APawn_execShouldCrouch_Parms
{
	unsigned long bCrouch : 1;
};

struct APawn_execUnCrouch_Parms
{
};

struct APawn_eventOutsideWorldBounds_Parms
{
};// FUNC_Event

struct APawn_eventFellOutOfWorld_Parms
{
	class UClass* dmgType;
};// FUNC_Event

struct APawn_eventModifyVelocity_Parms
{
	float DeltaTime;
	struct FVector OldVelocity;
};// FUNC_Event

struct APawn_execJumpOutOfWater_Parms
{
	struct FVector jumpDir;
};

struct APawn_execFinishedInterpolation_Parms
{
};

struct APawn_eventClientMessage_Parms
{
	struct FString S;
	struct FName Type;
};// FUNC_Event

struct APawn_execReceiveLocalizedMessage_Parms
{
	class UClass* Message;
	int Switch;
	class APlayerReplicationInfo* RelatedPRI1;
	class APlayerReplicationInfo* RelatedPRI2;
	class UObject* OptionalObject;
	int OptionalData;
};

struct APawn_execHandlePickup_Parms
{
	class AInventory* Inv;
};

struct APawn_execAdjustedStrength_Parms
{
	float ReturnValue; // CPF_ReturnParm
};

struct APawn_execLineOfSightTo_Parms
{
	class AActor* Other;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct APawn_execSetMoveTarget_Parms
{
	class AActor* NewTarget;
};

struct APawn_execGetMoveTarget_Parms
{
	class AActor* ReturnValue; // CPF_ReturnParm
};

struct APawn_execNearMoveTarget_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct APawn_execAffectedByHitEffects_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct APawn_execInGodMode_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct APawn_execPawnCalcCamera_Parms
{
	float fDeltaTime;
	struct FVector out_CamLoc; // CPF_OutParm
	struct FRotator out_CamRot; // CPF_OutParm
	float out_FOV; // CPF_OutParm
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct APawn_execSetViewRotation_Parms
{
	struct FRotator NewRotation;
};

struct APawn_execGetAdjustedAimFor_Parms
{
	class AWeapon* W;
	struct FVector StartFireLoc;
	struct FRotator ReturnValue; // CPF_ReturnParm
};

struct APawn_eventInFreeCam_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Event

struct APawn_eventGetBaseAimRotation_Parms
{
	struct FRotator ReturnValue; // CPF_ReturnParm
};// FUNC_Event

struct APawn_eventGetWeaponStartTraceLocation_Parms
{
	class AWeapon* CurrentWeapon;
	struct FVector ReturnValue; // CPF_ReturnParm
};// FUNC_Event

struct APawn_eventGetPawnViewLocation_Parms
{
	struct FVector ReturnValue; // CPF_ReturnParm
};// FUNC_Event FUNC_Native

struct APawn_eventGetViewRotation_Parms
{
	struct FRotator ReturnValue; // CPF_ReturnParm
};// FUNC_Event FUNC_Native

struct APawn_eventGetActorEyesViewPoint_Parms
{
	struct FVector out_Location; // CPF_OutParm
	struct FRotator out_Rotation; // CPF_OutParm
};// FUNC_Event

struct APawn_execProcessViewRotation_Parms
{
	float DeltaTime;
	struct FRotator out_ViewRotation; // CPF_OutParm
	struct FRotator out_DeltaRot; // CPF_OutParm
};

struct APawn_execIsFirstPerson_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct APawn_execWasPlayerPawn_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct APawn_execIsPlayerPawn_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Native

struct APawn_execIsLocallyControlled_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct APawn_execIsHumanControlled_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct APawn_execDisplayDebug_Parms
{
	class AHUD* HUD;
	float out_YL; // CPF_OutParm
	float out_YPos; // CPF_OutParm
};

struct APawn_execClimbLadder_Parms
{
	void* L;
};

struct APawn_execEndClimbLadder_Parms
{
	void* OldLadder;
};

struct APawn_execCanSplash_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct APawn_eventSetWalking_Parms
{
	unsigned long bNewIsWalking : 1;
};// FUNC_Event

struct APawn_execRangedAttackTime_Parms
{
	float ReturnValue; // CPF_ReturnParm
};

struct APawn_execRecommendLongRangedAttack_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct APawn_execCanGrabLadder_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct APawn_execDropToGround_Parms
{
};

struct APawn_execGetDefaultCameraMode_Parms
{
	class APlayerController* RequestedBy;
	struct FName ReturnValue; // CPF_ReturnParm
};

struct APawn_execUnPossessed_Parms
{
};

struct APawn_execUpdateControllerOnPossess_Parms
{
	unsigned long bVehicleTransition : 1;
};

struct APawn_execPossessedBy_Parms
{
	class AController* C;
	unsigned long bVehicleTransition : 1;
};

struct APawn_execNotifyTeamChanged_Parms
{
};

struct APawn_execPlayTeleportEffect_Parms
{
	unsigned long bOut : 1;
	unsigned long bSound : 1;
};

struct APawn_execGetHumanReadableName_Parms
{
	struct FString ReturnValue; // CPF_ReturnParm
};

struct APawn_execNeedToTurn_Parms
{
	struct FVector targ;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct APawn_execIsFiring_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct APawn_execHasRangedAttack_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct APawn_execFireOnRelease_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct APawn_execTooCloseToAttack_Parms
{
	class AActor* Other;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct APawn_execCanAttack_Parms
{
	class AActor* Other;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct APawn_execChooseFireMode_Parms
{
	unsigned char ReturnValue; // CPF_ReturnParm
};

struct APawn_execBotFire_Parms
{
	unsigned long bFinished : 1;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct APawn_execWeaponStoppedFiring_Parms
{
	unsigned long bViaReplication : 1;
};

struct APawn_execWeaponFired_Parms
{
	unsigned long bViaReplication : 1;
	struct FVector StartTraceLocation;
	struct FVector EndTraceLocation;
	struct FAdditionalHitInfo AddInfo;
};

struct APawn_execFlashLocationUpdated_Parms
{
	unsigned long bViaReplication : 1;
};

struct APawn_execFlashCountUpdated_Parms
{
	unsigned long bViaReplication : 1;
};

struct APawn_execClearFlashLocation_Parms
{
	class AWeapon* Who;
};

struct APawn_execSetFlashLocation_Parms
{
	class AWeapon* Who;
	unsigned char FireModeNum;
	struct FVector NewStartTraceLoc;
	struct FVector NewLoc;
	struct FAdditionalHitInfo AddInfo;
};

struct APawn_execClearFlashCount_Parms
{
	class AWeapon* Who;
};

struct APawn_execIncrementFlashCount_Parms
{
	class AWeapon* Who;
	unsigned char FireModeNum;
};

struct APawn_execFiringModeUpdated_Parms
{
	unsigned long bViaReplication : 1;
};

struct APawn_execSetFiringMode_Parms
{
	unsigned char FiringModeNum;
};

struct APawn_execStopFire_Parms
{
	unsigned char FireModeNum;
};

struct APawn_execStartFire_Parms
{
	unsigned char FireModeNum;
};

struct APawn_execStopFiring_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct APawn_execReset_Parms
{
};

struct APawn_execPlayerChangedTeam_Parms
{
};

struct APawn_execSetBaseEyeheight_Parms
{
};

struct APawn_execSpecialMoveTo_Parms
{
	class ANavigationPoint* Start;
	class ANavigationPoint* End;
	class AActor* Next;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct APawn_execTermRagdoll_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Native

struct APawn_execInitRagdoll_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Native

struct APawn_execIsValidEnemy_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct APawn_execSpecialCostForPath_Parms
{
	void* Path;
	int ReturnValue; // CPF_ReturnParm
};

struct APawn_execGetBoundingCylinder_Parms
{
	float CollisionRadius; // CPF_OutParm
	float CollisionHeight; // CPF_OutParm
};// FUNC_Native

struct APawn_execReachedDesiredRotation_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct APawn_execSetPushesRigidBodies_Parms
{
	unsigned long NewPush : 1;
};// FUNC_Native

struct APawn_execForceCrouch_Parms
{
};// FUNC_Native

struct APawn_execReachedPoint_Parms
{
	struct FVector Point;
	class AActor* NewAnchor;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Native

struct APawn_execReachedDestination_Parms
{
	class AActor* Goal;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Native

struct APawn_execGetBestAnchor_Parms
{
	class AActor* TestActor;
	struct FVector TestLocation;
	unsigned long bStartPoint : 1;
	unsigned long bOnlyCheckVisible : 1;
	float out_Dist; // CPF_OutParm
	class ANavigationPoint* ReturnValue; // CPF_ReturnParm
};// FUNC_Native

struct APawn_execSetAnchor_Parms
{
	class ANavigationPoint* NewAnchor;
};// FUNC_Native

struct APawn_execSetRemoteViewPitch_Parms
{
	int NewRemoteViewPitch;
};// FUNC_Final FUNC_Native

struct APawn_execIsInvisible_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Native

struct APawn_execIsValidEnemyTargetFor_Parms
{
	class APlayerReplicationInfo* PRI;
	unsigned long bNoPRIisEnemy : 1;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Native

struct APawn_execIsValidTargetFor_Parms
{
	class AController* C;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Native

struct APawn_execSuggestJumpVelocity_Parms
{
	struct FVector JumpVelocity; // CPF_OutParm
	struct FVector Destination;
	struct FVector Start;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Native

struct APawn_execValidAnchor_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct APawn_execAdjustDestination_Parms
{
	class AActor* GoalActor;
	struct FVector Dest;
	struct FVector ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct APawn_execIsAliveAndWell_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct APawn_eventReplicatedEvent_Parms
{
	struct FName VarName;
};// FUNC_Event

struct APawn_execGetBasedPosition_Parms
{
	struct FBasedPosition BP;
	struct FVector ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct APawn_execSetBasedPosition_Parms
{
	struct FBasedPosition BP; // CPF_OutParm
	struct FVector pos;
	class AActor* ForcedBase;
};// FUNC_Final FUNC_Native

// (0x1BC - 0x3D8)
class APawn : public AActor
{
public:
	float                                              MaxStepHeight;                               // 0x01BC (0x0004)
	float                                              MaxJumpHeight;                               // 0x01C0 (0x0004)
	float                                              WalkableFloorZ;                              // 0x01C4 (0x0004)
	class AController*                                 Controller;                                  // 0x01C8 (0x0004)
	class APawn*                                       NextPawn;                                    // 0x01CC (0x0004)
	float                                              NetRelevancyCacheTime;                       // 0x01D0 (0x0004)
	TArray< int >                                      NetRelevancyCache;                           // 0x01D4 (0x000C)
	unsigned long                                      bUpAndOut : 1;                               // 0x01E0 (0x0004) [0x00000001]
	unsigned long                                      bIsWalking : 1;                              // 0x01E0 (0x0004) [0x00000002]
	unsigned long                                      bWantsToCrouch : 1;                          // 0x01E0 (0x0004) [0x00000004]
	unsigned long                                      bIsCrouched : 1;                             // 0x01E0 (0x0004) [0x00000008]
	unsigned long                                      bTryToUncrouch : 1;                          // 0x01E0 (0x0004) [0x00000010]
	unsigned long                                      bCanCrouch : 1;                              // 0x01E0 (0x0004) [0x00000020]
	unsigned long                                      bCrawler : 1;                                // 0x01E0 (0x0004) [0x00000040]
	unsigned long                                      bReducedSpeed : 1;                           // 0x01E0 (0x0004) [0x00000080]
	unsigned long                                      bJumpCapable : 1;                            // 0x01E0 (0x0004) [0x00000100]
	unsigned long                                      bCanJump : 1;                                // 0x01E0 (0x0004) [0x00000200]
	unsigned long                                      bCanWalk : 1;                                // 0x01E0 (0x0004) [0x00000400]
	unsigned long                                      bCanSwim : 1;                                // 0x01E0 (0x0004) [0x00000800]
	unsigned long                                      bCanFly : 1;                                 // 0x01E0 (0x0004) [0x00001000]
	unsigned long                                      bCanClimbLadders : 1;                        // 0x01E0 (0x0004) [0x00002000]
	unsigned long                                      bCanStrafe : 1;                              // 0x01E0 (0x0004) [0x00004000]
	unsigned long                                      bAvoidLedges : 1;                            // 0x01E0 (0x0004) [0x00008000]
	unsigned long                                      bStopAtLedges : 1;                           // 0x01E0 (0x0004) [0x00010000]
	unsigned long                                      bSimulateGravity : 1;                        // 0x01E0 (0x0004) [0x00020000]
	unsigned long                                      bIgnoreForces : 1;                           // 0x01E0 (0x0004) [0x00040000]
	unsigned long                                      bCanWalkOffLedges : 1;                       // 0x01E0 (0x0004) [0x00080000]
	unsigned long                                      bCanBeBaseForPawns : 1;                      // 0x01E0 (0x0004) [0x00100000]
	unsigned long                                      bSimGravityDisabled : 1;                     // 0x01E0 (0x0004) [0x00200000]
	unsigned long                                      bDirectHitWall : 1;                          // 0x01E0 (0x0004) [0x00400000]
	unsigned long                                      bPushesRigidBodies : 1;                      // 0x01E0 (0x0004) [0x00800000]
	unsigned long                                      bForceFloorCheck : 1;                        // 0x01E0 (0x0004) [0x01000000]
	unsigned long                                      bForceKeepAnchor : 1;                        // 0x01E0 (0x0004) [0x02000000]
	unsigned long                                      bCanMantle : 1;                              // 0x01E0 (0x0004) [0x04000000]
	unsigned long                                      bCanClimbUp : 1;                             // 0x01E0 (0x0004) [0x08000000]
	unsigned long                                      bCanClimbCeilings : 1;                       // 0x01E0 (0x0004) [0x10000000]
	unsigned long                                      bCanSwatTurn : 1;                            // 0x01E0 (0x0004) [0x20000000]
	unsigned long                                      bCanLeap : 1;                                // 0x01E0 (0x0004) [0x40000000]
	unsigned long                                      bCanCoverSlip : 1;                           // 0x01E0 (0x0004) [0x80000000]
	unsigned long                                      bDisplayPathErrors : 1;                      // 0x01E4 (0x0004) [0x00000001]
	unsigned long                                      bIsFemale : 1;                               // 0x01E4 (0x0004) [0x00000002]
	unsigned long                                      bCanPickupInventory : 1;                     // 0x01E4 (0x0004) [0x00000004]
	unsigned long                                      bAmbientCreature : 1;                        // 0x01E4 (0x0004) [0x00000008]
	unsigned long                                      bLOSHearing : 1;                             // 0x01E4 (0x0004) [0x00000010]
	unsigned long                                      bMuffledHearing : 1;                         // 0x01E4 (0x0004) [0x00000020]
	unsigned long                                      bDontPossess : 1;                            // 0x01E4 (0x0004) [0x00000040]
	unsigned long                                      bAutoFire : 1;                               // 0x01E4 (0x0004) [0x00000080]
	unsigned long                                      bRollToDesired : 1;                          // 0x01E4 (0x0004) [0x00000100]
	unsigned long                                      bStationary : 1;                             // 0x01E4 (0x0004) [0x00000200]
	unsigned long                                      bCachedRelevant : 1;                         // 0x01E4 (0x0004) [0x00000400]
	unsigned long                                      bSpecialHUD : 1;                             // 0x01E4 (0x0004) [0x00000800]
	unsigned long                                      bNoWeaponFiring : 1;                         // 0x01E4 (0x0004) [0x00001000]
	unsigned long                                      bCanUse : 1;                                 // 0x01E4 (0x0004) [0x00002000]
	unsigned long                                      bModifyReachSpecCost : 1;                    // 0x01E4 (0x0004) [0x00004000]
	unsigned long                                      bModifyNavPointDest : 1;                     // 0x01E4 (0x0004) [0x00008000]
	unsigned long                                      bPathfindsAsVehicle : 1;                     // 0x01E4 (0x0004) [0x00010000]
	unsigned long                                      bRunPhysicsWithNoController : 1;             // 0x01E4 (0x0004) [0x00020000]
	unsigned long                                      bForceMaxAccel : 1;                          // 0x01E4 (0x0004) [0x00040000]
	unsigned long                                      bForceRMVelocity : 1;                        // 0x01E4 (0x0004) [0x00080000]
	unsigned long                                      bForceRegularVelocity : 1;                   // 0x01E4 (0x0004) [0x00100000]
	unsigned long                                      bPlayedDeath : 1;                            // 0x01E4 (0x0004) [0x00200000]
	float                                              UncrouchTime;                                // 0x01E8 (0x0004)
	float                                              CrouchHeight;                                // 0x01EC (0x0004)
	float                                              CrouchRadius;                                // 0x01F0 (0x0004)
	int                                                FullHeight;                                  // 0x01F4 (0x0004)
	float                                              NonPreferredVehiclePathMultiplier;           // 0x01F8 (0x0004)
	unsigned char                                      PathSearchType;                              // 0x01FC (0x0001)
	unsigned char                                      RemoteViewPitch;                             // 0x01FD (0x0001)
	unsigned char                                      FlashCount;                                  // 0x01FE (0x0001)
	unsigned char                                      FiringMode;                                  // 0x01FF (0x0001)
	void*                                              PathConstraintList;                          // 0x0200 (0x0004)
	void*                                              PathGoalList;                                // 0x0204 (0x0004)
	float                                              DesiredSpeed;                                // 0x0208 (0x0004)
	float                                              MaxDesiredSpeed;                             // 0x020C (0x0004)
	float                                              HearingThreshold;                            // 0x0210 (0x0004)
	float                                              Alertness;                                   // 0x0214 (0x0004)
	float                                              SightRadius;                                 // 0x0218 (0x0004)
	float                                              PeripheralVision;                            // 0x021C (0x0004)
	float                                              AvgPhysicsTime;                              // 0x0220 (0x0004)
	float                                              Mass;                                        // 0x0224 (0x0004)
	float                                              Buoyancy;                                    // 0x0228 (0x0004)
	float                                              MeleeRange;                                  // 0x022C (0x0004)
	class ANavigationPoint*                            Anchor;                                      // 0x0230 (0x0004)
	class ANavigationPoint*                            LastAnchor;                                  // 0x0234 (0x0004)
	float                                              FindAnchorFailedTime;                        // 0x0238 (0x0004)
	float                                              LastValidAnchorTime;                         // 0x023C (0x0004)
	float                                              DestinationOffset;                           // 0x0240 (0x0004)
	float                                              NextPathRadius;                              // 0x0244 (0x0004)
	struct FVector                                     SerpentineDir;                               // 0x0248 (0x000C)
	float                                              SerpentineDist;                              // 0x0254 (0x0004)
	float                                              SerpentineTime;                              // 0x0258 (0x0004)
	float                                              SpawnTime;                                   // 0x025C (0x0004)
	int                                                MaxPitchLimit;                               // 0x0260 (0x0004)
	float                                              GroundSpeed;                                 // 0x0264 (0x0004)
	float                                              WaterSpeed;                                  // 0x0268 (0x0004)
	float                                              AirSpeed;                                    // 0x026C (0x0004)
	float                                              LadderSpeed;                                 // 0x0270 (0x0004)
	float                                              AccelRate;                                   // 0x0274 (0x0004)
	float                                              JumpZ;                                       // 0x0278 (0x0004)
	float                                              OutofWaterZ;                                 // 0x027C (0x0004)
	float                                              MaxOutOfWaterStepHeight;                     // 0x0280 (0x0004)
	float                                              AirControl;                                  // 0x0284 (0x0004)
	float                                              WalkingPct;                                  // 0x0288 (0x0004)
	float                                              CrouchedPct;                                 // 0x028C (0x0004)
	float                                              MaxFallSpeed;                                // 0x0290 (0x0004)
	float                                              AIMaxFallSpeedFactor;                        // 0x0294 (0x0004)
	float                                              BaseEyeHeight;                               // 0x0298 (0x0004)
	float                                              EyeHeight;                                   // 0x029C (0x0004)
	struct FVector                                     Floor;                                       // 0x02A0 (0x000C)
	float                                              SplashTime;                                  // 0x02AC (0x0004)
	float                                              OldZ;                                        // 0x02B0 (0x0004)
	void*                                              HeadVolume;                                  // 0x02B4 (0x0004)
	int                                                Health;                                      // 0x02B8 (0x0004)
	int                                                HealthMax;                                   // 0x02BC (0x0004)
	float                                              BreathTime;                                  // 0x02C0 (0x0004)
	float                                              UnderWaterTime;                              // 0x02C4 (0x0004)
	float                                              LastPainTime;                                // 0x02C8 (0x0004)
	struct FVector                                     RMVelocity;                                  // 0x02CC (0x000C)
	struct FVector                                     noise1spot;                                  // 0x02D8 (0x000C)
	float                                              noise1time;                                  // 0x02E4 (0x0004)
	class APawn*                                       noise1other;                                 // 0x02E8 (0x0004)
	float                                              noise1loudness;                              // 0x02EC (0x0004)
	struct FVector                                     noise2spot;                                  // 0x02F0 (0x000C)
	float                                              noise2time;                                  // 0x02FC (0x0004)
	class APawn*                                       noise2other;                                 // 0x0300 (0x0004)
	float                                              noise2loudness;                              // 0x0304 (0x0004)
	float                                              SoundDampening;                              // 0x0308 (0x0004)
	float                                              DamageScaling;                               // 0x030C (0x0004)
	struct FString                                     MenuName;                                    // 0x0310 (0x000C)
	class UClass*                                      ControllerClass;                             // 0x031C (0x0004)
	class APlayerReplicationInfo*                      PlayerReplicationInfo;                       // 0x0320 (0x0004)
	void*                                              OnLadder;                                    // 0x0324 (0x0004)
	struct FName                                       LandMovementState;                           // 0x0328 (0x0008)
	struct FName                                       WaterMovementState;                          // 0x0330 (0x0008)
	void*                                              LastStartSpot;                               // 0x0338 (0x0004)
	float                                              LastStartTime;                               // 0x033C (0x0004)
	struct FVector                                     TakeHitLocation;                             // 0x0340 (0x000C)
	class UClass*                                      HitDamageType;                               // 0x034C (0x0004)
	struct FVector                                     TearOffMomentum;                             // 0x0350 (0x000C)
	class USkeletalMeshComponent*                      Mesh;                                        // 0x035C (0x0004)
	void*                                              CylinderComponent;                           // 0x0360 (0x0004)
	float                                              RBPushRadius;                                // 0x0364 (0x0004)
	float                                              RBPushStrength;                              // 0x0368 (0x0004)
	class AVehicle*                                    DrivenVehicle;                               // 0x036C (0x0004)
	float                                              AlwaysRelevantDistanceSquared;               // 0x0370 (0x0004)
	float                                              VehicleCheckRadius;                          // 0x0374 (0x0004)
	class AController*                                 LastHitBy;                                   // 0x0378 (0x0004)
	float                                              ViewPitchMin;                                // 0x037C (0x0004)
	float                                              ViewPitchMax;                                // 0x0380 (0x0004)
	int                                                AllowedYawError;                             // 0x0384 (0x0004)
	class UClass*                                      InventoryManagerClass;                       // 0x0388 (0x0004)
	void*                                              InvManager;                                  // 0x038C (0x0004)
	class AWeapon*                                     Weapon;                                      // 0x0390 (0x0004)
	class AWeapon*                                     DroppedWeapon;                               // 0x0394 (0x0004)
	struct FFlashLocationInfo                          FlashLocation;                               // 0x0398 (0x0024)
	struct FVector                                     LastFiringFlashLocation;                     // 0x03BC (0x000C)
	int                                                ShotCount;                                   // 0x03C8 (0x0004)
	class UPrimitiveComponent*                         PreRagdollCollisionComponent;                // 0x03CC (0x0004)
	void*                                              PhysicsPushBody;                             // 0x03D0 (0x0004)
	int                                                FailedLandingCount;                          // 0x03D4 (0x0004)

	// Dying

private:
	static UClass* ClassPointer;

public:
	static UClass* StaticClass ()
	{
		if ( !ClassPointer )
			ClassPointer = UObject::FindClass( "Class Engine.Pawn" );

		return ClassPointer;
	};

public:
	bool eventGetDemoPlayCameraLocationAndRotationAndUpdate ( struct FVector* out_CamLoc, struct FRotator* out_CamRot )
	{
		static UFunction* pfnGetDemoPlayCameraLocationAndRotationAndUpdate = NULL;

		if ( !pfnGetDemoPlayCameraLocationAndRotationAndUpdate )
			pfnGetDemoPlayCameraLocationAndRotationAndUpdate = UObject::FindObject< UFunction >( "Function Engine.Pawn.GetDemoPlayCameraLocationAndRotationAndUpdate" );

		APawn_eventGetDemoPlayCameraLocationAndRotationAndUpdate_Parms GetDemoPlayCameraLocationAndRotationAndUpdate_Parms;

		this->ProcessEvent( pfnGetDemoPlayCameraLocationAndRotationAndUpdate, &GetDemoPlayCameraLocationAndRotationAndUpdate_Parms, NULL );

		if ( out_CamLoc )
