/////////////////////////////////////////////////////////////////////////////
// Unreal Engine MiniSDK Generator by uNrEaL
// Game: CrimeCraft
// File: APlayerController.h
// Date: 06/16/2011 @ 05:19:39.168
/////////////////////////////////////////////////////////////////////////////

#ifdef _MSC_VER
#pragma pack( push, 4 )
#endif

#define Const_MAXCLIENTUPDATEINTERVAL              0.25
#define Const_CLIENTADJUSTUPDATECOST               180.0
#define Const_MAXVEHICLEPOSITIONERRORSQUARED       900.0
#define Const_MAXNEARZEROVELOCITYSQUARED           16.0
#define Const_MAXPOSITIONERRORSQUARED              96.0

enum EProgressMessageType
{
	PMT_Clear = 0,
	PMT_Information = 1,
	PMT_AdminMessage = 2,
	PMT_DownloadProgress = 3,
	PMT_ConnectionFailure = 4,
	PMT_SocketFailure = 5,
	PMT_MAX = 6
};

enum EInputMatchAction
{
	IMA_GreaterThan = 0,
	IMA_LessThan = 1,
	IMA_MAX = 2
};

enum EInputTypes
{
	IT_XAxis = 0,
	IT_YAxis = 1,
	IT_MAX = 2
};

struct APlayerController_execGoToDeadState_Parms
{
};

struct APlayerController_eventGetTheControllerID_Parms
{
	int ReturnValue; // CPF_ReturnParm
};// FUNC_Event

struct APlayerController_execClientSetRotation_Parms
{
	struct FRotator NewRotation;
	unsigned long bResetCamera : 1;
};

struct APlayerController_execClientSetLocation_Parms
{
	struct FVector NewLocation;
	struct FRotator NewRotation;
};

struct APlayerController_execFacePawnRotation_Parms
{
	struct FRotator NewRotation;
	float DeltaTime;
};

struct APlayerController_execLogOutBugItAIGoToLogFile_Parms
{
	struct FString InScreenShotDesc;
	struct FString InGoString;
	struct FString InLocString;
};// FUNC_Final FUNC_Native

struct APlayerController_execLogOutBugItGoToLogFile_Parms
{
	struct FString InScreenShotDesc;
	struct FString InGoString;
	struct FString InLocString;
};// FUNC_Final FUNC_Native

struct APlayerController_execGetFRotatorFromString_Parms
{
	struct FString InStr;
	struct FRotator ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct APlayerController_execGetFVectorFromString_Parms
{
	struct FString InStr;
	struct FVector ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct APlayerController_execDisableDebugAI_Parms
{
};

struct APlayerController_execBugItAI_Parms
{
	struct FString ScreenShotDescription;
};// FUNC_Exec FUNC_Event

struct APlayerController_execBugIt_Parms
{
	struct FString ScreenShotDescription;
};// FUNC_Exec FUNC_Event

struct APlayerController_execBugItWorker_Parms
{
	struct FVector TheLocation;
	struct FRotator TheRotation;
};

struct APlayerController_execNotifyExiting_Parms
{
};

struct APlayerController_execBugItGoString_Parms
{
	struct FString TheLocation;
	struct FString TheRotation;
};

struct APlayerController_execBugItGo_Parms
{
	float X;
	float Y;
	float Z;
	int Pitch;
	int Yaw;
	int Roll;
};// FUNC_Exec

struct APlayerController_eventClientSpawnCameraLensEffect_Parms
{
	class UClass* LensEffectEmitterClass;
};// FUNC_Event

struct APlayerController_execSentinel_PostAcquireTravelTheWorldPoints_Parms
{
};

struct APlayerController_execSentinel_PreAcquireTravelTheWorldPoints_Parms
{
};

struct APlayerController_execSentinel_SetupForGamebasedTravelTheWorld_Parms
{
};

struct APlayerController_execOnFlyThroughHasEnded_Parms
{
	void* inAction;
};

struct APlayerController_eventGetAchievementProgression_Parms
{
	int AchievementId;
	float CurrentValue; // CPF_OutParm
	float MaxValue; // CPF_OutParm
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Event

struct APlayerController_execGetPartyGameTypeName_Parms
{
	struct FString ReturnValue; // CPF_ReturnParm
};

struct APlayerController_execGetPartyMapName_Parms
{
	struct FString ReturnValue; // CPF_ReturnParm
};

struct APlayerController_execIsPartyLeader_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct APlayerController_eventClientPrestreamTextures_Parms
{
	class AActor* ForcedActor;
	float ForceDuration;
	unsigned long bEnableStreaming : 1;
};// FUNC_Event

struct APlayerController_eventClientSetForceMipLevelsToBeResident_Parms
{
	class UMaterialInterface* Material;
	float ForceDuration;
};// FUNC_Event

struct APlayerController_execClientControlMovieTexture_Parms
{
	void* MovieTexture;
	unsigned char Mode;
};

struct APlayerController_execGetSplitscreenPlayerCount_Parms
{
	int ReturnValue; // CPF_ReturnParm
};

struct APlayerController_execGetSplitscreenPlayerByIndex_Parms
{
	int PlayerIndex;
	class APlayerReplicationInfo* ReturnValue; // CPF_ReturnParm
};

struct APlayerController_execHasSplitscreenPlayer_Parms
{
	class APlayerReplicationInfo* PRI;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct APlayerController_execIsSplitscreenPlayer_Parms
{
	int out_SplitscreenPlayerIndex; // CPF_OutParm
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct APlayerController_execIsPrimaryPlayer_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct APlayerController_execClientReturnToParty_Parms
{
};

struct APlayerController_execOnJoinTravelToSessionComplete_Parms
{
	struct FName SessionName;
	unsigned long bWasSuccessful : 1;
};

struct APlayerController_execClientTravelToSession_Parms
{
	struct FName SessionName;
	class UClass* SearchClass;
	unsigned char PlatformSpecificInfo[ 68 ];
};

struct APlayerController_execPathClear_Parms
{
};// FUNC_Exec

struct APlayerController_execPathChild_Parms
{
	int Cnt;
};// FUNC_Exec

struct APlayerController_execPathStep_Parms
{
	int Cnt;
};// FUNC_Exec

struct APlayerController_eventSoakPause_Parms
{
	class APawn* P;
};// FUNC_Event

struct APlayerController_execIncrementNumberOfMatchesPlayed_Parms
{
};

struct APlayerController_execCanViewUserCreatedContent_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct APlayerController_execClientEndOnlineGame_Parms
{
};

struct APlayerController_execClientStartOnlineGame_Parms
{
};

struct APlayerController_execServerRegisterClientStatGuid_Parms
{
	struct FString StatGuid;
};

struct APlayerController_execOnRegisterHostStatGuidComplete_Parms
{
	unsigned long bWasSuccessful : 1;
};

struct APlayerController_execClientRegisterHostStatGuid_Parms
{
	struct FString StatGuid;
};

struct APlayerController_execEnableDebugCamera_Parms
{
};

struct APlayerController_eventRemoveDebugText_Parms
{
	class AActor* SrcActor;
};// FUNC_Final FUNC_Event

struct APlayerController_eventAddDebugText_Parms
{
	struct FString DebugText;
	class AActor* SrcActor;
	float Duration;
	struct FVector Offset;
	struct FVector DesiredOffset;
	struct FColor TextColor;
	unsigned long bSkipOverwriteCheck : 1;
};// FUNC_Final FUNC_Event

struct APlayerController_execDrawDebugTextList_Parms
{
	class UCanvas* Canvas;
	float RenderDelta;
};// FUNC_Final

struct APlayerController_execOnDestroy_Parms
{
	void* Action;
};

struct APlayerController_execClientStartNetworkedVoice_Parms
{
};

struct APlayerController_execClientStopNetworkedVoice_Parms
{
};

struct APlayerController_execClientSetHostUniqueId_Parms
{
	struct FUniqueNetId InHostId;
};

struct APlayerController_execClientWriteLeaderboardStats_Parms
{
	class UClass* OnlineStatsWriteClass;
};

struct APlayerController_execClientWriteOnlinePlayerScores_Parms
{
	int LeaderboardId;
};

struct APlayerController_execClientArbitratedMatchEnded_Parms
{
};

struct APlayerController_execNotifyNotEnoughSpaceInInvite_Parms
{
};

struct APlayerController_execNotifyNotAllPlayersCanJoinInvite_Parms
{
};

struct APlayerController_execNotifyInviteFailed_Parms
{
};

struct APlayerController_execOnInviteJoinComplete_Parms
{
	struct FName SessionName;
	unsigned long bWasSuccessful : 1;
};

struct APlayerController_execOnDestroyForInviteComplete_Parms
{
	struct FName SessionName;
	unsigned long bWasSuccessful : 1;
};

struct APlayerController_execOnEndForInviteComplete_Parms
{
	struct FName SessionName;
	unsigned long bWasSuccessful : 1;
};

struct APlayerController_execClearInviteDelegates_Parms
{
};

struct APlayerController_execCanAllPlayersPlayOnline_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct APlayerController_execInviteHasEnoughSpace_Parms
{
	void* InviteSettings;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct APlayerController_execOnGameInviteAccepted_Parms
{
	void* GameInviteSettings;
};

struct APlayerController_execServerRegisteredForArbitration_Parms
{
	unsigned long bWasSuccessful : 1;
};

struct APlayerController_execOnArbitrationRegisterComplete_Parms
{
	struct FName SessionName;
	unsigned long bWasSuccessful : 1;
};

struct APlayerController_execClientRegisterForArbitration_Parms
{
};

struct APlayerController_eventClientWasKicked_Parms
{
};// FUNC_Event

struct APlayerController_execNotifyConnectionError_Parms
{
	struct FString Message;
	struct FString Title;
};

struct APlayerController_execIsShowingSubtitles_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Native

struct APlayerController_execSetShowSubtitles_Parms
{
	unsigned long bValue : 1;
};// FUNC_Exec FUNC_Native

struct APlayerController_eventNotifyDirectorControl_Parms
{
	unsigned long bNowControlling : 1;
};// FUNC_Event

struct APlayerController_eventServerUnmutePlayer_Parms
{
	struct FUniqueNetId PlayerNetId;
};// FUNC_Event

struct APlayerController_eventServerMutePlayer_Parms
{
	struct FUniqueNetId PlayerNetId;
};// FUNC_Event

struct APlayerController_execGameplayUnmutePlayer_Parms
{
	struct FUniqueNetId PlayerNetId;
};

struct APlayerController_execGameplayMutePlayer_Parms
{
	struct FUniqueNetId PlayerNetId;
};

struct APlayerController_eventClientUnmutePlayer_Parms
{
	struct FUniqueNetId PlayerNetId;
};// FUNC_Event

struct APlayerController_eventClientMutePlayer_Parms
{
	struct FUniqueNetId PlayerNetId;
};// FUNC_Event

struct APlayerController_execClientVoiceHandshakeComplete_Parms
{
};

struct APlayerController_execGetPlayerControllerFromNetId_Parms
{
	struct FUniqueNetId PlayerNetId;
	class APlayerController* ReturnValue; // CPF_ReturnParm
};// FUNC_Native

struct APlayerController_execClientSetOnlineStatus_Parms
{
};

struct APlayerController_execSeamlessTravelFrom_Parms
{
	class APlayerController* OldPC;
};

struct APlayerController_execSeamlessTravelTo_Parms
{
	class APlayerController* NewPC;
};

struct APlayerController_eventGetSeamlessTravelActorList_Parms
{
	unsigned long bToEntry : 1;
	TArray< class AActor* > ActorList; // CPF_OutParm
};// FUNC_Event

struct APlayerController_execIsPlayerMuted_Parms
{
	struct FUniqueNetId Sender; // CPF_OutParm
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct APlayerController_execGetUIController_Parms
{
	void* ReturnValue; // CPF_ReturnParm
};// FUNC_Final

struct APlayerController_execSaveActorConfig_Parms
{
	struct FName actorName;
};// FUNC_Exec

struct APlayerController_execSaveClassConfig_Parms
{
	struct FString ClassName;
};// FUNC_Exec

struct APlayerController_eventClientSetBlockOnAsyncLoading_Parms
{
};// FUNC_Event

struct APlayerController_eventClientFlushLevelStreaming_Parms
{
};// FUNC_Final FUNC_Event FUNC_Native

struct APlayerController_eventClientCancelPendingMapChange_Parms
{
};// FUNC_Event

struct APlayerController_eventClientCommitMapChange_Parms
{
};// FUNC_Event

struct APlayerController_execDelayedPrepareMapChange_Parms
{
};

struct APlayerController_eventClientPrepareMapChange_Parms
{
	struct FName LevelName;
	unsigned long bFirst : 1;
	unsigned long bLast : 1;
};// FUNC_Event

struct APlayerController_eventServerUpdateLevelVisibility_Parms
{
	struct FName PackageName;
	unsigned long bIsVisible : 1;
};// FUNC_Final FUNC_Event FUNC_Native

struct APlayerController_execClientUpdateLevelStreamingStatus_Parms
{
	struct FName PackageName;
	unsigned long bNewShouldBeLoaded : 1;
	unsigned long bNewShouldBeVisible : 1;
	unsigned long bNewShouldBlockOnLoad : 1;
};// FUNC_Final FUNC_Native

struct APlayerController_eventLevelStreamingStatusChanged_Parms
{
	void* LevelObject;
	unsigned long bNewShouldBeLoaded : 1;
	unsigned long bNewShouldBeVisible : 1;
	unsigned long bNewShouldBlockOnLoad : 1;
};// FUNC_Event

struct APlayerController_eventClientForceGarbageCollection_Parms
{
};// FUNC_Event

struct APlayerController_execOnConsoleCommand_Parms
{
	void* inAction;
};

struct APlayerController_execResetPlayerMovementInput_Parms
{
};

struct APlayerController_eventIsLookInputIgnored_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Event

struct APlayerController_execIgnoreLookInput_Parms
{
	unsigned long bNewLookInput : 1;
};

struct APlayerController_eventIsMoveInputIgnored_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Event

struct APlayerController_execIgnoreMoveInput_Parms
{
	unsigned long bNewMoveInput : 1;
};

struct APlayerController_execClientSetCinematicMode_Parms
{
	unsigned long bInCinematicMode : 1;
	unsigned long bAffectsMovement : 1;
	unsigned long bAffectsTurning : 1;
	unsigned long bAffectsHUD : 1;
};

struct APlayerController_execSetCinematicMode_Parms
{
	unsigned long bInCinematicMode : 1;
	unsigned long bHidePlayer : 1;
	unsigned long bAffectsHUD : 1;
	unsigned long bAffectsMovement : 1;
	unsigned long bAffectsTurning : 1;
	unsigned long bAffectsButtons : 1;
};

struct APlayerController_execOnToggleCinematicMode_Parms
{
	void* Action;
};

struct APlayerController_execCameraShake_Parms
{
	float Duration;
	struct FVector newRotAmplitude;
	struct FVector newRotFrequency;
	struct FVector newLocAmplitude;
	struct FVector newLocFrequency;
	float newFOVAmplitude;
	float newFOVFrequency;
};

struct APlayerController_execIsForceFeedbackAllowed_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct APlayerController_eventClientStopForceFeedbackWaveform_Parms
{
	void* FFWaveform;
};// FUNC_Final FUNC_Event

struct APlayerController_eventClientPlayForceFeedbackWaveform_Parms
{
	void* FFWaveform;
};// FUNC_Event

struct APlayerController_eventPlayRumble_Parms
{
	void* TheAnimNotify;
};// FUNC_Event

struct APlayerController_execOnForceFeedback_Parms
{
	void* Action;
};

struct APlayerController_execNotifyTakeHit_Parms
{
	class AController* InstigatedBy;
	struct FVector HitLocation;
	int Damage;
	class UClass* DamageType;
	struct FVector Momentum;
};

struct APlayerController_execShowGameState_Parms
{
};// FUNC_Exec

struct APlayerController_execShowPlayerState_Parms
{
};// FUNC_Exec

struct APlayerController_execListCE_Parms
{
};// FUNC_Exec

struct APlayerController_execListConsoleEvents_Parms
{
};// FUNC_Exec

struct APlayerController_execCE_Parms
{
	struct FName EventName;
};// FUNC_Exec

struct APlayerController_execCauseEvent_Parms
{
	struct FName EventName;
};// FUNC_Exec

struct APlayerController_execServerCauseEvent_Parms
{
	struct FName EventName;
};

struct APlayerController_execOnToggleHUD_Parms
{
	void* inAction;
};

struct APlayerController_execOnSetCameraTarget_Parms
{
	void* inAction;
};

struct APlayerController_execDisplayDebug_Parms
{
	class AHUD* HUD;
	float out_YL; // CPF_OutParm
	float out_YPos; // CPF_OutParm
};

struct APlayerController_execClientIgnoreLookInput_Parms
{
	unsigned long bIgnore : 1;
};

struct APlayerController_execClientIgnoreMoveInput_Parms
{
	unsigned long bIgnore : 1;
};

struct APlayerController_execOnToggleInput_Parms
{
	void* inAction;
};

struct APlayerController_execDrawHUD_Parms
{
	class AHUD* H;
};

struct APlayerController_execCanRestartPlayer_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct APlayerController_execServerViewSelf_Parms
{
	struct FViewTargetTransitionParams TransitionParams;
};

struct APlayerController_execViewAPlayer_Parms
{
	int Dir;
};

struct APlayerController_execServerViewPrevPlayer_Parms
{
};

struct APlayerController_execServerViewNextPlayer_Parms
{
};

struct APlayerController_execServerSetSpectatorLocation_Parms
{
	struct FVector NewLoc;
};

struct APlayerController_execIsSpectating_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct APlayerController_execCheckJumpOrDuck_Parms
{
};

struct APlayerController_execClearDoubleClick_Parms
{
};

struct APlayerController_eventLimitViewRotation_Parms
{
	struct FRotator ViewRotation;
	float ViewPitchMin;
	float ViewPitchMax;
	struct FRotator ReturnValue; // CPF_ReturnParm
};// FUNC_Event

struct APlayerController_execProcessViewRotation_Parms
{
	float DeltaTime;
	struct FRotator out_ViewRotation; // CPF_OutParm
	struct FRotator DeltaRot;
};

struct APlayerController_execUpdateRotation_Parms
{
	float DeltaTime;
};

struct APlayerController_execViewShake_Parms
{
	float DeltaTime;
};

struct APlayerController_eventGetPlayerViewPoint_Parms
{
	struct FVector out_Location; // CPF_OutParm
	struct FRotator out_Rotation; // CPF_OutParm
};// FUNC_Event

struct APlayerController_eventSpawnPlayerCamera_Parms
{
};// FUNC_Event

struct APlayerController_execServerVerifyViewTarget_Parms
{
};

struct APlayerController_execGetViewTarget_Parms
{
	class AActor* ReturnValue; // CPF_ReturnParm
};// FUNC_Native

struct APlayerController_eventClientSetViewTarget_Parms
{
	class AActor* A;
	struct FViewTargetTransitionParams TransitionParams;
};// FUNC_Event

struct APlayerController_execSetViewTarget_Parms
{
	class AActor* NewViewTarget;
	struct FViewTargetTransitionParams TransitionParams;
};// FUNC_Native

struct APlayerController_execIsLocalPlayerController_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Native

struct APlayerController_eventGetFOVAngle_Parms
{
	float ReturnValue; // CPF_ReturnParm
};// FUNC_Event

struct APlayerController_execAdjustFOV_Parms
{
	float DeltaTime;
};

struct APlayerController_eventNotifyLanded_Parms
{
	struct FVector HitNormal;
	class AActor* FloorActor;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Event

struct APlayerController_execAimHelpDot_Parms
{
	unsigned long bInstantHit : 1;
	float ReturnValue; // CPF_ReturnParm
};

struct APlayerController_execGetAdjustedAimFor_Parms
{
	class AWeapon* W;
	struct FVector StartFireLoc;
	struct FRotator ReturnValue; // CPF_ReturnParm
};

struct APlayerController_eventCameraLookAtFinished_Parms
{
	void* Action;
};// FUNC_Event

struct APlayerController_execAimingHelp_Parms
{
	unsigned long bInstantHit : 1;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct APlayerController_execPlayerMove_Parms
{
	float DeltaTime;
};

struct APlayerController_eventPlayerTick_Parms
{
	float DeltaTime;
};// FUNC_Event

struct APlayerController_execNotifyChangedWeapon_Parms
{
	class AWeapon* PreviousWeapon;
	class AWeapon* NewWeapon;
};

struct APlayerController_execClientGameEnded_Parms
{
	class AActor* EndGameFocus;
	unsigned long bIsWinner : 1;
};

struct APlayerController_execGameHasEnded_Parms
{
	class AActor* EndGameFocus;
	unsigned long bIsWinner : 1;
};

struct APlayerController_execClientRestart_Parms
{
	class APawn* NewPawn;
};

struct APlayerController_execEnterStartState_Parms
{
};

struct APlayerController_execHasClientLoadedCurrentWorld_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct APlayerController_eventNotifyLoadedWorld_Parms
{
	struct FName WorldPackageName;
	unsigned long bFinalDest : 1;
};// FUNC_Event

struct APlayerController_eventServerNotifyLoadedWorld_Parms
{
	struct FName WorldPackageName;
};// FUNC_Final FUNC_Event FUNC_Native

struct APlayerController_execRestart_Parms
{
	unsigned long bVehicleTransition : 1;
};

struct APlayerController_execClientSetProgressTime_Parms
{
	float T;
};

struct APlayerController_execSetProgressTime_Parms
{
	float T;
};// FUNC_Exec FUNC_Event

struct APlayerController_execClientSetProgressMessage_Parms
{
	unsigned char MessageType;
	struct FString Message;
	struct FString Title;
	unsigned long bIgnoreFutureNetworkMessages : 1;
};

struct APlayerController_execSetProgressMessage_Parms
{
	unsigned char MessageType;
	struct FString Message;
	struct FString Title;
};// FUNC_Exec FUNC_Event

struct APlayerController_execClientClearProgressMessages_Parms
{
};

struct APlayerController_execClearProgressMessages_Parms
{
};// FUNC_Exec

struct APlayerController_execSwitchLevel_Parms
{
	struct FString URL;
};// FUNC_Exec

struct APlayerController_execServerChangeTeam_Parms
{
	int N;
};

struct APlayerController_execChangeTeam_Parms
{
	struct FString TeamName;
};// FUNC_Exec

struct APlayerController_execSwitchTeam_Parms
{
};// FUNC_Exec

struct APlayerController_execServerChangeName_Parms
{
	struct FString S;
};

struct APlayerController_execSetName_Parms
{
	struct FString S;
};// FUNC_Exec

struct APlayerController_execServerSuicide_Parms
{
};

struct APlayerController_execSuicide_Parms
{
};// FUNC_Exec

struct APlayerController_execTriggerInteracted_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct APlayerController_execFindVehicleToDrive_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct APlayerController_execPerformedUseAction_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct APlayerController_execServerUse_Parms
{
};

struct APlayerController_execUse_Parms
{
};// FUNC_Exec

struct APlayerController_execGetTriggerUseList_Parms
{
	float interactDistanceToCheck;
	float crosshairDist;
	float minDot;
	unsigned long bUsuableOnly : 1;
	TArray< class ATrigger* > out_useList; // CPF_OutParm
};

struct APlayerController_execStopAltFire_Parms
{
	unsigned char FireModeNum;
};// FUNC_Exec

struct APlayerController_execStartAltFire_Parms
{
	unsigned char FireModeNum;
};// FUNC_Exec

struct APlayerController_execStopFire_Parms
{
	unsigned char FireModeNum;
};// FUNC_Exec

struct APlayerController_execStartFire_Parms
{
	unsigned char FireModeNum;
};// FUNC_Exec

struct APlayerController_execNextWeapon_Parms
{
};// FUNC_Exec

struct APlayerController_execPrevWeapon_Parms
{
};// FUNC_Exec

struct APlayerController_execServerThrowWeapon_Parms
{
};

struct APlayerController_execThrowWeapon_Parms
{
};// FUNC_Exec

struct APlayerController_execUTrace_Parms
{
};// FUNC_Exec

struct APlayerController_execServerUTrace_Parms
{
};

struct APlayerController_eventConditionalPause_Parms
{
	unsigned long bDesiredPauseState : 1;
};// FUNC_Event

struct APlayerController_execShowMenu_Parms
{
};// FUNC_Exec

struct APlayerController_execServerPause_Parms
{
};

struct APlayerController_execPause_Parms
{
};// FUNC_Exec

struct APlayerController_execIsPaused_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final

struct APlayerController_execDebugPause_Parms
{
};// FUNC_Exec

struct APlayerController_execSetPause_Parms
{
	unsigned long bPause : 1;
	struct FScriptDelegate CanUnpauseDelegate;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct APlayerController_execCanUnpause_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct APlayerController_execPauseRumbleForAllPlayers_Parms
{
	unsigned long bShouldPauseRumble : 1;
};

struct APlayerController_execQuickLoad_Parms
{
};// FUNC_Exec

struct APlayerController_execQuickSave_Parms
{
};// FUNC_Exec

struct APlayerController_execLocalTravel_Parms
{
	struct FString URL;
};// FUNC_Exec

struct APlayerController_execRestartLevel_Parms
{
};// FUNC_Exec

struct APlayerController_execServerSpeech_Parms
{
	struct FName Type;
	int Index;
	struct FString Callsign;
};

struct APlayerController_execSpeech_Parms
{
	struct FName Type;
	int Index;
	struct FString Callsign;
};// FUNC_Exec

struct APlayerController_execServerRestartGame_Parms
{
};

struct APlayerController_execHandleWalking_Parms
{
};

struct APlayerController_execCallServerMove_Parms
{
	void* NewMove;
	struct FVector ClientLoc;
	unsigned char ClientRoll;
	int View;
	void* OldMove;
};

struct APlayerController_execReplicateMove_Parms
{
	float DeltaTime;
	struct FVector newAccel;
	unsigned char DoubleClickMove;
	struct FRotator DeltaRot;
};

struct APlayerController_execCompressAccel_Parms
{
	int C;
	int ReturnValue; // CPF_ReturnParm
};

struct APlayerController_execGetFreeMove_Parms
{
	void* ReturnValue; // CPF_ReturnParm
};// FUNC_Final

struct APlayerController_execClientUpdatePosition_Parms
{
};

struct APlayerController_execClearAckedMoves_Parms
{
};

struct APlayerController_execServerUpdatePing_Parms
{
	int NewPing;
};

struct APlayerController_execUpdateStateFromAdjustment_Parms
{
	struct FName NewState;
};

struct APlayerController_execLongClientAdjustPosition_Parms
{
	float TimeStamp;
	struct FName NewState;
	unsigned char newPhysics;
	float NewLocX;
	float NewLocY;
	float NewLocZ;
	float NewVelX;
	float NewVelY;
	float NewVelZ;
	class AActor* NewBase;
	float NewFloorX;
	float NewFloorY;
	float NewFloorZ;
};

struct APlayerController_execUpdatePing_Parms
{
	float TimeStamp;
};// FUNC_Final

struct APlayerController_execServerSetNetSpeed_Parms
{
	int NewSpeed;
};

struct APlayerController_execClientAdjustPosition_Parms
{
	float TimeStamp;
	struct FName NewState;
	unsigned char newPhysics;
	float NewLocX;
	float NewLocY;
	float NewLocZ;
	float NewVelX;
	float NewVelY;
	float NewVelZ;
	class AActor* NewBase;
};

struct APlayerController_execClientAckGoodMove_Parms
{
	float TimeStamp;
};

struct APlayerController_execClientCapBandwidth_Parms
{
	int Cap;
};

struct APlayerController_execShortClientAdjustPosition_Parms
{
	float TimeStamp;
	struct FName NewState;
	unsigned char newPhysics;
	float NewLocX;
	float NewLocY;
	float NewLocZ;
	class AActor* NewBase;
};

struct APlayerController_execVeryShortClientAdjustPosition_Parms
{
	float TimeStamp;
	float NewLocX;
	float NewLocY;
	float NewLocZ;
	class AActor* NewBase;
};

struct APlayerController_execMoveAutonomous_Parms
{
	float DeltaTime;
	int CompressedFlags;
	struct FVector newAccel;
	struct FRotator DeltaRot;
};

struct APlayerController_execProcessMove_Parms
{
	float DeltaTime;
	struct FVector newAccel;
	unsigned char DoubleClickMove;
	struct FRotator DeltaRot;
};

struct APlayerController_execProcessDrive_Parms
{
	float InForward;
	float InStrafe;
	float InUp;
	unsigned long InJump : 1;
};

struct APlayerController_execServerDrive_Parms
{
	float InForward;
	float InStrafe;
	float aUp;
	unsigned long InJump : 1;
	int View;
};

struct APlayerController_eventSendClientAdjustment_Parms
{
};// FUNC_Event

struct APlayerController_execServerMove_Parms
{
	float TimeStamp;
	struct FVector InAccel;
	struct FVector ClientLoc;
	int MoveFlags;
	unsigned char ClientRoll;
	int View;
};

struct APlayerController_execOldServerMove_Parms
{
	float OldTimeStamp;
	unsigned char OldAccelX;
	unsigned char OldAccelY;
	unsigned char OldAccelZ;
	int OldMoveFlags;
};

struct APlayerController_execDualServerMove_Parms
{
	float TimeStamp0;
	struct FVector InAccel0;
	int PendingFlags;
	int View0;
	float TimeStamp;
	struct FVector InAccel;
	struct FVector ClientLoc;
	int NewFlags;
	unsigned char ClientRoll;
	int View;
};

struct APlayerController_execForceDeathUpdate_Parms
{
};

struct APlayerController_execClientVoiceMessage_Parms
{
	class APlayerReplicationInfo* Sender;
	class APlayerReplicationInfo* Recipient;
	struct FName MessageType;
	unsigned char messageID;
};

struct APlayerController_execUsingFirstPersonCamera_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct APlayerController_eventClientSetCameraFade_Parms
{
	unsigned long bEnableFading : 1;
	struct FColor FadeColor;
	struct FVector2D FadeAlpha;
	float FadeTime;
};// FUNC_Event

struct APlayerController_eventResetCameraMode_Parms
{
};// FUNC_Event

struct APlayerController_execSetCameraMode_Parms
{
	struct FName NewCamMode;
};

struct APlayerController_execClientSetCameraMode_Parms
{
	struct FName NewCamMode;
};

struct APlayerController_execServerCamera_Parms
{
	struct FName NewMode;
};

struct APlayerController_execCamera_Parms
{
	struct FName NewMode;
};// FUNC_Exec

struct APlayerController_eventPreClientTravel_Parms
{
	struct FString PendingURL;
	unsigned char TravelType;
	unsigned long bIsSeamlessTravel : 1;
};// FUNC_Event

struct APlayerController_execServerTeamSay_Parms
{
	struct FString msg;
};

struct APlayerController_execTeamSay_Parms
{
	struct FString msg;
};// FUNC_Exec

struct APlayerController_execServerSay_Parms
{
	struct FString msg;
};

struct APlayerController_execSay_Parms
{
	struct FString msg;
};// FUNC_Exec

struct APlayerController_execAllowTextMessage_Parms
{
	struct FString msg;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct APlayerController_execServerMutate_Parms
{
	struct FString MutateString;
};

struct APlayerController_execMutate_Parms
{
	struct FString MutateString;
};// FUNC_Exec

struct APlayerController_execFOV_Parms
{
	float F;
};// FUNC_Exec

struct APlayerController_execResetFOV_Parms
{
};

struct APlayerController_execSetFOV_Parms
{
	float NewFOV;
};

struct APlayerController_execFixFOV_Parms
{
};

struct APlayerController_eventDestroyed_Parms
{
};// FUNC_Event

struct APlayerController_eventClearOnlineDelegates_Parms
{
};// FUNC_Event

struct APlayerController_execRegisterOnlineDelegates_Parms
{
};

struct APlayerController_execPlayBeepSound_Parms
{
};

struct APlayerController_eventTeamMessage_Parms
{
	class APlayerReplicationInfo* PRI;
	struct FString S;
	struct FName Type;
	float MsgLifeTime;
};// FUNC_Event

struct APlayerController_execSpeakTTS_Parms
{
	struct FString S;
	class APlayerReplicationInfo* PRI;
};

struct APlayerController_execTeamTalk_Parms
{
};// FUNC_Exec

struct APlayerController_execTalk_Parms
{
};// FUNC_Exec

struct APlayerController_execCreateTTSSoundCue_Parms
{
	struct FString StrToSpeak;
	class APlayerReplicationInfo* PRI;
	void* ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct APlayerController_execAllowTTSMessageFrom_Parms
{
	class APlayerReplicationInfo* PRI;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final

struct APlayerController_execCanCommunicate_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final

struct APlayerController_eventClientMessage_Parms
{
	struct FString S;
	struct FName Type;
	float MsgLifeTime;
};// FUNC_Event

struct APlayerController_execClientPlayActorFaceFXAnim_Parms
{
	class AActor* SourceActor;
	void* AnimSet;
	struct FString GroupName;
	struct FString SeqName;
	void* SoundCueToPlay;
};

struct APlayerController_eventKismet_ClientStopSound_Parms
{
	void* ASound;
	class AActor* SourceActor;
	float FadeOutTime;
};// FUNC_Event

struct APlayerController_eventKismet_ClientPlaySound_Parms
{
	void* ASound;
	class AActor* SourceActor;
	float VolumeMultiplier;
	float PitchMultiplier;
	float FadeInTime;
	unsigned long bSuppressSubtitles : 1;
	unsigned long bSuppressSpatialization : 1;
};// FUNC_Event

struct APlayerController_execIsClosestLocalPlayerToActor_Parms
{
	class AActor* TheActor;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct APlayerController_eventClientHearSound_Parms
{
	void* ASound;
	class AActor* SourceActor;
	struct FVector SourceLocation;
	unsigned long bStopWhenOwnerDestroyed : 1;
	unsigned long bIsOccluded : 1;
};// FUNC_Event

struct APlayerController_execGetPooledAudioComponent_Parms
{
	void* ASound;
	class AActor* SourceActor;
	unsigned long bStopWhenOwnerDestroyed : 1;
	unsigned long bUseLocation : 1;
	struct FVector SourceLocation;
	void* ReturnValue; // CPF_ReturnParm
};// FUNC_Native

struct APlayerController_execHearSoundFinished_Parms
{
	void* AC;
};

struct APlayerController_eventClientPlaySound_Parms
{
	void* ASound;
};// FUNC_Event

struct APlayerController_eventReceiveLocalizedMessage_Parms
{
	class UClass* Message;
	int Switch;
	class APlayerReplicationInfo* RelatedPRI1;
	class APlayerReplicationInfo* RelatedPRI2;
	class UObject* OptionalObject;
	int OptionalData;
};// FUNC_Event

struct APlayerController_execCleanupPRI_Parms
{
};

struct APlayerController_execHandlePickup_Parms
{
	class AInventory* Inv;
};

struct APlayerController_execClientSetHUD_Parms
{
	class UClass* newHUDType;
	class UClass* newScoringType;
};

struct APlayerController_execPawnDied_Parms
{
	class APawn* P;
};

struct APlayerController_eventUnPossess_Parms
{
};// FUNC_Event

struct APlayerController_execServerAcknowledgePossession_Parms
{
	class APawn* P;
};

struct APlayerController_execAcknowledgePossession_Parms
{
	class APawn* P;
};

struct APlayerController_eventPossess_Parms
{
	class APawn* aPawn;
	unsigned long bVehicleTransition : 1;
};// FUNC_Event

struct APlayerController_execGivePawn_Parms
{
	class APawn* NewPawn;
};

struct APlayerController_execAskForPawn_Parms
{
};

struct APlayerController_execClientGotoState_Parms
{
	struct FName NewState;
	struct FName NewLabel;
};

struct APlayerController_execIsMouseAvailable_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Native

struct APlayerController_execIsKeyboardAvailable_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Native

struct APlayerController_execSetUseTiltForwardAndBack_Parms
{
	unsigned long bActive : 1;
};// FUNC_Native

struct APlayerController_execSetOnlyUseControllerTiltInput_Parms
{
	unsigned long bActive : 1;
};// FUNC_Native

struct APlayerController_execSetControllerTiltActive_Parms
{
	unsigned long bActive : 1;
};// FUNC_Native

struct APlayerController_execSetControllerTiltDesiredIfAvailable_Parms
{
	unsigned long bActive : 1;
};// FUNC_Native

struct APlayerController_execIsControllerTiltActive_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Native

struct APlayerController_execGetRumbleScale_Parms
{
	float ReturnValue; // CPF_ReturnParm
};// FUNC_Final

struct APlayerController_execSetRumbleScale_Parms
{
	float ScaleBy;
};// FUNC_Final

struct APlayerController_execReloadProfileSettings_Parms
{
};

struct APlayerController_execSetPlayerDataProvider_Parms
{
	void* DataProvider;
};

struct APlayerController_execUnregisterStandardPlayerDataStores_Parms
{
};

struct APlayerController_execUnregisterPlayerDataStores_Parms
{
};

struct APlayerController_execRegisterStandardPlayerDataStores_Parms
{
};

struct APlayerController_execRegisterCustomPlayerDataStores_Parms
{
};

struct APlayerController_execRegisterPlayerDataStores_Parms
{
};// FUNC_Final

struct APlayerController_execClientInitializeDataStores_Parms
{
};

struct APlayerController_execServerSetPlayerSkill_Parms
{
	int PlayerSkill;
};

struct APlayerController_execServerSetUniquePlayerId_Parms
{
	struct FUniqueNetId UniqueId;
	unsigned long bWasInvited : 1;
};

struct APlayerController_eventInitUniquePlayerId_Parms
{
};// FUNC_Event

struct APlayerController_eventReplicatedEvent_Parms
{
	struct FName VarName;
};// FUNC_Event

struct APlayerController_eventInitInputSystem_Parms
{
};// FUNC_Event

struct APlayerController_execGetOnlineSubsystem_Parms
{
	class UOnlineSubsystem* ReturnValue; // CPF_ReturnParm
};// FUNC_Final

struct APlayerController_execPostControllerIdChange_Parms
{
};

struct APlayerController_execPreControllerIdChange_Parms
{
};

struct APlayerController_execCleanOutSavedMoves_Parms
{
};

struct APlayerController_execClientReset_Parms
{
};

struct APlayerController_execReset_Parms
{
};

struct APlayerController_execSpawnDefaultHUD_Parms
{
};

struct APlayerController_execEnableCheats_Parms
{
};// FUNC_Exec

struct APlayerController_execAddCheats_Parms
{
};

struct APlayerController_eventKickWarning_Parms
{
};// FUNC_Event

struct APlayerController_execServerGivePawn_Parms
{
};

struct APlayerController_execServerShortTimeout_Parms
{
};

struct APlayerController_execResetTimeMargin_Parms
{
};

struct APlayerController_eventPreRender_Parms
{
	class UCanvas* Canvas;
};// FUNC_Event

struct APlayerController_eventReceivedPlayer_Parms
{
};// FUNC_Event

struct APlayerController_eventPostBeginPlay_Parms
{
};// FUNC_Event

struct APlayerController_execSpawnCoverReplicator_Parms
{
	void* ReturnValue; // CPF_ReturnParm
};

struct APlayerController_execCanUnpauseControllerConnected_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct APlayerController_execOnControllerChanged_Parms
{
	int ControllerId;
	unsigned long bIsConnected : 1;
};

struct APlayerController_execCanUnpauseExternalUI_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct APlayerController_execOnExternalUIChanged_Parms
{
	unsigned long bIsOpening : 1;
};

struct APlayerController_execForceClearUnpauseDelegates_Parms
{
};

struct APlayerController_eventFellOutOfWorld_Parms
{
	class UClass* dmgType;
};// FUNC_Event

struct APlayerController_execCleanUpAudioComponents_Parms
{
};// FUNC_Native

struct APlayerController_execFindStairRotation_Parms
{
	float DeltaTime;
	int ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native NativeIndex[0x020C]

struct APlayerController_execCheckSpeedHack_Parms
{
	float DeltaTime;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct APlayerController_eventServerProcessConvolve_Parms
{
	struct FString C;
	int H;
};// FUNC_Final FUNC_Event FUNC_Native

struct APlayerController_eventClientConvolve_Parms
{
	struct FString C;
	int H;
};// FUNC_Final FUNC_Event FUNC_Native

struct APlayerController_execSetAudioGroupVolume_Parms
{
	struct FName GroupName;
	float Volume;
};// FUNC_Exec FUNC_Native

struct APlayerController_execSetAllowMatureLanguage_Parms
{
	unsigned long bAllowMatureLanguge : 1;
};// FUNC_Native

struct APlayerController_execPasteFromClipboard_Parms
{
	struct FString ReturnValue; // CPF_ReturnParm
};// FUNC_Native

struct APlayerController_execCopyToClipboard_Parms
{
	struct FString Text;
};// FUNC_Native

struct APlayerController_execGetDefaultURL_Parms
{
	struct FString Option;
	struct FString ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct APlayerController_execUpdateURL_Parms
{
	struct FString NewOption;
	struct FString NewValue;
	unsigned long bSave1Default : 1;
};// FUNC_Final FUNC_Native NativeIndex[0x0222]

struct APlayerController_eventClientTravel_Parms
{
	struct FString URL;
	unsigned char TravelType;
	unsigned long bSeamless : 1;
	struct FGuid MapPackageGuid;
};// FUNC_Event FUNC_Native

struct APlayerController_execConsoleCommand_Parms
{
	struct FString Command;
	unsigned long bWriteToLog : 1;
	struct FString ReturnValue; // CPF_ReturnParm
};// FUNC_Native

struct APlayerController_execGetServerNetworkAddress_Parms
{
	struct FString ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct APlayerController_execGetPlayerNetworkAddress_Parms
{
	struct FString ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct APlayerController_execSetNetSpeed_Parms
{
	int NewSpeed;
};// FUNC_Final FUNC_Native

struct APlayerController_execClientDrawCoordinateSystem_Parms
{
	struct FVector AxisLoc;
	struct FRotator AxisRot;
	float Scale;
	unsigned long bPersistentLines : 1;
};

// (0x344 - 0x5B4)
class APlayerController : public AController
{
public:
	void*                                              Player;                                      // 0x0344 (0x0004)
	class ACamera*                                     PlayerCamera;                                // 0x0348 (0x0004)
	class UClass*                                      CameraClass;                                 // 0x034C (0x0004)
	class ADebugCameraController*                      DebugCameraControllerRef;                    // 0x0350 (0x0004)
	class UClass*                                      DebugCameraControllerClass;                  // 0x0354 (0x0004)
	class UClass*                                      PlayerOwnerDataStoreClass;                   // 0x0358 (0x0004)
	void*                                              CurrentPlayerData;                           // 0x035C (0x0004)
	unsigned long                                      bFrozen : 1;                                 // 0x0360 (0x0004) [0x00000001]
	unsigned long                                      bPressedJump : 1;                            // 0x0360 (0x0004) [0x00000002]
	unsigned long                                      bDoubleJump : 1;                             // 0x0360 (0x0004) [0x00000004]
	unsigned long                                      bUpdatePosition : 1;                         // 0x0360 (0x0004) [0x00000008]
	unsigned long                                      bUpdating : 1;                               // 0x0360 (0x0004) [0x00000010]
	unsigned long                                      bNeverSwitchOnPickup : 1;                    // 0x0360 (0x0004) [0x00000020]
	unsigned long                                      bCheatFlying : 1;                            // 0x0360 (0x0004) [0x00000040]
	unsigned long                                      bCameraPositionLocked : 1;                   // 0x0360 (0x0004) [0x00000080]
	unsigned long                                      bNoTextToSpeechVoiceMessages : 1;            // 0x0360 (0x0004) [0x00000100]
	unsigned long                                      bTextToSpeechTeamMessagesOnly : 1;           // 0x0360 (0x0004) [0x00000200]
	unsigned long                                      bShortConnectTimeOut : 1;                    // 0x0360 (0x0004) [0x00000400]
	unsigned long                                      bPendingDestroy : 1;                         // 0x0360 (0x0004) [0x00000800]
	unsigned long                                      bWasSpeedHack : 1;                           // 0x0360 (0x0004) [0x00001000]
	unsigned long                                      bWasSaturated : 1;                           // 0x0360 (0x0004) [0x00002000]
	unsigned long                                      bDynamicNetSpeed : 1;                        // 0x0360 (0x0004) [0x00004000]
	unsigned long                                      bAimingHelp : 1;                             // 0x0360 (0x0004) [0x00008000]
	unsigned long                                      bClientSimulatingViewTarget : 1;             // 0x0360 (0x0004) [0x00010000]
	unsigned long                                      bHasVoiceHandshakeCompleted : 1;             // 0x0360 (0x0004) [0x00020000]
	unsigned long                                      bCinematicMode : 1;                          // 0x0360 (0x0004) [0x00040000]
	unsigned long                                      bCinemaDisableInputMove : 1;                 // 0x0360 (0x0004) [0x00080000]
	unsigned long                                      bCinemaDisableInputLook : 1;                 // 0x0360 (0x0004) [0x00100000]
	unsigned long                                      bIgnoreNetworkMessages : 1;                  // 0x0360 (0x0004) [0x00200000]
	unsigned long                                      bReplicateAllPawns : 1;                      // 0x0360 (0x0004) [0x00400000]
	unsigned long                                      bIsUsingStreamingVolumes : 1;                // 0x0360 (0x0004) [0x00800000]
	unsigned long                                      bIsExternalUIOpen : 1;                       // 0x0360 (0x0004) [0x01000000]
	unsigned long                                      bIsControllerConnected : 1;                  // 0x0360 (0x0004) [0x02000000]
	unsigned long                                      bCheckSoundOcclusion : 1;                    // 0x0360 (0x0004) [0x04000000]
	unsigned long                                      bLogHearSoundOverflow : 1;                   // 0x0360 (0x0004) [0x08000000]
	unsigned long                                      bCheckRelevancyThroughPortals : 1;           // 0x0360 (0x0004) [0x10000000]
	unsigned long                                      bReceivedUniqueId : 1;                       // 0x0360 (0x0004) [0x20000000]
	float                                              MaxResponseTime;                             // 0x0364 (0x0004)
	float                                              WaitDelay;                                   // 0x0368 (0x0004)
	class APawn*                                       AcknowledgedPawn;                            // 0x036C (0x0004)
	unsigned char                                      DoubleClickDir;                              // 0x0370 (0x0001)
	unsigned char                                      bIgnoreMoveInput;                            // 0x0371 (0x0001)
	unsigned char                                      bIgnoreLookInput;                            // 0x0372 (0x0001)
	unsigned char                                      bRun;                                        // 0x0373 (0x0001)
	unsigned char                                      bDuck;                                       // 0x0374 (0x0001)
	unsigned char                                      NetPlayerIndex;                              // 0x0375 (0x0001)
	class AActor*                                      ViewTarget;                                  // 0x0378 (0x0004)
	class APlayerReplicationInfo*                      RealViewTarget;                              // 0x037C (0x0004)
	void*                                              ControllingDirTrackInst;                     // 0x0380 (0x0004)
	float                                              FOVAngle;                                    // 0x0384 (0x0004)
	float                                              DesiredFOV;                                  // 0x0388 (0x0004)
	float                                              DefaultFOV;                                  // 0x038C (0x0004)
	float                                              LODDistanceFactor;                           // 0x0390 (0x0004)
	struct FRotator                                    TargetViewRotation;                          // 0x0394 (0x000C)
	float                                              TargetEyeHeight;                             // 0x03A0 (0x0004)
	struct FRotator                                    BlendedTargetViewRotation;                   // 0x03A4 (0x000C)
	class AHUD*                                        myHUD;                                       // 0x03B0 (0x0004)
	class UClass*                                      SavedMoveClass;                              // 0x03B4 (0x0004)
	void*                                              SavedMoves;                                  // 0x03B8 (0x0004)
	void*                                              FreeMoves;                                   // 0x03BC (0x0004)
	void*                                              PendingMove;                                 // 0x03C0 (0x0004)
	struct FVector                                     LastAckedAccel;                              // 0x03C4 (0x000C)
	float                                              CurrentTimeStamp;                            // 0x03D0 (0x0004)
	float                                              LastUpdateTime;                              // 0x03D4 (0x0004)
	float                                              ServerTimeStamp;                             // 0x03D8 (0x0004)
	float                                              TimeMargin;                                  // 0x03DC (0x0004)
	float                                              ClientUpdateTime;                            // 0x03E0 (0x0004)
	float                                              MaxTimeMargin;                               // 0x03E4 (0x0004)
	float                                              LastActiveTime;                              // 0x03E8 (0x0004)
	int                                                ClientCap;                                   // 0x03EC (0x0004)
	float                                              DynamicPingThreshold;                        // 0x03F0 (0x0004)
	float                                              LastPingUpdate;                              // 0x03F4 (0x0004)
	float                                              OldPing;                                     // 0x03F8 (0x0004)
	float                                              LastSpeedHackLog;                            // 0x03FC (0x0004)
	struct FClientAdjustment                           PendingAdjustment;                           // 0x0400 (0x0034)
	struct FString                                     ProgressMessage[ 2 ];                        // 0x0434 (0x0018)
	float                                              ProgressTimeOut;                             // 0x044C (0x0004)
	struct FString                                     QuickSaveString;                             // 0x0450 (0x000C)
	struct FString                                     NoPauseMessage;                              // 0x045C (0x000C)
	struct FString                                     ViewingFrom;                                 // 0x0468 (0x000C)
	struct FString                                     OwnCamera;                                   // 0x0474 (0x000C)
	int                                                GroundPitch;                                 // 0x0480 (0x0004)
	struct FVector                                     OldFloor;                                    // 0x0484 (0x000C)
	class UCheatManager*                               CheatManager;                                // 0x0490 (0x0004)
	class UClass*                                      CheatClass;                                  // 0x0494 (0x0004)
	class UPlayerInput*                                PlayerInput;                                 // 0x0498 (0x0004)
	class UClass*                                      InputClass;                                  // 0x049C (0x0004)
	struct FVector                                     FailedPathStart;                             // 0x04A0 (0x000C)
	void*                                              CylinderComponent;                           // 0x04AC (0x0004)
	struct FString                                     ForceFeedbackManagerClassName;               // 0x04B0 (0x000C)
	void*                                              ForceFeedbackManager;                        // 0x04BC (0x0004)
	TArray< class UInteraction* >                      Interactions;                                // 0x04C0 (0x000C)
	TArray< struct FUniqueNetId >                      VoiceMuteList;                               // 0x04CC (0x000C)
	TArray< struct FUniqueNetId >                      GameplayVoiceMuteList;                       // 0x04D8 (0x000C)
	TArray< struct FUniqueNetId >                      VoicePacketFilter;                           // 0x04E4 (0x000C)
	class UOnlineSubsystem*                            OnlineSub;                                   // 0x04F0 (0x0004)
	unsigned char                                      unknown_data06[ 8 ];                         // 0x04F4 (0x0008)
	void*                                              OnlinePlayerData;                            // 0x04FC (0x0004)
	float                                              InteractDistance;                            // 0x0500 (0x0004)
	struct FName                                       DelayedJoinSessionName;                      // 0x0504 (0x0008)
	TArray< struct FInputMatchRequest >                InputRequests;                               // 0x050C (0x000C)
	float                                              LastBroadcastTime;                           // 0x0518 (0x0004)
	struct FString                                     LastBroadcastString[ 4 ];                    // 0x051C (0x0030)
	TArray< struct FName >                             PendingMapChangeLevelNames;                  // 0x054C (0x000C)
	void*                                              MyCoverReplicator;                           // 0x0558 (0x0004)
	TArray< struct FDebugTextInfo >                    DebugTextList;                               // 0x055C (0x000C)
	float                                              SpectatorCameraSpeed;                        // 0x0568 (0x0004)
	void*                                              PendingSwapConnection;                       // 0x056C (0x0004)
	float                                              MinRespawnDelay;                             // 0x0570 (0x0004)
	int                                                MaxConcurrentHearSounds;                     // 0x0574 (0x0004)
	TArray< void* >                                    HearSoundActiveComponents;                   // 0x0578 (0x000C)
	TArray< void* >                                    HearSoundPoolComponents;                     // 0x0584 (0x000C)
	TArray< class AActor* >                            HiddenActors;                                // 0x0590 (0x000C)
	float                                              LastSpectatorStateSynchTime;                 // 0x059C (0x0004)
	int                                                RelevancyCacheID;                            // 0x05A0 (0x0004)
	int                                                MaxRelevancyCacheID;                         // 0x05A4 (0x0004)
	struct FScriptDelegate                             __CanUnpause__Delegate;                      // 0x05A8 (0x000C)

	// Dead
	// RoundEnded
	// WaitingForPawn
	// PlayerWaiting
	// Spectating
	// BaseSpectating
	// PlayerFlying
	// PlayerSwimming
	// PlayerDriving
	// PlayerClimbing
	// PlayerWalking

private:
	static UClass* ClassPointer;

public:
	static UClass* StaticClass ()
	{
		if ( !ClassPointer )
			ClassPointer = UObject::FindClass( "Class Engine.PlayerController" );

		return ClassPointer;
	};

public:
	void GoToDeadState ()
	{
		static UFunction* pfnGoToDeadState = NULL;

		if ( !pfnGoToDeadState )
			pfnGoToDeadState = UObject::FindObject< UFunction >( "Function Engine.PlayerController.GoToDeadState" );

		APlayerController_execGoToDeadState_Parms GoToDeadState_Parms;

		this->ProcessEvent( pfnGoToDeadState, &GoToDeadState_Parms, NULL );
	};

	int eventGetTheControllerID ()
	{
		static UFunction* pfnGetTheControllerID = NULL;

		if ( !pfnGetTheControllerID )
