/////////////////////////////////////////////////////////////////////////////
// Unreal Engine MiniSDK Generator by uNrEaL
// Game: CrimeCraft
// File: AVehicle.h
// Date: 06/16/2011 @ 05:19:39.807
/////////////////////////////////////////////////////////////////////////////

#ifdef _MSC_VER
#pragma pack( push, 4 )
#endif

struct AVehicle_execZeroMovementVariables_Parms
{
};

struct AVehicle_execNotifyDriverTakeHit_Parms
{
	class AController* InstigatedBy;
	struct FVector HitLocation;
	int Damage;
	class UClass* DamageType;
	struct FVector Momentum;
};

struct AVehicle_eventReplicatedEvent_Parms
{
	struct FName VarName;
};// FUNC_Event

struct AVehicle_execDrivingStatusChanged_Parms
{
};

struct AVehicle_execHandleDeadVehicleDriver_Parms
{
};

struct AVehicle_execSetDriving_Parms
{
	unsigned long B : 1;
};

struct AVehicle_eventGetEntryLocation_Parms
{
	struct FVector ReturnValue; // CPF_ReturnParm
};// FUNC_Event

struct AVehicle_execCrushedBy_Parms
{
	class APawn* OtherPawn;
};

struct AVehicle_execPancakeOther_Parms
{
	class APawn* Other;
};

struct AVehicle_eventEncroachingOn_Parms
{
	class AActor* Other;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Event

struct AVehicle_execGetCollisionDamageInstigator_Parms
{
	class AController* ReturnValue; // CPF_ReturnParm
};

struct AVehicle_eventEncroachedBy_Parms
{
	class AActor* Other;
};// FUNC_Event

struct AVehicle_execFaceRotation_Parms
{
	struct FRotator NewRotation;
	float DeltaTime;
};

struct AVehicle_execGetDefaultCameraMode_Parms
{
	class APlayerController* RequestedBy;
	struct FName ReturnValue; // CPF_ReturnParm
};

struct AVehicle_execPlayDying_Parms
{
	class UClass* DamageType;
	struct FVector HitLoc;
};

struct AVehicle_execDriverDied_Parms
{
	class UClass* DamageType;
};

struct AVehicle_execDied_Parms
{
	class AController* Killer;
	class UClass* DamageType;
	struct FVector HitLocation;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AVehicle_execThrowActiveWeapon_Parms
{
	class UClass* DamageType;
};

struct AVehicle_execAdjustDriverDamage_Parms
{
	int Damage; // CPF_OutParm
	class AController* InstigatedBy;
	struct FVector HitLocation;
	struct FVector Momentum; // CPF_OutParm
	class UClass* DamageType;
};

struct AVehicle_eventTakeDamage_Parms
{
	int Damage;
	class AController* EventInstigator;
	struct FVector HitLocation;
	struct FVector Momentum;
	class UClass* DamageType;
	struct FTraceHitInfo HitInfo;
	class AActor* DamageCauser;
	struct FAdditionalHitInfo AddInfo;
};// FUNC_Event

struct AVehicle_execSetKillInstigator_Parms
{
	class AController* InstigatedBy;
	class UClass* DamageType;
	class AController* ReturnValue; // CPF_ReturnParm
};

struct AVehicle_execUnPossessed_Parms
{
};

struct AVehicle_execTryExitPos_Parms
{
	class APawn* ExitingDriver;
	struct FVector ExitPos;
	unsigned long bMustFindGround : 1;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AVehicle_execFindAutoExit_Parms
{
	class APawn* ExitingDriver;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AVehicle_execPlaceExitingDriver_Parms
{
	class APawn* ExitingDriver;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AVehicle_execDriverLeft_Parms
{
};

struct AVehicle_execSetInputs_Parms
{
	float InForward;
	float InStrafe;
	float InUp;
};

struct AVehicle_eventDriverLeave_Parms
{
	unsigned long bForceLeave : 1;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Event

struct AVehicle_execGetExitRotation_Parms
{
	class AController* C;
	struct FRotator ReturnValue; // CPF_ReturnParm
};

struct AVehicle_eventContinueOnFoot_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Event

struct AVehicle_execDetachDriver_Parms
{
	class APawn* P;
};

struct AVehicle_execAttachDriver_Parms
{
	class APawn* P;
};

struct AVehicle_execEntryAnnouncement_Parms
{
	class AController* C;
};

struct AVehicle_execPossessedBy_Parms
{
	class AController* C;
	unsigned long bVehicleTransition : 1;
};

struct AVehicle_execDriverEnter_Parms
{
	class APawn* P;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AVehicle_execTryToDrive_Parms
{
	class APawn* P;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AVehicle_execAnySeatAvailable_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AVehicle_execCanEnterVehicle_Parms
{
	class APawn* P;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AVehicle_execDestroyed_HandleDriver_Parms
{
};

struct AVehicle_eventDestroyed_Parms
{
};// FUNC_Event

struct AVehicle_execCheatFly_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AVehicle_execCheatGhost_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AVehicle_execCheatWalk_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AVehicle_eventPostBeginPlay_Parms
{
};// FUNC_Event

struct AVehicle_execSetBaseEyeheight_Parms
{
};

struct AVehicle_execPlayerChangedTeam_Parms
{
};

struct AVehicle_execDriverRadiusDamage_Parms
{
	float DamageAmount;
	float DamageRadius;
	class AController* EventInstigator;
	class UClass* DamageType;
	float Momentum;
	struct FVector HitLocation;
	class AActor* DamageCauser;
};

struct AVehicle_execTakeRadiusDamage_Parms
{
	class AController* InstigatedBy;
	float BaseDamage;
	float DamageRadius;
	class UClass* DamageType;
	float Momentum;
	struct FVector HurtOrigin;
	unsigned long bFullDamage : 1;
	class AActor* DamageCauser;
};

struct AVehicle_execGetTargetLocation_Parms
{
	class AActor* RequestedBy;
	unsigned long bRequestAlternateLoc : 1;
	struct FVector ReturnValue; // CPF_ReturnParm
};// FUNC_Native

struct AVehicle_execSuicide_Parms
{
};

struct AVehicle_execDisplayDebug_Parms
{
	class AHUD* HUD;
	float out_YL; // CPF_OutParm
	float out_YPos; // CPF_OutParm
};

struct AVehicle_execNotifyTeamChanged_Parms
{
};

// (0x3D8 - 0x44C)
class AVehicle : public APawn
{
public:
	class APawn*                                       Driver;                                      // 0x03D8 (0x0004)
	unsigned long                                      bDriving : 1;                                // 0x03DC (0x0004) [0x00000001]
	unsigned long                                      bDriverIsVisible : 1;                        // 0x03DC (0x0004) [0x00000002]
	unsigned long                                      bAttachDriver : 1;                           // 0x03DC (0x0004) [0x00000004]
	unsigned long                                      bTurnInPlace : 1;                            // 0x03DC (0x0004) [0x00000008]
	unsigned long                                      bSeparateTurretFocus : 1;                    // 0x03DC (0x0004) [0x00000010]
	unsigned long                                      bFollowLookDir : 1;                          // 0x03DC (0x0004) [0x00000020]
	unsigned long                                      bHasHandbrake : 1;                           // 0x03DC (0x0004) [0x00000040]
	unsigned long                                      bScriptedRise : 1;                           // 0x03DC (0x0004) [0x00000080]
	unsigned long                                      bDuckObstacles : 1;                          // 0x03DC (0x0004) [0x00000100]
	unsigned long                                      bAvoidReversing : 1;                         // 0x03DC (0x0004) [0x00000200]
	unsigned long                                      bRetryPathfindingWithDriver : 1;             // 0x03DC (0x0004) [0x00000400]
	unsigned long                                      bIgnoreStallZ : 1;                           // 0x03DC (0x0004) [0x00000800]
	unsigned long                                      bDoExtraNetRelevancyTraces : 1;              // 0x03DC (0x0004) [0x00001000]
	TArray< struct FVector >                           ExitPositions;                               // 0x03E0 (0x000C)
	float                                              ExitRadius;                                  // 0x03EC (0x0004)
	struct FVector                                     ExitOffset;                                  // 0x03F0 (0x000C)
	float                                              Steering;                                    // 0x03FC (0x0004)
	float                                              Throttle;                                    // 0x0400 (0x0004)
	float                                              Rise;                                        // 0x0404 (0x0004)
	struct FVector                                     TargetLocationAdjustment;                    // 0x0408 (0x000C)
	float                                              DriverDamageMult;                            // 0x0414 (0x0004)
	float                                              MomentumMult;                                // 0x0418 (0x0004)
	class UClass*                                      CrushedDamageType;                           // 0x041C (0x0004)
	float                                              MinCrushSpeed;                               // 0x0420 (0x0004)
	float                                              ForceCrushPenetration;                       // 0x0424 (0x0004)
	unsigned char                                      StuckCount;                                  // 0x0428 (0x0001)
	float                                              ThrottleTime;                                // 0x042C (0x0004)
	float                                              StuckTime;                                   // 0x0430 (0x0004)
	float                                              OldSteering;                                 // 0x0434 (0x0004)
	float                                              OnlySteeringStartTime;                       // 0x0438 (0x0004)
	float                                              OldThrottle;                                 // 0x043C (0x0004)
	float                                              AIMoveCheckTime;                             // 0x0440 (0x0004)
	float                                              VehicleMovingTime;                           // 0x0444 (0x0004)
	float                                              TurnTime;                                    // 0x0448 (0x0004)

private:
	static UClass* ClassPointer;

public:
	static UClass* StaticClass ()
	{
		if ( !ClassPointer )
			ClassPointer = UObject::FindClass( "Class Engine.Vehicle" );

		return ClassPointer;
	};

public:
	void ZeroMovementVariables ()
	{
		static UFunction* pfnZeroMovementVariables = NULL;

		if ( !pfnZeroMovementVariables )
			pfnZeroMovementVariables = UObject::FindObject< UFunction >( "Function Engine.Vehicle.ZeroMovementVariables" );

		AVehicle_execZeroMovementVariables_Parms ZeroMovementVariables_Parms;

		this->ProcessEvent( pfnZeroMovementVariables, &ZeroMovementVariables_Parms, NULL );
	};

	void NotifyDriverTakeHit ( class AController* InstigatedBy, struct FVector HitLocation, int Damage, class UClass* DamageType, struct FVector Momentum )
	{
		static UFunction* pfnNotifyDriverTakeHit = NULL;

		if ( !pfnNotifyDriverTakeHit )
