/////////////////////////////////////////////////////////////////////////////
// Unreal Engine MiniSDK Generator by uNrEaL
// Game: CrimeCraft
// File: AWeapon.h
// Date: 06/16/2011 @ 05:19:39.828
/////////////////////////////////////////////////////////////////////////////

#ifdef _MSC_VER
#pragma pack( push, 4 )
#endif

enum EWeaponFireType
{
	EWFT_InstantHit = 0,
	EWFT_Projectile = 1,
	EWFT_Custom = 2,
	EWFT_None = 3,
	EWFT_MAX = 4
};

struct AWeapon_execCacheAIController_Parms
{
};

struct AWeapon_execWeaponIsDown_Parms
{
};

struct AWeapon_execStillFiring_Parms
{
	unsigned char FireMode;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AWeapon_execShouldRefire_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AWeapon_execNotifyWeaponFinishedFiring_Parms
{
	unsigned char FireMode;
};

struct AWeapon_execNotifyWeaponFired_Parms
{
	unsigned char FireMode;
};

struct AWeapon_execHandleFinishedFiring_Parms
{
};

struct AWeapon_execTryPutDown_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AWeapon_execGetProjectileSpawnLocation_Parms
{
	struct FVector Direction; // CPF_OutParm
	struct FVector ReturnValue; // CPF_ReturnParm
};

struct AWeapon_eventGetPhysicalFireStartLoc_Parms
{
	struct FVector AimDir;
	struct FVector ReturnValue; // CPF_ReturnParm
};// FUNC_Event FUNC_Native

struct AWeapon_eventGetMuzzleLoc_Parms
{
	struct FVector ReturnValue; // CPF_ReturnParm
};// FUNC_Event

struct AWeapon_execCustomFire_Parms
{
};

struct AWeapon_execProjectileFire_Parms
{
	class AProjectile* ReturnValue; // CPF_ReturnParm
};

struct AWeapon_execProcessInstantHit_Parms
{
	unsigned char FiringMode;
	struct FImpactInfo Impact;
};

struct AWeapon_execInstantFire_Parms
{
};

struct AWeapon_execPassThroughDamage_Parms
{
	class AActor* HitActor;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AWeapon_execCalcWeaponFire_Parms
{
	struct FVector StartTrace;
	struct FVector EndTrace;
	TArray< struct FImpactInfo > ImpactList; // CPF_OutParm
	struct FVector Extent;
	struct FImpactInfo ReturnValue; // CPF_ReturnParm
};

struct AWeapon_execGetTraceOwner_Parms
{
	class AActor* ReturnValue; // CPF_ReturnParm
};

struct AWeapon_eventGetTraceRange_Parms
{
	float ReturnValue; // CPF_ReturnParm
};// FUNC_Event

struct AWeapon_execAddAdditionalAimRotation_Parms
{
	struct FVector StartFireLoc;
	struct FRotator BaseRotation;
	struct FRotator ReturnValue; // CPF_ReturnParm
};

struct AWeapon_execGetAdjustedAim_Parms
{
	struct FVector StartFireLoc;
	unsigned long bWithSpread : 1;
	struct FRotator ReturnValue; // CPF_ReturnParm
};

struct AWeapon_execFireAmmunition_Parms
{
	float FireTimeStamp;
};

struct AWeapon_execFireModeUpdated_Parms
{
	unsigned char FiringMode;
	unsigned long bViaReplication : 1;
};

struct AWeapon_execSetCurrentFireMode_Parms
{
	unsigned char FiringModeNum;
};

struct AWeapon_execSendToFiringState_Parms
{
	unsigned char FireModeNum;
};

struct AWeapon_execForceEndFire_Parms
{
};

struct AWeapon_execEndFire_Parms
{
	unsigned char FireModeNum;
};

struct AWeapon_execServerStopFire_Parms
{
	unsigned char FireModeNum;
};

struct AWeapon_execStopFire_Parms
{
	unsigned char FireModeNum;
};

struct AWeapon_execBeginFire_Parms
{
	unsigned char FireModeNum;
};

struct AWeapon_execServerStartFire_Parms
{
	unsigned char FireModeNum;
};

struct AWeapon_execStartFire_Parms
{
	unsigned char FireModeNum;
};

struct AWeapon_execWeaponCalcCamera_Parms
{
	float fDeltaTime;
	struct FVector out_CamLoc; // CPF_OutParm
	struct FRotator out_CamRot; // CPF_OutParm
};

struct AWeapon_execClientWeaponSet_Parms
{
	unsigned long bOptionalSet : 1;
	unsigned long bDoNotActivate : 1;
};

struct AWeapon_execClientGivenTo_Parms
{
	class APawn* NewOwner;
	unsigned long bDoNotActivate : 1;
};

struct AWeapon_execAdjustFOVAngle_Parms
{
	float FOVAngle;
	float ReturnValue; // CPF_ReturnParm
};

struct AWeapon_execGetViewAxes_Parms
{
	struct FVector XAxis; // CPF_OutParm
	struct FVector YAxis; // CPF_OutParm
	struct FVector ZAxis; // CPF_OutParm
};

struct AWeapon_execDetachWeapon_Parms
{
};

struct AWeapon_execAttachWeaponTo_Parms
{
	class USkeletalMeshComponent* MeshCpnt;
	struct FName SocketName;
};

struct AWeapon_execClearFlashLocation_Parms
{
};

struct AWeapon_execSetFlashLocation_Parms
{
	struct FVector StartTraceLocation;
	struct FVector EndTraceLocation;
	struct FAdditionalHitInfo AddInfo;
};

struct AWeapon_execClearFlashCount_Parms
{
};

struct AWeapon_execIncrementFlashCount_Parms
{
};

struct AWeapon_execWeaponEmpty_Parms
{
};

struct AWeapon_execDenyPickupQuery_Parms
{
	class UClass* ItemClass;
	class AActor* Pickup;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AWeapon_execPutDownWeapon_Parms
{
};

struct AWeapon_execActivate_Parms
{
};

struct AWeapon_execTimeWeaponEquipping_Parms
{
};

struct AWeapon_execTimeWeaponPutDown_Parms
{
};

struct AWeapon_execRefireCheckTimer_Parms
{
};

struct AWeapon_execTimeWeaponFiring_Parms
{
	unsigned char FireModeNum;
};

struct AWeapon_execGetFireInterval_Parms
{
	unsigned char FireModeNum;
	float ReturnValue; // CPF_ReturnParm
};

struct AWeapon_execPlayFiringSound_Parms
{
};

struct AWeapon_execStopFireEffects_Parms
{
	unsigned char FireModeNum;
};

struct AWeapon_execPlayFireEffects_Parms
{
	unsigned char FireModeNum;
	struct FVector StartTraceLocation;
	struct FVector EndTraceLocation;
	struct FAdditionalHitInfo AddInfo;
};

struct AWeapon_execStopWeaponAnimation_Parms
{
};

struct AWeapon_execPlayWeaponAnimation_Parms
{
	struct FName Sequence;
	float fDesiredDuration;
	unsigned long bLoop : 1;
	class USkeletalMeshComponent* SkelMesh;
};

struct AWeapon_execWeaponPlaySound_Parms
{
	void* Sound;
	float NoiseLoudness;
};

struct AWeapon_execGetWeaponAnimNodeSeq_Parms
{
	void* ReturnValue; // CPF_ReturnParm
};

struct AWeapon_execFireOnRelease_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AWeapon_execSuggestDefenseStyle_Parms
{
	float ReturnValue; // CPF_ReturnParm
};

struct AWeapon_execSuggestAttackStyle_Parms
{
	float ReturnValue; // CPF_ReturnParm
};

struct AWeapon_execCanAttack_Parms
{
	class AActor* Other;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AWeapon_execRangedAttackTime_Parms
{
	float ReturnValue; // CPF_ReturnParm
};

struct AWeapon_execRecommendLongRangedAttack_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AWeapon_execFocusOnLeader_Parms
{
	unsigned long bLeaderFiring : 1;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AWeapon_execRecommendRangedAttack_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AWeapon_execGetWeaponRating_Parms
{
	float ReturnValue; // CPF_ReturnParm
};

struct AWeapon_execRelativeStrengthVersus_Parms
{
	class APawn* P;
	float Dist;
	float ReturnValue; // CPF_ReturnParm
};

struct AWeapon_execGetAIRating_Parms
{
	float ReturnValue; // CPF_ReturnParm
};

struct AWeapon_execGetDamageRadius_Parms
{
	float ReturnValue; // CPF_ReturnParm
};

struct AWeapon_execMaxRange_Parms
{
	float ReturnValue; // CPF_ReturnParm
};

struct AWeapon_execAddSpread_Parms
{
	struct FRotator BaseAim;
	struct FRotator ReturnValue; // CPF_ReturnParm
};

struct AWeapon_execGetProjectileClass_Parms
{
	class UClass* ReturnValue; // CPF_ReturnParm
};

struct AWeapon_execClearPendingFire_Parms
{
	int FireMode;
};

struct AWeapon_execSetPendingFire_Parms
{
	int FireMode;
};

struct AWeapon_execPendingFire_Parms
{
	int FireMode;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AWeapon_execHasAnyAmmo_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AWeapon_execHasAmmo_Parms
{
	unsigned char FireModeNum;
	int Amount;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AWeapon_execAddAmmo_Parms
{
	int Amount;
	int ReturnValue; // CPF_ReturnParm
};

struct AWeapon_execConsumeAmmo_Parms
{
	unsigned char FireModeNum;
};

struct AWeapon_execDumpWeaponDebugToLog_Parms
{
};

struct AWeapon_execGetWeaponDebug_Parms
{
	TArray< struct FString > DebugInfo; // CPF_OutParm
};

struct AWeapon_execDisplayDebug_Parms
{
	class AHUD* HUD;
	float out_YL; // CPF_OutParm
	float out_YPos; // CPF_OutParm
};

struct AWeapon_execDenyClientWeaponSet_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AWeapon_eventIsFiring_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Event

struct AWeapon_execClientWeaponThrown_Parms
{
};

struct AWeapon_execCanThrow_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AWeapon_execDropFrom_Parms
{
	struct FVector StartLocation;
	struct FVector StartVelocity;
};

struct AWeapon_execDoOverridePrevWeapon_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AWeapon_execDoOverrideNextWeapon_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AWeapon_execHolderDied_Parms
{
};

struct AWeapon_execIsActiveWeapon_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct AWeapon_execItemRemovedFromInvManager_Parms
{
};

struct AWeapon_eventDestroyed_Parms
{
};// FUNC_Event

// (0x208 - 0x2AC)
class AWeapon : public AInventory
{
public:
	unsigned char                                      CurrentFireMode;                             // 0x0208 (0x0001)
	TArray< struct FName >                             FiringStatesArray;                           // 0x020C (0x000C)
	TArray< unsigned char >                            WeaponFireTypes;                             // 0x0218 (0x000C)
	TArray< class UClass* >                            WeaponProjectiles;                           // 0x0224 (0x000C)
	TArray< float >                                    FireInterval;                                // 0x0230 (0x000C)
	TArray< float >                                    Spread;                                      // 0x023C (0x000C)
	TArray< float >                                    InstantHitDamage;                            // 0x0248 (0x000C)
	TArray< float >                                    InstantHitMomentum;                          // 0x0254 (0x000C)
	TArray< class UClass* >                            InstantHitDamageTypes;                       // 0x0260 (0x000C)
	float                                              EquipTime;                                   // 0x026C (0x0004)
	float                                              PutDownTime;                                 // 0x0270 (0x0004)
	struct FVector                                     FireOffset;                                  // 0x0274 (0x000C)
	unsigned long                                      bWeaponPutDown : 1;                          // 0x0280 (0x0004) [0x00000001]
	unsigned long                                      bCanThrow : 1;                               // 0x0280 (0x0004) [0x00000002]
	unsigned long                                      bWasOptionalSet : 1;                         // 0x0280 (0x0004) [0x00000004]
	unsigned long                                      bWasDoNotActivate : 1;                       // 0x0280 (0x0004) [0x00000008]
	unsigned long                                      bInstantHit : 1;                             // 0x0280 (0x0004) [0x00000010]
	unsigned long                                      bMeleeWeapon : 1;                            // 0x0280 (0x0004) [0x00000020]
	float                                              WeaponRange;                                 // 0x0284 (0x0004)
	class UMeshComponent*                              Mesh;                                        // 0x0288 (0x0004)
	float                                              DefaultAnimSpeed;                            // 0x028C (0x0004)
	float                                              Priority;                                    // 0x0290 (0x0004)
	void*                                              AIController;                                // 0x0294 (0x0004)
	TArray< unsigned char >                            ShouldFireOnRelease;                         // 0x0298 (0x000C)
	float                                              AIRating;                                    // 0x02A4 (0x0004)
	float                                              CachedMaxRange;                              // 0x02A8 (0x0004)

	// PendingClientWeaponSet
	// WeaponPuttingDown
	// WeaponEquipping
	// WeaponFiring
	// Active
	// Inactive

private:
	static UClass* ClassPointer;

public:
	static UClass* StaticClass ()
	{
		if ( !ClassPointer )
			ClassPointer = UObject::FindClass( "Class Engine.Weapon" );

		return ClassPointer;
	};

public:
	void CacheAIController ()
	{
		static UFunction* pfnCacheAIController = NULL;

		if ( !pfnCacheAIController )
			pfnCacheAIController = UObject::FindObject< UFunction >( "Function Engine.Weapon.CacheAIController" );

		AWeapon_execCacheAIController_Parms CacheAIController_Parms;

		this->ProcessEvent( pfnCacheAIController, &CacheAIController_Parms, NULL );
	};

	void WeaponIsDown ()
	{
		static UFunction* pfnWeaponIsDown = NULL;

		if ( !pfnWeaponIsDown )
			pfnWeaponIsDown = UObject::FindObject< UFunction >( "Function Engine.Weapon.WeaponIsDown" );

		AWeapon_execWeaponIsDown_Parms WeaponIsDown_Parms;

