/////////////////////////////////////////////////////////////////////////////
// Unreal Engine MiniSDK Generator by uNrEaL
// Game: CrimeCraft
// File: AWorldInfo.h
// Date: 06/16/2011 @ 05:19:39.905
/////////////////////////////////////////////////////////////////////////////

#ifdef _MSC_VER
#pragma pack( push, 4 )
#endif

enum EConsoleType
{
	CONSOLE_Any = 0,
	CONSOLE_Xbox360 = 1,
	CONSOLE_PS3 = 2,
	CONSOLE_MAX = 3
};

enum ENetMode
{
	NM_Standalone = 0,
	NM_DedicatedServer = 1,
	NM_ListenServer = 2,
	NM_Client = 3,
	NM_MAX = 4
};

struct AWorldInfo_execGetWorldFractureSettings_Parms
{
	struct FWorldFractureSettings ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct AWorldInfo_execOnScreenDebugMessageExists_Parms
{
	int Key;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct AWorldInfo_eventNotifyExiting_Parms
{
};// FUNC_Event

struct AWorldInfo_execAddOnScreenDebugMessage_Parms
{
	int Key;
	float TimeToDisplay;
	struct FColor DisplayColor;
	struct FString DebugMessage;
};// FUNC_Final FUNC_Native

struct AWorldInfo_execDoMemoryTracking_Parms
{
};// FUNC_Final FUNC_Native

struct AWorldInfo_execGetDemoRewindPoints_Parms
{
	TArray< int > OutRewindPoints; // CPF_OutParm
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct AWorldInfo_execGetDemoFrameInfo_Parms
{
	int CurrentFrame; // CPF_OutParm
	int TotalFrames; // CPF_OutParm
};// FUNC_Final FUNC_Native

struct AWorldInfo_execIsPlayingDemo_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct AWorldInfo_execIsRecordingDemo_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct AWorldInfo_execGetDetailMode_Parms
{
	unsigned char ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct AWorldInfo_execGetMapName_Parms
{
	unsigned long bIncludePrefix : 1;
	struct FString ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct AWorldInfo_execSetMapInfo_Parms
{
	void* NewMapInfo;
};// FUNC_Final FUNC_Native

struct AWorldInfo_execGetMapInfo_Parms
{
	void* ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct AWorldInfo_execSetSeamlessTravelMidpointPause_Parms
{
	unsigned long bNowPaused : 1;
};// FUNC_Final FUNC_Native

struct AWorldInfo_execIsInSeamlessTravel_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct AWorldInfo_execSeamlessTravel_Parms
{
	struct FString URL;
	unsigned long bAbsolute : 1;
	struct FGuid MapPackageGuid;
};// FUNC_Final FUNC_Native

struct AWorldInfo_execCommitMapChange_Parms
{
};// FUNC_Final FUNC_Native

struct AWorldInfo_execCancelPendingMapChange_Parms
{
};// FUNC_Final FUNC_Native

struct AWorldInfo_execIsMapChangeReady_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct AWorldInfo_execIsPreparingMapChange_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct AWorldInfo_execPrepareMapChange_Parms
{
	TArray< struct FName > LevelNames; // CPF_OutParm
};// FUNC_Final FUNC_Native

struct AWorldInfo_execNotifyMatchStarted_Parms
{
	unsigned long bShouldActivateLevelStartupEvents : 1;
	unsigned long bShouldActivateLevelBeginningEvents : 1;
	unsigned long bShouldActivateLevelLoadedEvents : 1;
};// FUNC_Final FUNC_Native

struct AWorldInfo_execAllPawns_Parms
{
	class UClass* BaseClass;
	class APawn* P; // CPF_OutParm
	struct FVector TestLocation;
	float TestRadius;
};// FUNC_Final FUNC_Native

struct AWorldInfo_execAllControllers_Parms
{
	class UClass* BaseClass;
	class AController* C; // CPF_OutParm
};// FUNC_Final FUNC_Native

struct AWorldInfo_execNavigationPointCheck_Parms
{
	struct FVector Point;
	struct FVector Extent;
	TArray< class ANavigationPoint* > Navs; // CPF_OutParm
	TArray< void* > Specs; // CPF_OutParm
};// FUNC_Final FUNC_Native

struct AWorldInfo_execRadiusNavigationPoints_Parms
{
	class UClass* BaseClass;
	class ANavigationPoint* N; // CPF_OutParm
	struct FVector Point;
	float Radius;
};// FUNC_Final FUNC_Native

struct AWorldInfo_execAllNavigationPoints_Parms
{
	class UClass* BaseClass;
	class ANavigationPoint* N; // CPF_OutParm
};// FUNC_Final FUNC_Native

struct AWorldInfo_execReset_Parms
{
};

struct AWorldInfo_execPostBeginPlay_Parms
{
};

struct AWorldInfo_execPreBeginPlay_Parms
{
};

struct AWorldInfo_execThisIsNeverExecuted_Parms
{
	void* P;
};

struct AWorldInfo_eventServerTravel_Parms
{
	struct FString URL;
	unsigned long bAbsolute : 1;
	unsigned long bShouldSkipGameNotify : 1;
};// FUNC_Event

struct AWorldInfo_execGetGameClass_Parms
{
	class UClass* ReturnValue; // CPF_ReturnParm
};

struct AWorldInfo_execGetAddressURL_Parms
{
	struct FString ReturnValue; // CPF_ReturnParm
};// FUNC_Native

struct AWorldInfo_execVerifyNavList_Parms
{
};// FUNC_Final FUNC_Native

struct AWorldInfo_execForceGarbageCollection_Parms
{
	unsigned long bFullPurge : 1;
};// FUNC_Final FUNC_Native

struct AWorldInfo_execIsPlayInEditor_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct AWorldInfo_execIsConsoleBuild_Parms
{
	unsigned char ConsoleType;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct AWorldInfo_execIsDemoBuild_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct AWorldInfo_execGetLocalURL_Parms
{
	struct FString ReturnValue; // CPF_ReturnParm
};// FUNC_Native

struct AWorldInfo_execSetLevelRBGravity_Parms
{
	struct FVector NewGrav;
};// FUNC_Final FUNC_Native

struct AWorldInfo_execGetGameSequence_Parms
{
	void* ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct AWorldInfo_execGetGravityZ_Parms
{
	float ReturnValue; // CPF_ReturnParm
};// FUNC_Native

struct AWorldInfo_execIsServer_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final

struct AWorldInfo_execUpdateMusicTrack_Parms
{
	struct FMusicTrackStruct NewMusicTrack;
};// FUNC_Final FUNC_Native

struct AWorldInfo_execIsMenuLevel_Parms
{
	struct FString MapName;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct AWorldInfo_eventReplicatedEvent_Parms
{
	struct FName VarName;
};// FUNC_Event

// (0x1CC - 0x524)
class AWorldInfo : public AZoneInfo
{
public:
	struct FPostProcessSettings                        DefaultPostProcessSettings;                  // 0x01CC (0x0080)
	float                                              SquintModeKernelSize;                        // 0x024C (0x0004)
	void*                                              HighestPriorityPostProcessVolume;            // 0x0250 (0x0004)
	struct FReverbSettings                             DefaultReverbSettings;                       // 0x0254 (0x000C)
	void*                                              HighestPriorityReverbVolume;                 // 0x0260 (0x0004)
	TArray< void* >                                    PortalVolumes;                               // 0x0264 (0x000C)
	TArray< void* >                                    StreamingLevels;                             // 0x0270 (0x000C)
	unsigned long                                      bMapNeedsLightingFullyRebuilt : 1;           // 0x027C (0x0004) [0x00000001]
	unsigned long                                      bMapHasPathingErrors : 1;                    // 0x027C (0x0004) [0x00000002]
	unsigned long                                      bRequestedBlockOnAsyncLoading : 1;           // 0x027C (0x0004) [0x00000004]
	unsigned long                                      bBegunPlay : 1;                              // 0x027C (0x0004) [0x00000008]
	unsigned long                                      bPlayersOnly : 1;                            // 0x027C (0x0004) [0x00000010]
	unsigned long                                      bDropDetail : 1;                             // 0x027C (0x0004) [0x00000020]
	unsigned long                                      bAggressiveLOD : 1;                          // 0x027C (0x0004) [0x00000040]
	unsigned long                                      bStartup : 1;                                // 0x027C (0x0004) [0x00000080]
	unsigned long                                      bPathsRebuilt : 1;                           // 0x027C (0x0004) [0x00000100]
	unsigned long                                      bHasPathNodes : 1;                           // 0x027C (0x0004) [0x00000200]
	unsigned long                                      bIsMenuLevel : 1;                            // 0x027C (0x0004) [0x00000400]
	unsigned long                                      bUseConsoleInput : 1;                        // 0x027C (0x0004) [0x00000800]
	unsigned long                                      bNoDefaultInventoryForPlayer : 1;            // 0x027C (0x0004) [0x00001000]
	unsigned long                                      bNoPathWarnings : 1;                         // 0x027C (0x0004) [0x00002000]
	unsigned long                                      bHighPriorityLoading : 1;                    // 0x027C (0x0004) [0x00004000]
	unsigned long                                      bHighPriorityLoadingLocal : 1;               // 0x027C (0x0004) [0x00008000]
	unsigned long                                      bSupportDoubleBufferedPhysics : 1;           // 0x027C (0x0004) [0x00010000]
	unsigned long                                      bEnableChanceOfPhysicsChunkOverride : 1;     // 0x027C (0x0004) [0x00020000]
	unsigned long                                      bLimitExplosionChunkSize : 1;                // 0x027C (0x0004) [0x00040000]
	unsigned long                                      bLimitDamageChunkSize : 1;                   // 0x027C (0x0004) [0x00080000]
	unsigned long                                      bAllowModulateBetterShadows : 1;             // 0x027C (0x0004) [0x00100000]
	unsigned long                                      bAllowLightEnvSphericalHarmonicLights : 1;   // 0x027C (0x0004) [0x00200000]
	unsigned long                                      bIncreaseFogNearPrecision : 1;               // 0x027C (0x0004) [0x00400000]
	struct FDouble                                     LastTimeUnbuiltLightingWasEncountered;       // 0x0280 (0x0008)
	void*                                              BookMarks[ 10 ];                             // 0x0288 (0x0028)
	TArray< void* >                                    ClipPadEntries;                              // 0x02B0 (0x000C)
	float                                              TimeDilation;                                // 0x02BC (0x0004)
	float                                              DemoPlayTimeDilation;                        // 0x02C0 (0x0004)
	float                                              TimeSeconds;                                 // 0x02C4 (0x0004)
	float                                              RealTimeSeconds;                             // 0x02C8 (0x0004)
	float                                              AudioTimeSeconds;                            // 0x02CC (0x0004)
	float                                              DeltaSeconds;                                // 0x02D0 (0x0004)
	float                                              PauseDelay;                                  // 0x02D4 (0x0004)
	float                                              RealTimeToUnPause;                           // 0x02D8 (0x0004)
	class APlayerReplicationInfo*                      Pauser;                                      // 0x02DC (0x0004)
	struct FString                                     VisibleGroups;                               // 0x02E0 (0x000C)
	struct FString                                     SelectedGroups;                              // 0x02EC (0x000C)
	class UTexture2D*                                  DefaultTexture;                              // 0x02F8 (0x0004)
	class UTexture2D*                                  WireframeTexture;                            // 0x02FC (0x0004)
	class UTexture2D*                                  WhiteSquareTexture;                          // 0x0300 (0x0004)
	class UTexture2D*                                  LargeVertex;                                 // 0x0304 (0x0004)
	class UTexture2D*                                  BSPVertex;                                   // 0x0308 (0x0004)
	TArray< struct FString >                           DeferredExecs;                               // 0x030C (0x000C)
	class AGameReplicationInfo*                        GRI;                                         // 0x0318 (0x0004)
	unsigned char                                      NetMode;                                     // 0x031C (0x0001)
	unsigned char                                      NextTravelType;                              // 0x031D (0x0001)
	struct FString                                     ComputerName;                                // 0x0320 (0x000C)
	struct FString                                     EngineVersion;                               // 0x032C (0x000C)
	struct FString                                     MinNetVersion;                               // 0x0338 (0x000C)
	class AGameInfo*                                   Game;                                        // 0x0344 (0x0004)
	float                                              StallZ;                                      // 0x0348 (0x0004)
	float                                              WorldGravityZ;                               // 0x034C (0x0004)
	float                                              DefaultGravityZ;                             // 0x0350 (0x0004)
	float                                              GlobalGravityZ;                              // 0x0354 (0x0004)
	float                                              RBPhysicsGravityScaling;                     // 0x0358 (0x0004)
	class ANavigationPoint*                            NavigationPointList;                         // 0x035C (0x0004)
	class AController*                                 ControllerList;                              // 0x0360 (0x0004)
	class APawn*                                       PawnList;                                    // 0x0364 (0x0004)
	void*                                              CoverList;                                   // 0x0368 (0x0004)
	float                                              MoveRepSize;                                 // 0x036C (0x0004)
	TArray< struct FNetViewer >                        ReplicationViewers;                          // 0x0370 (0x000C)
	struct FString                                     NextURL;                                     // 0x037C (0x000C)
	float                                              NextSwitchCountdown;                         // 0x0388 (0x0004)
	int                                                PackedLightAndShadowMapTextureSize;          // 0x038C (0x0004)
	struct FVector                                     DefaultColorScale;                           // 0x0390 (0x000C)
	TArray< class UClass* >                            GameTypesSupportedOnThisMap;                 // 0x039C (0x000C)
	TArray< class UObject* >                           ClientDestroyedActorContent;                 // 0x03A8 (0x000C)
	TArray< struct FName >                             PreparingLevelNames;                         // 0x03B4 (0x000C)
	struct FName                                       CommittedPersistentLevelName;                // 0x03C0 (0x0008)
	void*                                              MusicComp;                                   // 0x03C8 (0x0004)
	struct FMusicTrackStruct                           CurrentMusicTrack;                           // 0x03CC (0x0018)
	struct FMusicTrackStruct                           ReplicatedMusicTrack;                        // 0x03E4 (0x0018)
	struct FString                                     Title;                                       // 0x03FC (0x000C)
	struct FString                                     Author;                                      // 0x0408 (0x000C)
	void*                                              MyMapInfo;                                   // 0x0414 (0x0004)
	struct FString                                     EmitterPoolClassPath;                        // 0x0418 (0x000C)
	void*                                              MyEmitterPool;                               // 0x0424 (0x0004)
	struct FString                                     DecalManagerClassPath;                       // 0x0428 (0x000C)
	void*                                              MyDecalManager;                              // 0x0434 (0x0004)
	struct FString                                     FractureManagerClassPath;                    // 0x0438 (0x000C)
	void*                                              MyFractureManager;                           // 0x0444 (0x0004)
	float                                              MaxPhysicsDeltaTime;                         // 0x0448 (0x0004)
	int                                                MaxPhysicsSubsteps;                          // 0x044C (0x0004)
	struct FPhysXSceneProperties                       PhysicsProperties;                           // 0x0450 (0x003C)
	TArray< struct FCompartmentRunList >               CompartmentRunFrames;                        // 0x048C (0x000C)
	void*                                              EmitterVertical;                             // 0x0498 (0x0004)
	void*                                              DestructibleVertical;                        // 0x049C (0x0004)
	struct FPhysXVerticalProperties                    VerticalProperties;                          // 0x04A0 (0x0018)
	float                                              GlobalLodSwitchKoeff;                        // 0x04B8 (0x0004)
	float                                              ChanceOfPhysicsChunkOverride;                // 0x04BC (0x0004)
	float                                              MaxExplosionChunkSize;                       // 0x04C0 (0x0004)
	float                                              MaxDamageChunkSize;                          // 0x04C4 (0x0004)
	float                                              FractureExplosionVelScale;                   // 0x04C8 (0x0004)
	int                                                MaxNumFacturedChunksToSpawnInAFrame;         // 0x04CC (0x0004)
	int                                                NumFacturedChunksSpawnedThisFrame;           // 0x04D0 (0x0004)
	float                                              FracturedMeshWeaponDamage;                   // 0x04D4 (0x0004)
	struct FMap_Mirror                                 ScreenMessages;                              // 0x04D8 (0x003C)
	TArray< struct FScreenMessageString >              PriorityScreenMessages;                      // 0x0514 (0x000C)
	void*                                              ReplicationStatsObject;                      // 0x0520 (0x0004)

private:
	static UClass* ClassPointer;

public:
	static UClass* StaticClass ()
	{
		if ( !ClassPointer )
			ClassPointer = UObject::FindClass( "Class Engine.WorldInfo" );

		return ClassPointer;
	};

public:
	struct FWorldFractureSettings GetWorldFractureSettings ()
	{
		static UFunction* pfnGetWorldFractureSettings = NULL;

		if ( !pfnGetWorldFractureSettings )
			pfnGetWorldFractureSettings = UObject::FindObject< UFunction >( "Function Engine.WorldInfo.GetWorldFractureSettings" );

		AWorldInfo_execGetWorldFractureSettings_Parms GetWorldFractureSettings_Parms;

		pfnGetWorldFractureSettings->FunctionFlags |= ~0x400;
		this->ProcessEvent( pfnGetWorldFractureSettings, &GetWorldFractureSettings_Parms, NULL );
		pfnGetWorldFractureSettings->FunctionFlags |= 0x400;

		return GetWorldFractureSettings_Parms.ReturnValue;
	};

	bool OnScreenDebugMessageExists ( int Key )
	{
		static UFunction* pfnOnScreenDebugMessageExists = NULL;

