/////////////////////////////////////////////////////////////////////////////
// Unreal Engine MiniSDK Generator by uNrEaL
// Game: CrimeCraft
// File: UGameViewportClient.h
// Date: 06/16/2011 @ 05:19:39.424
/////////////////////////////////////////////////////////////////////////////

#ifdef _MSC_VER
#pragma pack( push, 4 )
#endif

enum ESafeZoneType
{
	eSZ_TOP = 0,
	eSZ_BOTTOM = 1,
	eSZ_LEFT = 2,
	eSZ_RIGHT = 3,
	eSZ_MAX = 4
};

enum ESplitScreenType
{
	eSST_NONE = 0,
	eSST_2P_HORIZONTAL = 1,
	eSST_2P_VERTICAL = 2,
	eSST_3P_FAVOR_TOP = 3,
	eSST_3P_FAVOR_BOTTOM = 4,
	eSST_4P = 5,
	eSST_MAX = 6
};

struct UGameViewportClient_execRemoveLocalPlayer_Parms
{
	void* ExistingPlayer;
	int ReturnValue; // CPF_ReturnParm
};// FUNC_Final

struct UGameViewportClient_execAddLocalPlayer_Parms
{
	void* NewPlayer;
	int ReturnValue; // CPF_ReturnParm
};// FUNC_Final

struct UGameViewportClient_execNotifyPlayerRemoved_Parms
{
	int PlayerIndex;
	void* RemovedPlayer;
};// FUNC_Final

struct UGameViewportClient_execNotifyPlayerAdded_Parms
{
	int PlayerIndex;
	void* AddedPlayer;
};// FUNC_Final

struct UGameViewportClient_execDrawTransitionMessage_Parms
{
	class UCanvas* Canvas;
	struct FString Message;
};

struct UGameViewportClient_execDrawTransition_Parms
{
	class UCanvas* Canvas;
};

struct UGameViewportClient_eventPostRender_Parms
{
	class UCanvas* Canvas;
};// FUNC_Event

struct UGameViewportClient_execDrawTitleSafeArea_Parms
{
	class UCanvas* Canvas;
};

struct UGameViewportClient_eventTick_Parms
{
	float DeltaTime;
};// FUNC_Event

struct UGameViewportClient_execCalculatePixelCenter_Parms
{
	float out_CenterX; // CPF_OutParm
	float out_CenterY; // CPF_OutParm
	void* LPlayer;
	class UCanvas* Canvas;
	unsigned long bUseMaxPercent : 1;
};// FUNC_Final

struct UGameViewportClient_execCalculateDeadZoneForAllSides_Parms
{
	void* LPlayer;
	class UCanvas* Canvas;
	float fTopSafeZone; // CPF_OutParm
	float fBottomSafeZone; // CPF_OutParm
	float fLeftSafeZone; // CPF_OutParm
	float fRightSafeZone; // CPF_OutParm
	unsigned long bUseMaxPercent : 1;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final

struct UGameViewportClient_execCalculateDeadZone_Parms
{
	void* LPlayer;
	unsigned char SZType;
	class UCanvas* Canvas;
	unsigned long bUseMaxPercent : 1;
	float ReturnValue; // CPF_ReturnParm
};// FUNC_Final

struct UGameViewportClient_execCalculateSafeZoneValues_Parms
{
	float out_Horizontal; // CPF_OutParm
	float out_Vertical; // CPF_OutParm
	class UCanvas* Canvas;
	int LocalPlayerIndex;
	unsigned long bUseMaxPercent : 1;
};// FUNC_Final

struct UGameViewportClient_execGetPixelSizeOfScreen_Parms
{
	float out_Width; // CPF_OutParm
	float out_Height; // CPF_OutParm
	class UCanvas* Canvas;
	int LocalPlayerIndex;
};// FUNC_Final

struct UGameViewportClient_execHasRightSafeZone_Parms
{
	int LocalPlayerIndex;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final

struct UGameViewportClient_execHasLeftSafeZone_Parms
{
	int LocalPlayerIndex;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final

struct UGameViewportClient_execHasBottomSafeZone_Parms
{
	int LocalPlayerIndex;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final

struct UGameViewportClient_execHasTopSafeZone_Parms
{
	int LocalPlayerIndex;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final

struct UGameViewportClient_execConvertLocalPlayerToGamePlayerIndex_Parms
{
	void* LPlayer;
	int ReturnValue; // CPF_ReturnParm
};// FUNC_Final

struct UGameViewportClient_eventGetSubtitleRegion_Parms
{
	struct FVector2D MinPos; // CPF_OutParm
	struct FVector2D MaxPos; // CPF_OutParm
};// FUNC_Event

struct UGameViewportClient_eventLayoutPlayers_Parms
{
};// FUNC_Event

struct UGameViewportClient_execUpdateActiveSplitscreenType_Parms
{
};

struct UGameViewportClient_execGetSplitscreenConfiguration_Parms
{
	unsigned char ReturnValue; // CPF_ReturnParm
};

struct UGameViewportClient_execSetSplitscreenConfiguration_Parms
{
	unsigned char SplitType;
};

struct UGameViewportClient_eventGameSessionEnded_Parms
{
};// FUNC_Event

struct UGameViewportClient_eventInsertInteraction_Parms
{
	class UInteraction* NewInteraction;
	int InIndex;
	int ReturnValue; // CPF_ReturnParm
};// FUNC_Event

struct UGameViewportClient_execCreateInitialPlayer_Parms
{
	struct FString OutError; // CPF_OutParm
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct UGameViewportClient_eventInit_Parms
{
	struct FString OutError; // CPF_OutParm
	unsigned long bConsoleEnabled : 1;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Event

struct UGameViewportClient_eventFindPlayerByControllerId_Parms
{
	int ControllerId;
	void* ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Event

struct UGameViewportClient_eventRemovePlayer_Parms
{
	void* ExPlayer;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Event

struct UGameViewportClient_eventCreatePlayer_Parms
{
	int ControllerId;
	struct FString OutError; // CPF_OutParm
	unsigned long bSpawnActor : 1;
	void* ReturnValue; // CPF_ReturnParm
};// FUNC_Event

struct UGameViewportClient_execShouldForceFullscreenViewport_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct UGameViewportClient_execIsFullScreenViewport_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct UGameViewportClient_execGetViewportSize_Parms
{
	struct FVector2D out_ViewportSize; // CPF_OutParm
};// FUNC_Final FUNC_Native

struct UGameViewportClient_execConsoleCommand_Parms
{
	struct FString Command;
	struct FString ReturnValue; // CPF_ReturnParm
};// FUNC_Native

struct UGameViewportClient_execHandleInputChar_Parms
{
	int ControllerId;
	struct FString Unicode;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct UGameViewportClient_execHandleInputAxis_Parms
{
	int ControllerId;
	struct FName Key;
	float Delta;
	float DeltaTime;
	unsigned long bGamepad : 1;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct UGameViewportClient_execHandleInputKey_Parms
{
	int ControllerId;
	struct FName Key;
	unsigned char EventType;
	float AmountDepressed;
	unsigned long bGamepad : 1;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

// (0x3C - 0xFC)
class UGameViewportClient : public UObject
{
public:
	struct FPointer                                    VfTable_FViewportClient;                     // 0x003C (0x0004)
	struct FPointer                                    VfTable_FExec;                               // 0x0040 (0x0004)
	struct FPointer                                    Viewport;                                    // 0x0044 (0x0004)
	struct FPointer                                    ViewportFrame;                               // 0x0048 (0x0004)
	TArray< class UInteraction* >                      GlobalInteractions;                          // 0x004C (0x000C)
	class UClass*                                      UIControllerClass;                           // 0x0058 (0x0004)
	void*                                              UIController;                                // 0x005C (0x0004)
	class UConsole*                                    ViewportConsole;                             // 0x0060 (0x0004)
	struct FQWord                                      ShowFlags;                                   // 0x0064 (0x0008)
	struct FString                                     LoadingMessage;                              // 0x006C (0x000C)
	struct FString                                     SavingMessage;                               // 0x0078 (0x000C)
	struct FString                                     ConnectingMessage;                           // 0x0084 (0x000C)
	struct FString                                     PausedMessage;                               // 0x0090 (0x000C)
	struct FString                                     PrecachingMessage;                           // 0x009C (0x000C)
	unsigned long                                      bShowTitleSafeZone : 1;                      // 0x00A8 (0x0004) [0x00000001]
	unsigned long                                      bDisplayingUIMouseCursor : 1;                // 0x00A8 (0x0004) [0x00000002]
	unsigned long                                      bUIMouseCaptureOverride : 1;                 // 0x00A8 (0x0004) [0x00000004]
	unsigned long                                      bDisableWorldRendering : 1;                  // 0x00A8 (0x0004) [0x00000008]
	struct FTitleSafeZoneArea                          TitleSafeZone;                               // 0x00AC (0x0010)
	TArray< struct FSplitscreenData >                  SplitscreenInfo;                             // 0x00BC (0x000C)
	unsigned char                                      DesiredSplitscreenType;                      // 0x00C8 (0x0001)
	unsigned char                                      ActiveSplitscreenType;                       // 0x00C9 (0x0001)
	unsigned char                                      Default2PSplitType;                          // 0x00CA (0x0001)
	unsigned char                                      Default3PSplitType;                          // 0x00CB (0x0001)
	TArray< struct FDebugDisplayProperty >             DebugProperties;                             // 0x00CC (0x000C)
	struct FScriptDelegate                             __HandleInputKey__Delegate;                  // 0x00D8 (0x000C)
	struct FScriptDelegate                             __HandleInputAxis__Delegate;                 // 0x00E4 (0x000C)
	struct FScriptDelegate                             __HandleInputChar__Delegate;                 // 0x00F0 (0x000C)

private:
	static UClass* ClassPointer;

public:
	static UClass* StaticClass ()
	{
		if ( !ClassPointer )
			ClassPointer = UObject::FindClass( "Class Engine.GameViewportClient" );

		return ClassPointer;
	};

public:
	int RemoveLocalPlayer ( void* ExistingPlayer )
	{
		static UFunction* pfnRemoveLocalPlayer = NULL;

		if ( !pfnRemoveLocalPlayer )
			pfnRemoveLocalPlayer = UObject::FindObject< UFunction >( "Function Engine.GameViewportClient.RemoveLocalPlayer" );

		UGameViewportClient_execRemoveLocalPlayer_Parms RemoveLocalPlayer_Parms;
		RemoveLocalPlayer_Parms.ExistingPlayer = ExistingPlayer;

		this->ProcessEvent( pfnRemoveLocalPlayer, &RemoveLocalPlayer_Parms, NULL );

		return RemoveLocalPlayer_Parms.ReturnValue;
	};

	int AddLocalPlayer ( void* NewPlayer )
	{
		static UFunction* pfnAddLocalPlayer = NULL;

		if ( !pfnAddLocalPlayer )
