/////////////////////////////////////////////////////////////////////////////
// Unreal Engine MiniSDK Generator by uNrEaL
// Game: CrimeCraft
// File: UPrimitiveComponent.h
// Date: 06/16/2011 @ 05:19:39.604
/////////////////////////////////////////////////////////////////////////////

#ifdef _MSC_VER
#pragma pack( push, 4 )
#endif

enum ERadialImpulseFalloff
{
	RIF_Constant = 0,
	RIF_Linear = 1,
	RIF_MAX = 2
};

enum ERBCollisionChannel
{
	RBCC_Default = 0,
	RBCC_Nothing = 1,
	RBCC_Pawn = 2,
	RBCC_Vehicle = 3,
	RBCC_Water = 4,
	RBCC_GameplayPhysics = 5,
	RBCC_EffectPhysics = 6,
	RBCC_Untitled1 = 7,
	RBCC_Untitled2 = 8,
	RBCC_Untitled3 = 9,
	RBCC_Untitled4 = 10,
	RBCC_Cloth = 11,
	RBCC_FluidDrain = 12,
	RBCC_SoftBody = 13,
	RBCC_FracturedMeshPart = 14,
	RBCC_BlockingVolume = 15,
	RBCC_DeadPawn = 16,
	RBCC_MAX = 17
};

struct UPrimitiveComponent_execGetRotation_Parms
{
	struct FRotator ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct UPrimitiveComponent_execGetPosition_Parms
{
	struct FVector ReturnValue; // CPF_ReturnParm
};// FUNC_Final

struct UPrimitiveComponent_execSetAbsolute_Parms
{
	unsigned long NewAbsoluteTranslation : 1;
	unsigned long NewAbsoluteRotation : 1;
	unsigned long NewAbsoluteScale : 1;
};// FUNC_Native

struct UPrimitiveComponent_execSetScale3D_Parms
{
	struct FVector NewScale3D;
};// FUNC_Native

struct UPrimitiveComponent_execSetScale_Parms
{
	float NewScale;
};// FUNC_Native

struct UPrimitiveComponent_execSetRotation_Parms
{
	struct FRotator NewRotation;
};// FUNC_Native

struct UPrimitiveComponent_execSetTranslation_Parms
{
	struct FVector NewTranslation;
};// FUNC_Native

struct UPrimitiveComponent_execSetActorCollision_Parms
{
	unsigned long NewCollideActors : 1;
	unsigned long NewBlockActors : 1;
	unsigned long NewAlwaysCheckCollision : 1;
};// FUNC_Final FUNC_Native

struct UPrimitiveComponent_execSetTraceBlocking_Parms
{
	unsigned long NewBlockZeroExtent : 1;
	unsigned long NewBlockNonZeroExtent : 1;
};// FUNC_Final FUNC_Native

struct UPrimitiveComponent_execSetViewOwnerDepthPriorityGroup_Parms
{
	unsigned long bNewUseViewOwnerDepthPriorityGroup : 1;
	unsigned char NewViewOwnerDepthPriorityGroup;
};// FUNC_Final FUNC_Native

struct UPrimitiveComponent_execSetDepthPriorityGroup_Parms
{
	unsigned char NewDepthPriorityGroup;
};// FUNC_Final FUNC_Native

struct UPrimitiveComponent_execSetLightingChannels_Parms
{
	struct FLightingChannelContainer NewLightingChannels;
};// FUNC_Final FUNC_Native

struct UPrimitiveComponent_execSetCullDistance_Parms
{
	float NewCullDistance;
};// FUNC_Final FUNC_Native

struct UPrimitiveComponent_execSetLightEnvironment_Parms
{
	void* NewLightEnvironment;
};// FUNC_Final FUNC_Native

struct UPrimitiveComponent_execSetShadowParent_Parms
{
	class UPrimitiveComponent* NewShadowParent;
};// FUNC_Final FUNC_Native

struct UPrimitiveComponent_execSetIgnoreOwnerHidden_Parms
{
	unsigned long bNewIgnoreOwnerHidden : 1;
};// FUNC_Final FUNC_Native

struct UPrimitiveComponent_execSetOnlyOwnerSee_Parms
{
	unsigned long bNewOnlyOwnerSee : 1;
};// FUNC_Final FUNC_Native

struct UPrimitiveComponent_execSetOwnerNoSee_Parms
{
	unsigned long bNewOwnerNoSee : 1;
};// FUNC_Final FUNC_Native

struct UPrimitiveComponent_execSetHidden_Parms
{
	unsigned long NewHidden : 1;
};// FUNC_Final FUNC_Native

struct UPrimitiveComponent_execSetRBDominanceGroup_Parms
{
	unsigned char InDomGroup;
};// FUNC_Final FUNC_Native

struct UPrimitiveComponent_execGetRootBodyInstance_Parms
{
	void* ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct UPrimitiveComponent_execSetPhysMaterialOverride_Parms
{
	void* NewPhysMaterial;
};// FUNC_Final FUNC_Native

struct UPrimitiveComponent_execInitRBPhys_Parms
{
};// FUNC_Final FUNC_Native

struct UPrimitiveComponent_execSetNotifyRigidBodyCollision_Parms
{
	unsigned long bNewNotifyRigidBodyCollision : 1;
};// FUNC_Final FUNC_Native

struct UPrimitiveComponent_execSetRBChannel_Parms
{
	unsigned char Channel;
};// FUNC_Final FUNC_Native

struct UPrimitiveComponent_execSetRBCollidesWithChannel_Parms
{
	unsigned char Channel;
	unsigned long bNewCollides : 1;
};// FUNC_Final FUNC_Native

struct UPrimitiveComponent_execSetBlockRigidBody_Parms
{
	unsigned long bNewBlockRigidBody : 1;
};// FUNC_Final FUNC_Native

struct UPrimitiveComponent_execRigidBodyIsAwake_Parms
{
	struct FName BoneName;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct UPrimitiveComponent_execPutRigidBodyToSleep_Parms
{
	struct FName BoneName;
};// FUNC_Final FUNC_Native

struct UPrimitiveComponent_execWakeRigidBody_Parms
{
	struct FName BoneName;
};// FUNC_Final FUNC_Native

struct UPrimitiveComponent_execSetRBRotation_Parms
{
	struct FRotator NewRot;
	struct FName BoneName;
};// FUNC_Final FUNC_Native

struct UPrimitiveComponent_execSetRBPosition_Parms
{
	struct FVector NewPos;
	struct FName BoneName;
};// FUNC_Final FUNC_Native

struct UPrimitiveComponent_execRetardRBLinearVelocity_Parms
{
	struct FVector RetardDir;
	float VelScale;
};// FUNC_Final FUNC_Native

struct UPrimitiveComponent_execSetRBAngularVelocity_Parms
{
	struct FVector NewAngVel;
	unsigned long bAddToCurrent : 1;
};// FUNC_Final FUNC_Native

struct UPrimitiveComponent_execSetRBLinearVelocity_Parms
{
	struct FVector NewVel;
	unsigned long bAddToCurrent : 1;
};// FUNC_Final FUNC_Native

struct UPrimitiveComponent_execAddTorque_Parms
{
	struct FVector Torque;
	struct FName BoneName;
};// FUNC_Final FUNC_Native

struct UPrimitiveComponent_execAddRadialForce_Parms
{
	struct FVector Origin;
	float Radius;
	float Strength;
	unsigned char Falloff;
};// FUNC_Final FUNC_Native

struct UPrimitiveComponent_execAddForce_Parms
{
	struct FVector Force;
	struct FVector Position;
	struct FName BoneName;
};// FUNC_Final FUNC_Native

struct UPrimitiveComponent_execAddRadialImpulse_Parms
{
	struct FVector Origin;
	float Radius;
	float Strength;
	unsigned char Falloff;
	unsigned long bVelChange : 1;
};// FUNC_Final FUNC_Native

struct UPrimitiveComponent_execAddImpulse_Parms
{
	struct FVector Impulse;
	struct FVector Position;
	struct FName BoneName;
	unsigned long bVelChange : 1;
};// FUNC_Final FUNC_Native

// (0x55 - 0x1CC)
class UPrimitiveComponent : public UActorComponent
{
public:
	struct FPointer                                    SceneInfo;                                   // 0x0058 (0x0004)
	int                                                DetachFence;                                 // 0x005C (0x0004)
	float                                              LocalToWorldDeterminant;                     // 0x0060 (0x0004)
	unsigned char                                      unknown_data14[ 12 ];                        // 0x0064 (0x000C)
	struct FMatrix                                     LocalToWorld;                                // 0x0070 (0x0040)
	int                                                MotionBlurInfoIndex;                         // 0x00B0 (0x0004)
	TArray< struct FPointer >                          DecalList;                                   // 0x00B4 (0x000C)
	TArray< void* >                                    DecalsToReattach;                            // 0x00C0 (0x000C)
	int                                                Tag;                                         // 0x00CC (0x0004)
	class UPrimitiveComponent*                         ShadowParent;                                // 0x00D0 (0x0004)
	void*                                              FogVolumeComponent;                          // 0x00D4 (0x0004)
	struct FBoxSphereBounds                            Bounds;                                      // 0x00D8 (0x001C)
	void*                                              LightEnvironment;                            // 0x00F4 (0x0004)
	void*                                              PreviousLightEnvironment;                    // 0x00F8 (0x0004)
	float                                              MinDrawDistance;                             // 0x00FC (0x0004)
	float                                              MaxDrawDistance;                             // 0x0100 (0x0004)
	float                                              CachedMaxDrawDistance;                       // 0x0104 (0x0004)
	float                                              CullDistance;                                // 0x0108 (0x0004)
	float                                              CachedCullDistance;                          // 0x010C (0x0004)
	unsigned char                                      DepthPriorityGroup;                          // 0x0110 (0x0001)
	unsigned char                                      ViewOwnerDepthPriorityGroup;                 // 0x0111 (0x0001)
	unsigned char                                      DetailMode;                                  // 0x0112 (0x0001)
	float                                              MotionBlurScale;                             // 0x0114 (0x0004)
	unsigned long                                      bUseViewOwnerDepthPriorityGroup : 1;         // 0x0118 (0x0004) [0x00000001]
	unsigned long                                      bAllowCullDistanceVolume : 1;                // 0x0118 (0x0004) [0x00000002]
	unsigned long                                      HiddenGame : 1;                              // 0x0118 (0x0004) [0x00000004]
	unsigned long                                      HiddenEditor : 1;                            // 0x0118 (0x0004) [0x00000008]
	unsigned long                                      bOwnerNoSee : 1;                             // 0x0118 (0x0004) [0x00000010]
	unsigned long                                      bOnlyOwnerSee : 1;                           // 0x0118 (0x0004) [0x00000020]
	unsigned long                                      bIgnoreOwnerHidden : 1;                      // 0x0118 (0x0004) [0x00000040]
	unsigned long                                      bUseAsOccluder : 1;                          // 0x0118 (0x0004) [0x00000080]
	unsigned long                                      bAllowApproximateOcclusion : 1;              // 0x0118 (0x0004) [0x00000100]
	unsigned long                                      bFirstFrameOcclusion : 1;                    // 0x0118 (0x0004) [0x00000200]
	unsigned long                                      bIgnoreNearPlaneIntersection : 1;            // 0x0118 (0x0004) [0x00000400]
	unsigned long                                      bSelectable : 1;                             // 0x0118 (0x0004) [0x00000800]
	unsigned long                                      bForceMipStreaming : 1;                      // 0x0118 (0x0004) [0x00001000]
	unsigned long                                      bAcceptsDecals : 1;                          // 0x0118 (0x0004) [0x00002000]
	unsigned long                                      bAcceptsDecalsDuringGameplay : 1;            // 0x0118 (0x0004) [0x00004000]
	unsigned long                                      bAcceptsStaticDecals : 1;                    // 0x0118 (0x0004) [0x00008000]
	unsigned long                                      bAcceptsDynamicDecals : 1;                   // 0x0118 (0x0004) [0x00010000]
	unsigned long                                      bIsRefreshingDecals : 1;                     // 0x0118 (0x0004) [0x00020000]
	unsigned long                                      bAllowDecalAutomaticReAttach : 1;            // 0x0118 (0x0004) [0x00040000]
	unsigned long                                      bAcceptsFoliage : 1;                         // 0x0118 (0x0004) [0x00080000]
	int                                                TranslucencySortPriority;                    // 0x011C (0x0004)
	unsigned long                                      CastShadow : 1;                              // 0x0120 (0x0004) [0x00000001]
	unsigned long                                      bForceDirectLightMap : 1;                    // 0x0120 (0x0004) [0x00000002]
	unsigned long                                      bCastDynamicShadow : 1;                      // 0x0120 (0x0004) [0x00000004]
	unsigned long                                      bSelfShadowOnly : 1;                         // 0x0120 (0x0004) [0x00000008]
	unsigned long                                      bCastHiddenShadow : 1;                       // 0x0120 (0x0004) [0x00000010]
	unsigned long                                      bAcceptsLights : 1;                          // 0x0120 (0x0004) [0x00000020]
	unsigned long                                      bAcceptsDynamicLights : 1;                   // 0x0120 (0x0004) [0x00000040]
	struct FLightingChannelContainer                   LightingChannels;                            // 0x0124 (0x0004)
	unsigned long                                      bUsePrecomputedShadows : 1;                  // 0x0128 (0x0004) [0x00000001]
	unsigned long                                      bCullModulatedShadowOnBackfaces : 1;         // 0x0128 (0x0004) [0x00000002]
	unsigned long                                      bCullModulatedShadowOnEmissive : 1;          // 0x0128 (0x0004) [0x00000004]
	unsigned long                                      bAllowAmbientOcclusion : 1;                  // 0x0128 (0x0004) [0x00000008]
	unsigned long                                      CollideActors : 1;                           // 0x0128 (0x0004) [0x00000010]
	unsigned long                                      AlwaysCheckCollision : 1;                    // 0x0128 (0x0004) [0x00000020]
	unsigned long                                      BlockActors : 1;                             // 0x0128 (0x0004) [0x00000040]
	unsigned long                                      BlockZeroExtent : 1;                         // 0x0128 (0x0004) [0x00000080]
	unsigned long                                      BlockNonZeroExtent : 1;                      // 0x0128 (0x0004) [0x00000100]
	unsigned long                                      CanBlockCamera : 1;                          // 0x0128 (0x0004) [0x00000200]
	unsigned long                                      BlockRigidBody : 1;                          // 0x0128 (0x0004) [0x00000400]
	unsigned long                                      RigidBodyIgnorePawns : 1;                    // 0x0128 (0x0004) [0x00000800]
	unsigned char                                      RBChannel;                                   // 0x012C (0x0001)
	struct FRBCollisionChannelContainer                RBCollideWithChannels;                       // 0x0130 (0x0004)
	unsigned long                                      bDisableAllRigidBody : 1;                    // 0x0134 (0x0004) [0x00000001]
	unsigned long                                      bSkipRBGeomCreation : 1;                     // 0x0134 (0x0004) [0x00000002]
	unsigned long                                      bNotifyRigidBodyCollision : 1;               // 0x0134 (0x0004) [0x00000004]
	unsigned long                                      bFluidDrain : 1;                             // 0x0134 (0x0004) [0x00000008]
	unsigned long                                      bFluidTwoWay : 1;                            // 0x0134 (0x0004) [0x00000010]
	unsigned long                                      bIgnoreRadialImpulse : 1;                    // 0x0134 (0x0004) [0x00000020]
	unsigned long                                      bIgnoreRadialForce : 1;                      // 0x0134 (0x0004) [0x00000040]
	unsigned long                                      bIgnoreForceField : 1;                       // 0x0134 (0x0004) [0x00000080]
	unsigned long                                      bUseCompartment : 1;                         // 0x0134 (0x0004) [0x00000100]
	unsigned long                                      AlwaysLoadOnClient : 1;                      // 0x0134 (0x0004) [0x00000200]
	unsigned long                                      AlwaysLoadOnServer : 1;                      // 0x0134 (0x0004) [0x00000400]
	unsigned long                                      bIgnoreHiddenActorsMembership : 1;           // 0x0134 (0x0004) [0x00000800]
	unsigned long                                      bWasSNFiltered : 1;                          // 0x0134 (0x0004) [0x00001000]
	TArray< int >                                      OctreeNodes;                                 // 0x0138 (0x000C)
	void*                                              PhysMaterialOverride;                        // 0x0144 (0x0004)
	void*                                              BodyInstance;                                // 0x0148 (0x0004)
	unsigned char                                      RBDominanceGroup;                            // 0x014C (0x0001)
	struct FMatrix                                     CachedParentToWorld;                         // 0x0150 (0x0040)
	struct FVector                                     Translation;                                 // 0x0190 (0x000C)
	struct FRotator                                    Rotation;                                    // 0x019C (0x000C)
	float                                              Scale;                                       // 0x01A8 (0x0004)
	struct FVector                                     Scale3D;                                     // 0x01AC (0x000C)
	unsigned long                                      AbsoluteTranslation : 1;                     // 0x01B8 (0x0004) [0x00000001]
	unsigned long                                      AbsoluteRotation : 1;                        // 0x01B8 (0x0004) [0x00000002]
	unsigned long                                      AbsoluteScale : 1;                           // 0x01B8 (0x0004) [0x00000004]
	float                                              LastSubmitTime;                              // 0x01BC (0x0004)
	float                                              LastRenderTime;                              // 0x01C0 (0x0004)
	struct FBeastPrimPropertiesContainer               BeastProperties;                             // 0x01C4 (0x0004)
	float                                              ScriptRigidBodyCollisionThreshold;           // 0x01C8 (0x0004)

private:
	static UClass* ClassPointer;

public:
	static UClass* StaticClass ()
	{
		if ( !ClassPointer )
			ClassPointer = UObject::FindClass( "Class Engine.PrimitiveComponent" );

		return ClassPointer;
	};

public:
	struct FRotator GetRotation ()
	{
		static UFunction* pfnGetRotation = NULL;

		if ( !pfnGetRotation )
			pfnGetRotation = UObject::FindObject< UFunction >( "Function Engine.PrimitiveComponent.GetRotation" );

		UPrimitiveComponent_execGetRotation_Parms GetRotation_Parms;

		pfnGetRotation->FunctionFlags |= ~0x400;
		this->ProcessEvent( pfnGetRotation, &GetRotation_Parms, NULL );
		pfnGetRotation->FunctionFlags |= 0x400;

		return GetRotation_Parms.ReturnValue;
	};

	struct FVector GetPosition ()
	{
		static UFunction* pfnGetPosition = NULL;

		if ( !pfnGetPosition )
			pfnGetPosition = UObject::FindObject< UFunction >( "Function Engine.PrimitiveComponent.GetPosition" );

