/////////////////////////////////////////////////////////////////////////////
// Unreal Engine MiniSDK Generator by uNrEaL
// Game: CrimeCraft
// File: USkeletalMeshComponent.h
// Date: 06/16/2011 @ 05:19:39.663
/////////////////////////////////////////////////////////////////////////////

#ifdef _MSC_VER
#pragma pack( push, 4 )
#endif

enum EFaceFXRegOp
{
	FXRO_Add = 0,
	FXRO_Multiply = 1,
	FXRO_Replace = 2,
	FXRO_MAX = 3
};

enum EFaceFXBlendMode
{
	FXBM_Overwrite = 0,
	FXBM_Additive = 1,
	FXBM_MAX = 2
};

enum ERootMotionRotationMode
{
	RMRM_Ignore = 0,
	RMRM_RotateActor = 1,
	RMRM_MAX = 2
};

enum ERootMotionMode
{
	RMM_Translate = 0,
	RMM_Velocity = 1,
	RMM_Ignore = 2,
	RMM_Accel = 3,
	RMM_Relative = 4,
	RMM_MAX = 5
};

struct USkeletalMeshComponent_execBoneIsChildOfEx_Parms
{
	int BoneIndex;
	int ParentBoneIndex;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};

struct USkeletalMeshComponent_execBreakConstraintEx_Parms
{
	struct FName BoneName;
};

struct USkeletalMeshComponent_execBreakConstraint_Parms
{
	struct FVector Impulse;
	struct FVector HitLocation;
	struct FName InBoneName;
	unsigned long bVelChange : 1;
};// FUNC_Final

struct USkeletalMeshComponent_execSkelMeshCompOnParticleSystemFinished_Parms
{
	void* PSC;
};

struct USkeletalMeshComponent_eventPlayParticleEffect_Parms
{
	void* AnimNotifyData;
};// FUNC_Event

struct USkeletalMeshComponent_execStopAnim_Parms
{
};

struct USkeletalMeshComponent_execPlayAnim_Parms
{
	struct FName AnimName;
	float Duration;
	unsigned long bLoop : 1;
	unsigned long bRestartIfAlreadyPlaying : 1;
};

struct USkeletalMeshComponent_execUpdateMeshForBrokenConstraints_Parms
{
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execIsBoneHidden_Parms
{
	int BoneIndex;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execUnHideBone_Parms
{
	int BoneIndex;
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execHideBone_Parms
{
	int BoneIndex;
	unsigned long bTermBodiesBelow : 1;
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execSetFaceFXRegisterEx_Parms
{
	struct FString RegName;
	unsigned char RegOp;
	float FirstValue;
	float FirstInterpDuration;
	float NextValue;
	float NextInterpDuration;
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execSetFaceFXRegister_Parms
{
	struct FString RegName;
	float RegVal;
	unsigned char RegOp;
	float InterpDuration;
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execGetFaceFXRegister_Parms
{
	struct FString RegName;
	float ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execDeclareFaceFXRegister_Parms
{
	struct FString RegName;
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execIsPlayingFaceFXAnim_Parms
{
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execStopFaceFXAnim_Parms
{
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execPlayFaceFXAnim_Parms
{
	void* FaceFXAnimSetRef;
	struct FString AnimName;
	struct FString GroupName;
	void* SoundCueToPlay;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execToggleInstanceVertexWeights_Parms
{
	unsigned long bEnable : 1;
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execUpdateInstanceVertexWeightBones_Parms
{
	TArray< struct FBonePair > BonePairs;
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execFindInstanceVertexweightBonePair_Parms
{
	struct FBonePair Bones;
	int ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execRemoveInstanceVertexWeightBoneParented_Parms
{
	struct FName BoneName;
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execAddDynamicDiffName_Parms
{
	struct FName DiffName;
};// FUNC_Final

struct USkeletalMeshComponent_execAddInstanceVertexWeightBonePair_Parms
{
	struct FName Bone1;
	struct FName Bone2;
};// FUNC_Final

struct USkeletalMeshComponent_execAddInstanceVertexWeightBoneParented_Parms
{
	struct FName BoneName;
	unsigned long bPairWithParent : 1;
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execGetBonesWithinRadius_Parms
{
	struct FVector Origin;
	float Radius;
	int TraceFlags;
	TArray< struct FName > out_Bones; // CPF_OutParm
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execUpdateAnimations_Parms
{
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execForceSkelUpdate_Parms
{
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execUpdateRBBonesFromSpaceBases_Parms
{
	unsigned long bMoveUnfixedBodies : 1;
	unsigned long bTeleport : 1;
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execSetHasPhysicsAssetInstance_Parms
{
	unsigned long bHasInstance : 1;
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execFindBodyInstanceNamed_Parms
{
	struct FName BoneName;
	void* ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execFindConstraintBoneName_Parms
{
	int ConstraintIndex;
	struct FName ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execFindConstraintIndex_Parms
{
	struct FName ConstraintName;
	int ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execInitSkelControls_Parms
{
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execUpdateParentBoneMap_Parms
{
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execSetParentAnimComponent_Parms
{
	class USkeletalMeshComponent* NewParentAnimComp;
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execSetAnimTreeTemplate_Parms
{
	void* NewTemplate;
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execGetClosestCollidingBoneLocation_Parms
{
	struct FVector TestLocation;
	unsigned long bCheckZeroExtent : 1;
	unsigned long bCheckNonZeroExtent : 1;
	struct FVector ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execFindClosestBone_Parms
{
	struct FVector TestLocation;
	struct FVector BoneLocation; // CPF_OutParm
	float IgnoreScale;
	struct FName ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execTransformFromBoneSpace_Parms
{
	struct FName BoneName;
	struct FVector InPosition;
	struct FRotator InRotation;
	struct FVector OutPosition; // CPF_OutParm
	struct FRotator OutRotation; // CPF_OutParm
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execTransformToBoneSpace_Parms
{
	struct FName BoneName;
	struct FVector InPosition;
	struct FRotator InRotation;
	struct FVector OutPosition; // CPF_OutParm
	struct FRotator OutRotation; // CPF_OutParm
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execGetBoneAxis_Parms
{
	struct FName BoneName;
	unsigned char Axis;
	struct FVector ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execGetRefPosePosition_Parms
{
	int BoneIndex;
	struct FVector ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execBoneIsChildOf_Parms
{
	struct FName BoneName;
	struct FName ParentBoneName;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execGetBoneNames_Parms
{
	TArray< struct FName > BoneNames; // CPF_OutParm
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execGetParentBone_Parms
{
	struct FName BoneName;
	struct FName ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execGetBoneMatrix_Parms
{
	int BoneIndex;
	struct FMatrix ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execGetBoneName_Parms
{
	int BoneIndex;
	struct FName ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execMatchRefBone_Parms
{
	struct FName BoneName;
	int ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execGetBoneLocation_Parms
{
	struct FName BoneName;
	int Space;
	struct FVector ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execGetBoneQuaternion_Parms
{
	struct FName BoneName;
	int Space;
	struct FQuat ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execFindMorphNode_Parms
{
	struct FName InNodeName;
	void* ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execFindSkelControl_Parms
{
	struct FName InControlName;
	void* ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execAllAnimNodes_Parms
{
	class UClass* BaseClass;
	void* Node; // CPF_OutParm
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execFindAnimNode_Parms
{
	struct FName InNodeName;
	void* ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execFindMorphTarget_Parms
{
	struct FName MorphTargetName;
	void* ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execGetAnimLength_Parms
{
	struct FName AnimSeqName;
	float ReturnValue; // CPF_ReturnParm
};// FUNC_Final

struct USkeletalMeshComponent_execGetAnimRateByDuration_Parms
{
	struct FName AnimSeqName;
	float Duration;
	float ReturnValue; // CPF_ReturnParm
};// FUNC_Final

struct USkeletalMeshComponent_execRestoreSavedAnimSets_Parms
{
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execSaveAnimSets_Parms
{
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execFindAnimSequence_Parms
{
	struct FName AnimSeqName;
	void* ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execWakeSoftBody_Parms
{
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execSetSoftBodyFrozen_Parms
{
	unsigned long bNewFrozen : 1;
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execUpdateSoftBodyParams_Parms
{
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execSetClothValidBounds_Parms
{
	struct FVector ClothValidBoundsMin;
	struct FVector ClothValidBoundsMax;
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execEnableClothValidBounds_Parms
{
	unsigned long IfEnableClothValidBounds : 1;
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execAttachClothToCollidingShapes_Parms
{
	unsigned long AttatchTwoWay : 1;
	unsigned long AttachTearable : 1;
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execSetClothVelocity_Parms
{
	struct FVector VelocityOffSet;
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execSetClothPosition_Parms
{
	struct FVector ClothOffSet;
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execSetClothSleep_Parms
{
	unsigned long IfClothSleep : 1;
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execSetClothThickness_Parms
{
	float ClothThickness;
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execSetClothTearFactor_Parms
{
	float ClothTearFactor;
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execSetClothStretchingStiffness_Parms
{
	float ClothStretchingStiffness;
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execSetClothSolverIterations_Parms
{
	int ClothSolverIterations;
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execSetClothSleepLinearVelocity_Parms
{
	float ClothSleepLinearVelocity;
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execSetClothPressure_Parms
{
	float ClothPressure;
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execSetClothFriction_Parms
{
	float ClothFriction;
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execSetClothFlags_Parms
{
	int ClothFlags;
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execSetClothDampingCoefficient_Parms
{
	float ClothDampingCoefficient;
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execSetClothCollisionResponseCoefficient_Parms
{
	float ClothCollisionResponseCoefficient;
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execSetClothBendingStiffness_Parms
{
	float ClothBendingStiffness;
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execSetClothAttachmentTearFactor_Parms
{
	float ClothAttachTearFactor;
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execSetClothAttachmentResponseCoefficient_Parms
{
	float ClothAttachmentResponseCoefficient;
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execGetClothThickness_Parms
{
	float ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execGetClothTearFactor_Parms
{
	float ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execGetClothStretchingStiffness_Parms
{
	float ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execGetClothSolverIterations_Parms
{
	int ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execGetClothSleepLinearVelocity_Parms
{
	float ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execGetClothPressure_Parms
{
	float ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execGetClothFriction_Parms
{
	float ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execGetClothFlags_Parms
{
	int ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execGetClothDampingCoefficient_Parms
{
	float ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execGetClothCollisionResponseCoefficient_Parms
{
	float ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execGetClothBendingStiffness_Parms
{
	float ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execGetClothAttachmentTearFactor_Parms
{
	float ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execGetClothAttachmentResponseCoefficient_Parms
{
	float ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execResetClothVertsToRefPose_Parms
{
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execSetAttachClothVertsToBaseBody_Parms
{
	unsigned long bAttachVerts : 1;
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execSetClothExternalForce_Parms
{
	struct FVector InForce;
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execUpdateClothParams_Parms
{
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execSetClothFrozen_Parms
{
	unsigned long bNewFrozen : 1;
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execSetEnableClothSimulation_Parms
{
	unsigned long bInEnable : 1;
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execSetForceRefPose_Parms
{
	unsigned long bNewForceRefPose : 1;
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execSetPhysicsAsset_Parms
{
	void* NewPhysicsAsset;
	unsigned long bForceReInit : 1;
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execSetSkeletalMesh_Parms
{
	class USkeletalMesh* NewMesh;
	unsigned long bKeepSpaceBases : 1;
	unsigned long InbAlwaysUseInstanceWeights : 1;
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execAttachedComponents_Parms
{
	class UClass* BaseClass;
	class UActorComponent* OutComponent; // CPF_OutParm
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execIsComponentAttached_Parms
{
	class UActorComponent* Component;
	struct FName BoneName;
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execFindComponentAttachedToBone_Parms
{
	struct FName InBoneName;
	class UActorComponent* ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execGetSocketBoneName_Parms
{
	struct FName InSocketName;
	struct FName ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execGetSocketByName_Parms
{
	struct FName InSocketName;
	void* ReturnValue; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execGetSocketWorldLocationAndRotation_Parms
{
	struct FName InSocketName;
	struct FVector OutLocation; // CPF_OutParm
	struct FRotator OutRotation; // CPF_OutParm
	unsigned long ReturnValue : 1; // CPF_ReturnParm
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execAttachComponentToSocket_Parms
{
	class UActorComponent* Component;
	struct FName SocketName;
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execDetachComponent_Parms
{
	class UActorComponent* Component;
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execAttachComponent_Parms
{
	class UActorComponent* Component;
	struct FName BoneName;
	struct FVector RelativeLocation;
	struct FRotator RelativeRotation;
	struct FVector RelativeScale;
};// FUNC_Final FUNC_Native

struct USkeletalMeshComponent_execGetMaterialExt_Parms
{
	int ElementIndex;
	class UMaterialInterface* ReturnValue; // CPF_ReturnParm
};// FUNC_Native

// (0x1D8 - 0x4B4)
class USkeletalMeshComponent : public UMeshComponent
{
public:
	class USkeletalMesh*                               SkeletalMesh;                                // 0x01D8 (0x0004)
	class USkeletalMeshComponent*                      AttachedToSkelComponent;                     // 0x01DC (0x0004)
	TArray< class USkeletalMesh* >                     ExtraSkeletalMeshes;                         // 0x01E0 (0x000C)
	void*                                              AnimTreeTemplate;                            // 0x01EC (0x0004)
	void*                                              Animations;                                  // 0x01F0 (0x0004)
	TArray< void* >                                    AnimTickArray;                               // 0x01F4 (0x000C)
	void*                                              PhysicsAsset;                                // 0x0200 (0x0004)
	void*                                              PhysicsAssetInstance;                        // 0x0204 (0x0004)
	float                                              PhysicsWeight;                               // 0x0208 (0x0004)
	float                                              GlobalAnimRateScale;                         // 0x020C (0x0004)
	struct FPointer                                    MeshObject;                                  // 0x0210 (0x0004)
	TArray< struct FPointer >                          ExtraMeshObjects;                            // 0x0214 (0x000C)
	struct FColor                                      WireframeColor;                              // 0x0220 (0x0004)
	TArray< unsigned char >                            ScaleToTranslationBones;                     // 0x0224 (0x000C)
	TArray< struct FMatrix >                           SpaceBases;                                  // 0x0230 (0x000C)
	TArray< struct FBoneAtom >                         LocalAtoms;                                  // 0x023C (0x000C)
	TArray< unsigned char >                            RequiredBones;                               // 0x0248 (0x000C)
	class USkeletalMeshComponent*                      ParentAnimComponent;                         // 0x0254 (0x0004)
	TArray< int >                                      ParentBoneMap;                               // 0x0258 (0x000C)
	TArray< void* >                                    AnimSets;                                    // 0x0264 (0x000C)
	TArray< void* >                                    TemporarySavedAnimSets;                      // 0x0270 (0x000C)
	TArray< void* >                                    MorphSets;                                   // 0x027C (0x000C)
	TArray< struct FActiveMorph >                      ActiveMorphs;                                // 0x0288 (0x000C)
	TArray< struct FAttachment >                       Attachments;                                 // 0x0294 (0x000C)
	TArray< unsigned char >                            SkelControlIndex;                            // 0x02A0 (0x000C)
	int                                                ForcedLodModel;                              // 0x02AC (0x0004)
	int                                                MinLodModel;                                 // 0x02B0 (0x0004)
	int                                                PredictedLODLevel;                           // 0x02B4 (0x0004)
	int                                                OldPredictedLODLevel;                        // 0x02B8 (0x0004)
	float                                              MaxDistanceFactor;                           // 0x02BC (0x0004)
	int                                                bForceWireframe;                             // 0x02C0 (0x0004)
	int                                                bForceRefpose;                               // 0x02C4 (0x0004)
	int                                                bOldForceRefPose;                            // 0x02C8 (0x0004)
	unsigned long                                      bNoSkeletonUpdate : 1;                       // 0x02CC (0x0004) [0x00000001]
	int                                                bDisplayBones;                               // 0x02D0 (0x0004)
	int                                                bShowPrePhysBones;                           // 0x02D4 (0x0004)
	int                                                bHideSkin;                                   // 0x02D8 (0x0004)
	int                                                bForceRawOffset;                             // 0x02DC (0x0004)
	int                                                bIgnoreControllers;                          // 0x02E0 (0x0004)
	int                                                bTransformFromAnimParent;                    // 0x02E4 (0x0004)
	int                                                TickTag;                                     // 0x02E8 (0x0004)
	int                                                CachedAtomsTag;                              // 0x02EC (0x0004)
	int                                                bUseSingleBodyPhysics;                       // 0x02F0 (0x0004)
	int                                                bRequiredBonesUpToDate;                      // 0x02F4 (0x0004)
	float                                              MinDistFactorForKinematicUpdate;             // 0x02F8 (0x0004)
	struct FName                                       PhysicsBlendZeroDriftBoneName;               // 0x02FC (0x0008)
	int                                                FramesPhysicsAsleep;                         // 0x0304 (0x0004)
	unsigned long                                      bSkipAllUpdateWhenPhysicsAsleep : 1;         // 0x0308 (0x0004) [0x00000001]
	unsigned long                                      bConsiderAllBodiesForBounds : 1;             // 0x0308 (0x0004) [0x00000002]
	unsigned long                                      bUpdateSkelWhenNotRendered : 1;              // 0x0308 (0x0004) [0x00000004]
	unsigned long                                      bIgnoreControllersWhenNotRendered : 1;       // 0x0308 (0x0004) [0x00000008]
	unsigned long                                      bNotUpdatingKinematicDueToDistance : 1;      // 0x0308 (0x0004) [0x00000010]
	unsigned long                                      bForceDiscardRootMotion : 1;                 // 0x0308 (0x0004) [0x00000020]
	unsigned long                                      bRootMotionModeChangeNotify : 1;             // 0x0308 (0x0004) [0x00000040]
	unsigned long                                      bRootMotionExtractedNotify : 1;              // 0x0308 (0x0004) [0x00000080]
	unsigned long                                      bDisableFaceFXMaterialInstanceCreation : 1;  // 0x0308 (0x0004) [0x00000100]
	unsigned long                                      bAnimTreeInitialised : 1;                    // 0x0308 (0x0004) [0x00000200]
	unsigned long                                      bForceMeshObjectUpdate : 1;                  // 0x0308 (0x0004) [0x00000400]
	unsigned long                                      bHasPhysicsAssetInstance : 1;                // 0x0308 (0x0004) [0x00000800]
	unsigned long                                      bUpdateKinematicBonesFromAnimation : 1;      // 0x0308 (0x0004) [0x00001000]
	unsigned long                                      bUpdateJointsFromAnimation : 1;              // 0x0308 (0x0004) [0x00002000]
	unsigned long                                      bSkelCompFixed : 1;                          // 0x0308 (0x0004) [0x00004000]
	unsigned long                                      bHasHadPhysicsBlendedIn : 1;                 // 0x0308 (0x0004) [0x00008000]
	unsigned long                                      bPerformPostPhysBlendActionsDone : 1;        // 0x0308 (0x0004) [0x00010000]
	unsigned long                                      bForceUpdateAttachmentsInTick : 1;           // 0x0308 (0x0004) [0x00020000]
	unsigned long                                      bEnableFullAnimWeightBodies : 1;             // 0x0308 (0x0004) [0x00040000]
	unsigned long                                      bPerBoneVolumeEffects : 1;                   // 0x0308 (0x0004) [0x00080000]
	unsigned long                                      bSyncActorLocationToRootRigidBody : 1;       // 0x0308 (0x0004) [0x00100000]
	unsigned long                                      bUseRawData : 1;                             // 0x0308 (0x0004) [0x00200000]
	unsigned long                                      bDisableWarningWhenAnimNotFound : 1;         // 0x0308 (0x0004) [0x00400000]
	unsigned long                                      bOverrideAttachmentOwnerVisibility : 1;      // 0x0308 (0x0004) [0x00800000]
	unsigned long                                      bPauseAnims : 1;                             // 0x0308 (0x0004) [0x01000000]
	unsigned long                                      bChartDistanceFactor : 1;                    // 0x0308 (0x0004) [0x02000000]
	unsigned long                                      bEnableLineCheckWithBounds : 1;              // 0x0308 (0x0004) [0x04000000]
	struct FVector                                     LineCheckBoundsScale;                        // 0x030C (0x000C)
	unsigned long                                      bEnableClothSimulation : 1;                  // 0x0318 (0x0004) [0x00000001]
	unsigned long                                      bDisableClothCollision : 1;                  // 0x0318 (0x0004) [0x00000002]
	unsigned long                                      bClothFrozen : 1;                            // 0x0318 (0x0004) [0x00000004]
	unsigned long                                      bAutoFreezeClothWhenNotRendered : 1;         // 0x0318 (0x0004) [0x00000008]
	unsigned long                                      bClothAwakeOnStartup : 1;                    // 0x0318 (0x0004) [0x00000010]
	unsigned long                                      bClothBaseVelClamp : 1;                      // 0x0318 (0x0004) [0x00000020]
	unsigned long                                      bAttachClothVertsToBaseBody : 1;             // 0x0318 (0x0004) [0x00000040]
	unsigned long                                      bIsClothOnStaticObject : 1;                  // 0x0318 (0x0004) [0x00000080]
	unsigned long                                      bUpdatedFixedClothVerts : 1;                 // 0x0318 (0x0004) [0x00000100]
	unsigned long                                      bRecentlyRendered : 1;                       // 0x0318 (0x0004) [0x00000200]
	unsigned long                                      bCacheAnimSequenceNodes : 1;                 // 0x0318 (0x0004) [0x00000400]
	unsigned long                                      bForceMeshObjectUpdates : 1;                 // 0x0318 (0x0004) [0x00000800]
	unsigned long                                      bNeedsInstanceWeightUpdate : 1;              // 0x0318 (0x0004) [0x00001000]
	unsigned long                                      bUseSpecialInfluenceMode : 1;                // 0x0318 (0x0004) [0x00002000]
	unsigned long                                      bResetSpecialInfluence : 1;                  // 0x0318 (0x0004) [0x00004000]
	unsigned long                                      bAlwaysUseInstanceWeights : 1;               // 0x0318 (0x0004) [0x00008000]
	unsigned long                                      bAlwaysUseDynamicIndexBuffer : 1;            // 0x0318 (0x0004) [0x00010000]
	unsigned long                                      bAlwaysUseDynamicTextureCoordinates : 1;     // 0x0318 (0x0004) [0x00020000]
	int                                                DynamicTextureCoordinatesIndex;              // 0x031C (0x0004)
	void*                                              DynamicDiffStore;                            // 0x0320 (0x0004)
	TArray< struct FBonePair >                         InstanceVertexWeightBones;                   // 0x0324 (0x000C)
	TArray< struct FName >                             DynamicDiffNames;                            // 0x0330 (0x000C)
	TArray< struct FName >                             LastPreviewDynamicDiffsNames;                // 0x033C (0x000C)
	struct FVector                                     ClothExternalForce;                          // 0x0348 (0x000C)
	struct FVector                                     ClothWind;                                   // 0x0354 (0x000C)
	struct FVector                                     ClothBaseVelClampRange;                      // 0x0360 (0x000C)
	float                                              ClothBlendWeight;                            // 0x036C (0x0004)
	struct FPointer                                    ClothSim;                                    // 0x0370 (0x0004)
	int                                                SceneIndex;                                  // 0x0374 (0x0004)
	TArray< struct FVector >                           ClothMeshPosData;                            // 0x0378 (0x000C)
	TArray< struct FVector >                           ClothMeshNormalData;                         // 0x0384 (0x000C)
	TArray< int >                                      ClothMeshIndexData;                          // 0x0390 (0x000C)
	int                                                NumClothMeshVerts;                           // 0x039C (0x0004)
	int                                                NumClothMeshIndices;                         // 0x03A0 (0x0004)
	TArray< int >                                      ClothMeshParentData;                         // 0x03A4 (0x000C)
	int                                                NumClothMeshParentIndices;                   // 0x03B0 (0x0004)
	TArray< struct FVector >                           ClothMeshWeldedPosData;                      // 0x03B4 (0x000C)
	TArray< struct FVector >                           ClothMeshWeldedNormalData;                   // 0x03C0 (0x000C)
	TArray< int >                                      ClothMeshWeldedIndexData;                    // 0x03CC (0x000C)
	int                                                ClothDirtyBufferFlag;                        // 0x03D8 (0x0004)
	unsigned char                                      ClothRBChannel;                              // 0x03DC (0x0001)
	struct FRBCollisionChannelContainer                ClothRBCollideWithChannels;                  // 0x03E0 (0x0004)
	float                                              ClothForceScale;                             // 0x03E4 (0x0004)
	float                                              ClothImpulseScale;                           // 0x03E8 (0x0004)
	float                                              ClothAttachmentTearFactor;                   // 0x03EC (0x0004)
	unsigned long                                      bClothUseCompartment : 1;                    // 0x03F0 (0x0004) [0x00000001]
	float                                              MinDistanceForClothReset;                    // 0x03F4 (0x0004)
	struct FVector                                     LastClothLocation;                           // 0x03F8 (0x000C)
	struct FPointer                                    SoftBodySim;                                 // 0x0404 (0x0004)
	int                                                SoftBodySceneIndex;                          // 0x0408 (0x0004)
	unsigned long                                      bEnableSoftBodySimulation : 1;               // 0x040C (0x0004) [0x00000001]
	TArray< struct FVector >                           SoftBodyTetraPosData;                        // 0x0410 (0x000C)
	TArray< int >                                      SoftBodyTetraIndexData;                      // 0x041C (0x000C)
	int                                                NumSoftBodyTetraVerts;                       // 0x0428 (0x0004)
	int                                                NumSoftBodyTetraIndices;                     // 0x042C (0x0004)
	float                                              SoftBodyImpulseScale;                        // 0x0430 (0x0004)
	unsigned long                                      bSoftBodyFrozen : 1;                         // 0x0434 (0x0004) [0x00000001]
	unsigned long                                      bAutoFreezeSoftBodyWhenNotRendered : 1;      // 0x0434 (0x0004) [0x00000002]
	unsigned long                                      bSoftBodyAwakeOnStartup : 1;                 // 0x0434 (0x0004) [0x00000004]
	unsigned long                                      bSoftBodyUseCompartment : 1;                 // 0x0434 (0x0004) [0x00000008]
	unsigned char                                      SoftBodyRBChannel;                           // 0x0438 (0x0001)
	struct FRBCollisionChannelContainer                SoftBodyRBCollideWithChannels;               // 0x043C (0x0004)
	struct FPointer                                    SoftBodyASVPlane;                            // 0x0440 (0x0004)
	class UMaterial*                                   LimitMaterial;                               // 0x0444 (0x0004)
	struct FBoneAtom                                   RootMotionDelta;                             // 0x0448 (0x0028)
	struct FVector                                     RootMotionVelocity;                          // 0x0470 (0x000C)
	struct FVector                                     RootBoneTranslation;                         // 0x047C (0x000C)
	struct FVector                                     RootMotionAccelScale;                        // 0x0488 (0x000C)
	unsigned char                                      RootMotionMode;                              // 0x0494 (0x0001)
	unsigned char                                      PreviousRMM;                                 // 0x0495 (0x0001)
	unsigned char                                      PendingRMM;                                  // 0x0496 (0x0001)
	unsigned char                                      OldPendingRMM;                               // 0x0497 (0x0001)
	int                                                bRMMOneFrameDelay;                           // 0x0498 (0x0004)
	unsigned char                                      RootMotionRotationMode;                      // 0x049C (0x0001)
	unsigned char                                      FaceFXBlendMode;                             // 0x049D (0x0001)
	struct FPointer                                    FaceFXActorInstance;                         // 0x04A0 (0x0004)
	void*                                              CachedFaceFXAudioComp;                       // 0x04A4 (0x0004)
	TArray< unsigned char >                            BoneVisibility;                              // 0x04A8 (0x000C)

private:
	static UClass* ClassPointer;

public:
	static UClass* StaticClass ()
	{
		if ( !ClassPointer )
			ClassPointer = UObject::FindClass( "Class Engine.SkeletalMeshComponent" );

		return ClassPointer;
	};

public:
	bool BoneIsChildOfEx ( int BoneIndex, int ParentBoneIndex )
	{
		static UFunction* pfnBoneIsChildOfEx = NULL;

		if ( !pfnBoneIsChildOfEx )
			pfnBoneIsChildOfEx = UObject::FindObject< UFunction >( "Function Engine.SkeletalMeshComponent.BoneIsChildOfEx" );

		USkeletalMeshComponent_execBoneIsChildOfEx_Parms BoneIsChildOfEx_Parms;
		BoneIsChildOfEx_Parms.BoneIndex = BoneIndex;
		BoneIsChildOfEx_Parms.ParentBoneIndex = ParentBoneIndex;

		this->ProcessEvent( pfnBoneIsChildOfEx, &BoneIsChildOfEx_Parms, NULL );

		return BoneIsChildOfEx_Parms.ReturnValue;
	};

	void BreakConstraintEx ( struct FName BoneName )
	{
		static UFunction* pfnBreakConstraintEx = NULL;

		if ( !pfnBreakConstraintEx )
